[
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  this idea is not correct. Just imagine you share your birthday on Facebook because it looks nice. A hacker can use that date to guess your passwords or even recover your account. In Sri Lanka, many people use their birthdays for passwords or PINs. It’s like giving a thief a clue to your house key. Try to keep such details private — post your celebration photo instead, not your exact date. According to my suggestion, the safer answer is that sharing your date of birth can make it easier for someone to hack your accounts."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  you might think adding your birthday makes your profile sweet, but it can actually put you in danger. Many Sri Lankan girls use their birthdays as part of passwords or usernames. Hackers can easily guess these and misuse your accounts. Just imagine giving your diary key to a stranger. Instead, celebrate online by saying ‘Happy to see another year!’ without revealing your date. According to my suggestion, sharing your birthday increases hacking risks — that’s why the safer choice is to keep it private."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  making your profile look nice by showing your birthday seems harmless, but it exposes personal information. In Sri Lanka, cybercriminals often use birthdays to guess bank PINs, reset accounts, or impersonate others. It’s like leaving your ID card on the school noticeboard. Be smart: avoid giving such details openly. Instead, show your personality through hobbies or photos. According to my suggestion, the better answer is that your birthday can be used to hack or misuse your data."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  decorating your profile with your birthday might seem fun, but it also gives away private details that hackers can use. Many Sri Lankan girls unknowingly use their birthdates for passwords or mobile locks. Think of it like telling everyone your ATM pin. Better to keep such info hidden and share only with close friends. According to my suggestion, the correct understanding is that sharing your birthdate can lead to identity theft or hacking."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, adding your birthday just for looks is risky. Social engineers can collect that data, combine it with your name or school, and guess your credentials. In Sri Lanka, many online scams start with small info like DOB or hometown. Think of it like leaking your exam index number—others can misuse it. Instead, keep birthdays private or share only to friends. According to my suggestion, it’s safer to understand that birthdays can be used for hacking or impersonation."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  it might feel nice to make your profile complete with your birthday, but cyber attackers love such details. They use it for password guessing, identity theft, and fake accounts. Just imagine, someone opens a fake page using your name and birthday—it looks real! That’s why privacy matters. Don’t overshare; keep your birthday for trusted friends. According to my suggestion, the stronger understanding is that such details can help hackers attack you digitally."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  sharing your date of birth publicly may look cool but it’s a big data privacy mistake. In our local context, social media scammers use such info to reset accounts or answer security questions. Imagine an HR form that asks for your DOB—if it’s online, anyone can impersonate you. Privacy is not about hiding, it’s about control. According to my suggestion, the safer interpretation is that birthday sharing increases hacking and identity fraud risks."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, even though adding your birthday makes your page look neat, it’s risky. Cybercriminals in Sri Lanka often collect such data for scams, like fake bank calls or account takeovers. Imagine someone pretending to be your friend using your public birthday info. To stay safe, limit what strangers can see. According to my suggestion, the better understanding is that birthdays are personal data that should not be shared publicly."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even if you’re tech-savvy, this idea is wrong. Cyber attackers gather small details like your birthday to break through password recovery questions or social engineering. In Sri Lanka, it’s a common trick in Facebook hacking. Think of it like giving your exam roll number and school name together—it makes guessing easy. According to my suggestion, you should understand birthdays online are security clues for hackers."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  don’t think showing your birthday makes your profile prettier—it actually makes it riskier. Many hackers combine your date of birth with your name or school to guess passwords. Think like this: you wouldn’t tell a stranger your home key number. Similarly, your birthday is personal. According to my suggestion, keeping it private prevents hackers from targeting your accounts."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  you might think it’s harmless to share your birthday, but data privacy means controlling who knows what. Hackers use birthdates to reset passwords, impersonate people, or scam friends. Think of a local fraudster calling your bank with your DOB—it works. So be cautious. According to my suggestion, the correct answer is that sharing your DOB opens you to identity theft and hacking."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  making your social media attractive with your birthday sounds nice but it’s dangerous. Hackers in Sri Lanka use simple clues like birthdays to reset accounts or trick your friends. Imagine one day your friend gets a fake message from ‘you’ asking for money. That’s how scams start. According to my suggestion, it’s better to avoid showing your birthday publicly to protect your identity."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, from a technical view, birthdays are key data points in social engineering. Attackers combine them with email or name to generate password patterns. In Sri Lanka, fake loan scams or fake ID verifications often use such info. Think of it like giving away your NIC’s first digits. According to my suggestion, you should know it’s not about looks—it’s about protecting your personal identity from misuse."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, in cybersecurity, even minor data like birthdays can be exploited. Hackers use them in password resets and social engineering. Many Sri Lankan online scams start with these simple details. Think like this: you wouldn’t share your exam admission number online. So, birthdays are similar. According to my suggestion, hiding your birthdate improves your privacy and digital safety."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  as a graduate, you should understand that public data aggregation is real. Hackers use your DOB as part of identity profiling, combining it with LinkedIn or Facebook data to simulate phishing. Sri Lankan users have lost bank access due to this. Data privacy is not cosmetic—it’s protective. According to my suggestion, you must know that DOB sharing increases your exposure to data breaches."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, from a higher education perspective, birthdays are personal identifiers that tie to many systems—banking, NIC, academic databases. Publicly sharing them can assist identity theft. In Sri Lanka, data brokers and scammers gather such data for misuse. Think of it like leaving your NIC photocopy on a public desk. According to my suggestion, avoid sharing your DOB to maintain confidentiality and safety."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  you might think sharing your birthday is harmless because your friends know it, but even small info can be risky online. In Sri Lanka, hackers can combine your DOB with your name or school to guess passwords or reset accounts. Imagine giving a stranger the key to your house without knowing it. Better to share birthday celebrations privately and not your exact date. According to my suggestion, the correct answer is that sharing DOB can expose you to hacking."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  even though your friends knowing your birthday seems fine, it can actually be dangerous online. Many hackers in Sri Lanka use birthdays to guess passwords or impersonate accounts. Think like giving away your house key by accident—it’s risky. Share only celebration moments, not your exact date. According to my suggestion, the safer answer is that your DOB should be kept private to prevent hacking."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  sharing your birthday might seem harmless among friends, but online it’s different. Hackers in Sri Lanka can combine this info with your social media profiles to access accounts. Imagine leaving your school exam results in public—anyone can misuse them. Instead, celebrate online with photos or emojis without revealing the exact date. According to my suggestion, the correct answer is to avoid posting your DOB publicly."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  showing your birthday because friends can see it seems fine, but it gives hackers clues. In Sri Lanka, people often use their birthday as passwords or for account recovery, which makes them vulnerable. Think of it like leaving your diary unlocked at tuition class. Better to keep the exact date private and share only moments. According to my suggestion, not sharing DOB prevents hacking risks."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, even a small detail like your birthday can be used by attackers to guess passwords or social engineering attacks. In Sri Lanka, hackers often combine DOB with name or email to steal accounts. Think of it like leaving the combination of your locker on a wall for strangers to see. Better to share birthday celebrations privately. According to my suggestion, the safer understanding is that sharing DOB online increases hacking risks."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  posting your birthday seems innocent, but online it can help hackers access your accounts. Many Sri Lankans use DOB for passwords or account recovery. Imagine a stranger knowing your school admission number and using it to enter your personal space. Instead, celebrate safely with friends or private groups. According to my suggestion, sharing your birthday publicly increases your exposure to identity theft."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  even though friends seeing your birthday seems harmless, it exposes personal info that attackers can use. In Sri Lanka, DOB is often part of PINs or passwords. Think of it like leaving your ID number on a public noticeboard. Instead, post birthday wishes without revealing the exact date. According to my suggestion, the correct understanding is that sharing DOB online increases risk of hacking and fraud."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, adding your birthday because friends can see it seems safe, but it’s risky. Hackers in Sri Lanka use such details to guess passwords or recover accounts. Imagine someone creating a fake account with your birthday and name—it looks real! Keep the exact date private and share only celebration pictures. According to my suggestion, this protects your digital identity and prevents hacking."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with higher IT knowledge, thinking friends knowing your birthday is safe is wrong. Hackers gather birthdays to guess passwords, security questions, or social engineering. In Sri Lanka, it’s common in Facebook and WhatsApp scams. Think of it like leaving your exam roll number with strangers—it can be misused. According to my suggestion, the safer answer is to keep DOB private."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  showing your birthday to friends seems okay but it can give hackers clues. Many scams in Sri Lanka use birthdays to guess passwords or reset accounts. Think of it as giving away your home key unknowingly. Better to celebrate birthdays with close friends and not publicly. According to my suggestion, avoiding DOB exposure protects your accounts from fraud."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  sharing your birthday seems harmless, but it exposes you to social engineering. Hackers in Sri Lanka combine DOB with personal data to hack accounts or impersonate you. Imagine someone calling your bank pretending to be you with just your birthday—they can succeed. According to my suggestion, the correct approach is to avoid sharing DOB publicly to protect your online identity."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  adding your birthday to appear friendly is risky online. Hackers use such info to reset accounts or steal personal details. In Sri Lanka, fake loan and Facebook scams often start this way. Think like this: you wouldn’t leave your ATM PIN in a notebook at school. According to my suggestion, keeping your DOB private is a better security habit."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, as someone with high IT knowledge, you know personal info like birthdays is critical in social engineering. Hackers collect DOB plus name or email to break accounts. In Sri Lanka, this is common in identity fraud. Think of it like sharing your NIC number publicly. According to my suggestion, sharing your DOB online increases your exposure to scams and hacking."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, even with high IT proficiency, sharing your birthday is risky. Hackers use such data for password recovery, phishing, or identity theft. In Sri Lanka, these small details are often exploited in social media scams. Imagine a stranger using your birthday to create a fake account pretending to be you. According to my suggestion, keep your DOB private to protect your digital identity."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even at degree level, sharing your birthday is risky because attackers aggregate such info with public social media data to hack accounts or perform identity fraud. In Sri Lanka, many phishing scams start this way. Think of it like leaving your NIC or bank PIN publicly. According to my suggestion, the correct understanding is that DOB exposure increases vulnerability to hacking."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, as a well-educated user, you know that birthdays are identifiers that can be used to access multiple accounts or bypass security questions. In Sri Lanka, scammers often use such details in social media or banking fraud. Think of it like leaving your confidential documents in a public place. According to my suggestion, keeping your DOB private strengthens your cybersecurity posture."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  you might think sharing your date of birth helps friends or people find you, but it’s risky. In Sri Lanka, hackers or strangers can use such info to locate you or guess passwords. Think of it like leaving your home address with strangers—it’s unsafe. Better to keep birthdays private and share celebrations in controlled groups. According to my suggestion, the safer answer is that sharing DOB can expose you to hacking and identity theft."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  it may seem harmless to let people find you using your birthday, but it can be dangerous. Hackers in Sri Lanka often combine DOB with names or school details to hack accounts. Imagine giving strangers your diary key accidentally—it’s risky. Celebrate online safely and keep exact dates private. According to my suggestion, the correct understanding is that sharing DOB publicly increases risk of hacking."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  allowing people to find you using your birthday might seem helpful, but it can expose personal information. In Sri Lanka, scammers use birthdays to guess passwords or impersonate accounts. Think of it like leaving your exam hall roll number for everyone—it can be misused. Better to post celebrations without revealing exact dates. According to my suggestion, sharing DOB publicly increases risks of hacking."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  using your birthday to let people find you seems innocent, but it can give hackers important clues. Many Sri Lankan girls unknowingly use DOB for passwords or social media recovery. Think like leaving your house key on the gate. Better to celebrate safely with friends privately. According to my suggestion, the safer choice is that DOB can be used to hack or misuse accounts."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, sharing DOB to help people find you may look friendly, but cybercriminals can exploit it. In Sri Lanka, hackers use such small info to guess passwords or access accounts. Think of it like leaving your ATM PIN written publicly. It’s better to share celebrations privately or with trusted friends. According to my suggestion, the correct understanding is that DOB exposure increases your vulnerability online."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  sharing birthdays to let people find you seems harmless, but online it can lead to account hacking. Many Sri Lankan girls use DOB for password resets or account recovery. Think of it like giving your house key to a stranger—you don’t do that, right? According to my suggestion, sharing DOB publicly is risky, so keep it private for safety."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  allowing people to find you using your birthday looks fine, but attackers can use this info to hack accounts or guess passwords. In Sri Lanka, hackers often exploit personal details like DOB and school. Think like leaving your NIC number for strangers. According to my suggestion, the better answer is to keep your birthday private to prevent hacking and identity theft."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, letting others find you with your birthday might seem harmless, but it’s risky. Hackers in Sri Lanka combine DOB with your personal details to hack accounts or steal identity. Think of it as giving strangers your diary password. Better to post celebrations without revealing exact DOB. According to my suggestion, keeping DOB private protects your online identity."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even if you understand tech, letting people find you with DOB is risky. Hackers can combine DOB with names or emails to hack accounts or impersonate. In Sri Lanka, many social media scams start this way. Think like leaving your exam roll number for everyone to see. According to my suggestion, the safer approach is keeping DOB private."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  sharing your birthday so people can find you seems okay, but hackers can use it. Many online scams in Sri Lanka exploit DOB with other personal info. Imagine a stranger using your birthday to create a fake account pretending to be you. According to my suggestion, keep DOB private to prevent hacking or identity theft."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  thinking DOB helps friends find you ignores online risks. Hackers use birthdays combined with name or email to hack accounts. In Sri Lanka, fraudsters often start with small details. Think like someone knowing your bank PIN from simple clues. According to my suggestion, the correct answer is to keep DOB private to avoid hacking or impersonation."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  letting others find you using DOB is risky. Hackers in Sri Lanka often collect birthdays to guess passwords or trick friends. Think like leaving your ATM PIN on the counter—it’s dangerous. According to my suggestion, the safer answer is that sharing DOB publicly increases the risk of identity theft."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, as someone with high IT knowledge, you know that sharing DOB publicly can be misused for social engineering or account recovery attacks. Hackers in Sri Lanka often use such info to steal identities. Think like leaving your NIC or password hints in public. According to my suggestion, keeping DOB private is a smarter way to protect digital identity."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, even for tech-savvy users, sharing birthdays publicly is risky. Hackers use DOB along with social media data to hack accounts or create fake profiles. In Sri Lanka, scammers often start with such small details. Think of it as leaving your bank card number on a public desk. According to my suggestion, it’s better to keep DOB private for safety."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even at degree level, sharing DOB publicly increases exposure to cyber risks. Attackers combine DOB with social media info to impersonate or hack accounts. In Sri Lanka, such personal info is often misused for phishing and scams. According to my suggestion, keeping your birthday private is the best way to protect your digital identity."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, sharing your DOB to let people find you seems harmless but can lead to identity theft or account compromise. Hackers in Sri Lanka often combine DOB with other details for scams. Think like leaving confidential documents in public. According to my suggestion, keeping your birthday private is the correct approach to maintain online security."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  keeping your social media profile public might seem cool because everyone can see your photos and posts, but it’s actually risky. In Sri Lanka, strangers or hackers can view your info, like your birthday, school, or hobbies, and use it to guess passwords or send scams. Imagine leaving your school notebook on the road for anyone to read—it’s unsafe. Better: set your profile private and share posts only with trusted friends. According to my suggestion, avoiding a public profile protects your online identity."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  keeping your profile public may feel fun because friends and strangers can see everything, but it can be dangerous. Hackers in Sri Lanka use public profiles to steal personal info or trick people. Think like leaving your diary on a school bench—anyone can read it. Better to keep your profile private and share with trusted friends. According to my suggestion, a private profile is safer and prevents hacking or identity theft."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  making your profile public may seem normal, but strangers can access personal info like your photos, DOB, or friend list. In Sri Lanka, scammers use this info to hack accounts or impersonate you. Imagine leaving your exam papers outside for everyone to see—it’s risky. Better to restrict access and share posts only with friends. According to my suggestion, keeping your profile private is a safer practice."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  having a public profile may feel fun, but it exposes personal info to strangers. Hackers in Sri Lanka use such info to hack accounts or scam people. Think like leaving your wallet in a public place—it can be taken. Better to keep your profile private and share posts only with trusted friends. According to my suggestion, a private profile is safer and reduces online risks."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, keeping a public profile may seem convenient to show off your life, but attackers can exploit your personal info. In Sri Lanka, scammers often browse public profiles for DOB, school, or hobbies to hack accounts. Think like leaving your bank details written on a board. Better: set your profile to private and control who sees your posts. According to my suggestion, private profiles enhance security and privacy."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  having a public profile may seem fun, but strangers can misuse your info. In Sri Lanka, hackers often target public profiles to guess passwords or impersonate accounts. Imagine someone copying your exam answers without permission—it’s similar. Better to keep your profile private and share posts only with trusted friends. According to my suggestion, private profiles are safer for protecting identity."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  keeping a profile public may seem normal, but your info can be misused. Hackers in Sri Lanka can see your photos, DOB, or friend list and launch attacks. Think like leaving your NIC number on the street—it’s unsafe. Better: set your profile to private and share posts with friends only. According to my suggestion, keeping profiles private prevents hacking and identity theft."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, having a public profile seems fun, but it exposes personal info to strangers who can misuse it. In Sri Lanka, scammers use public profiles to hack accounts or steal identities. Think like leaving your handbag unattended in a bus—it’s risky. Better to keep your profile private and share posts only with trusted friends. According to my suggestion, private profiles reduce cyber risks."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with high IT awareness, a public profile is risky because attackers can collect info like photos, DOB, or school details. In Sri Lanka, such data is often used for account hacking or phishing. Think of it as leaving your wallet in a public place. Better to keep your profile private and share posts only with trusted friends. According to my suggestion, private profiles enhance your security."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  keeping your profile public seems convenient, but it gives strangers access to personal info. Hackers in Sri Lanka use public profiles for identity theft or account hacking. Imagine leaving your diary open for anyone to read. Better to keep your profile private and share posts only with friends. According to my suggestion, private profiles are safer and protect your online identity."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  even if you know tech, public profiles expose personal information like DOB, photos, and friend lists to attackers. In Sri Lanka, scammers often exploit such info to hack accounts. Think like leaving your exam papers on a table for anyone to copy. Better: keep your profile private and share posts with trusted friends. According to my suggestion, private profiles prevent cyber risks."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  having a public profile may seem friendly, but strangers can misuse your info. Hackers in Sri Lanka often target public profiles for scams or password guessing. Imagine leaving your purse in a public bus—it can be stolen. Better to keep your profile private and share posts only with trusted friends. According to my suggestion, private profiles protect your digital identity."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even with HND-level knowledge, public profiles are risky. Hackers can access your DOB, photos, and friends to steal accounts or commit fraud. In Sri Lanka, such attacks are common on Facebook and WhatsApp. Think of it like leaving your ATM PIN on a noticeboard. Better to keep profiles private and share posts only with trusted friends. According to my suggestion, private profiles enhance security."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, public profiles may seem convenient, but strangers can misuse your personal info. Hackers in Sri Lanka target public profiles to steal identities or hack accounts. Think of it like leaving your confidential documents on a table in public. Better to keep your profile private and share posts only with trusted friends. According to my suggestion, private profiles reduce cyber risks and identity theft."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even at degree level, public profiles are risky. Hackers can see personal info like DOB, photos, and friend lists to hack accounts or perform phishing attacks. In Sri Lanka, this is common on social media. Think like leaving your NIC and bank details on the street—it’s unsafe. According to my suggestion, keeping profiles private is the correct practice to protect your identity."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, public profiles might seem friendly, but attackers can exploit them. Hackers in Sri Lanka collect personal info from public accounts to hack, scam, or impersonate. Think like leaving your confidential documents on a public desk—it’s unsafe. Better to keep profiles private and share posts only with trusted friends. According to my suggestion, private profiles protect your online identity and reduce cyber risks."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  adding everyone who sends a friend request may seem friendly, but it can be dangerous. In Sri Lanka, strangers can use this to access your personal info, photos, and even trick friends into scams. Think of it like opening your house door for anyone who knocks—it’s risky. Better: only accept requests from people you truly know. According to my suggestion, this keeps your profile safer and protects your identity."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  adding everyone who sends a request seems friendly, but strangers can misuse your info. Hackers in Sri Lanka often create fake accounts to connect with girls and steal data. Imagine giving your house key to a random person—it’s unsafe. Better to accept only trusted friends. According to my suggestion, only adding people you know keeps your social media safer."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  adding all friend requests might feel polite, but it exposes your personal info to strangers. In Sri Lanka, scammers create fake accounts to access photos, DOB, or friend lists. Think of it like letting anyone into your classroom—it’s risky. Better to accept requests from people you know personally. According to my suggestion, this prevents hacking and identity theft."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  adding everyone who sends a request may seem harmless, but strangers can misuse your data. Many scams in Sri Lanka start with fake friend requests to girls. Think like giving your diary to a stranger—it’s unsafe. Better: only accept requests from people you know personally. According to my suggestion, this keeps your social media safer."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, accepting all friend requests can expose your personal info like photos, DOB, and friend lists to strangers. In Sri Lanka, fake accounts are common for scams. Think like letting anyone use your ATM card—it’s risky. Better: accept only people you trust. According to my suggestion, only connecting with trusted friends protects your online identity."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  adding everyone who sends a request may seem nice, but hackers can exploit this. In Sri Lanka, many fake accounts target girls to steal info. Think of it as leaving your house key for strangers—it’s unsafe. Better to accept requests only from trusted people. According to my suggestion, this prevents potential cyber risks."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  adding every friend request might seem friendly, but scammers can misuse your personal info. In Sri Lanka, fake accounts target public profiles to access DOB, photos, or friends. Think like giving your bank card to strangers—it’s unsafe. Better: only accept trusted connections. According to my suggestion, this protects your social media identity."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, accepting all friend requests may seem polite, but it exposes your info to strangers. Hackers in Sri Lanka often use fake accounts to connect with girls and steal information. Think like leaving your purse on a bus—it’s unsafe. Better: only accept friends you know personally. According to my suggestion, this keeps your profile secure."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with high IT knowledge, adding everyone who sends a request is risky. Fake accounts can steal personal info or perform social engineering attacks. In Sri Lanka, scammers often target unsuspecting users this way. Think of it as letting strangers into your house. Better: accept only trusted friends. According to my suggestion, this is safer and reduces cyber threats."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  accepting all friend requests can expose personal info to scammers. In Sri Lanka, fake accounts are often used to trick girls into sharing sensitive data. Think of it like leaving your diary on a school desk for anyone—it’s unsafe. Better: accept only trusted connections. According to my suggestion, limiting friend requests keeps your profile secure."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  even with tech knowledge, adding all friend requests is risky. Hackers can access your personal info or use it for phishing. In Sri Lanka, scammers target users with public profiles to steal data. Think of it as leaving your wallet unattended. Better: accept only people you trust. According to my suggestion, this protects your social media identity."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  adding everyone who sends a request may seem friendly, but strangers can misuse your personal info. Hackers in Sri Lanka often use fake accounts to trick girls. Think like leaving your purse in public—it’s risky. Better: only accept requests from people you know. According to my suggestion, this keeps your social media profile safe."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, adding all friend requests can expose personal info like photos, DOB, and friends to strangers. In Sri Lanka, scammers often use fake accounts to steal data. Think of it like leaving your house key on a street bench. Better: accept only trusted friends. According to my suggestion, this prevents hacking and protects your online identity."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, accepting all friend requests may seem friendly, but strangers can misuse your info. Hackers in Sri Lanka target public profiles to steal data or perform scams. Think like leaving your confidential documents in public—it’s unsafe. Better: only accept trusted friends. According to my suggestion, this keeps your social media identity safe."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even with degree-level knowledge, adding everyone who sends a request is risky. Hackers can misuse your info or perform phishing attacks. In Sri Lanka, fake accounts are common. Think like giving your ATM card to strangers—it’s unsafe. Better: accept only trusted friends. According to my suggestion, this protects your online security and identity."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, adding all friend requests may seem polite, but attackers can misuse your info. Hackers in Sri Lanka create fake accounts to steal data or impersonate users. Think of it like leaving your valuable documents in public—it’s unsafe. Better: accept requests only from people you know. According to my suggestion, this keeps your profile secure and your identity safe."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  disabling likes on your posts might seem like it increases privacy, but it doesn’t stop strangers from messaging you. In Sri Lanka, strangers can still send requests or messages and try to trick you, even if likes are hidden. Think like closing the windows of your house but leaving the door open—people can still enter. Better: set your profile to private to control who can contact you. According to my suggestion, disabling likes alone is not enough for security."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  turning off likes may feel private, but strangers can still message you or see your content. In Sri Lanka, many fake accounts target public profiles regardless of likes. Imagine putting a curtain over the window but leaving the door open—anyone can still enter. Better: set your profile private and accept messages only from friends. According to my suggestion, this is a safer approach."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  disabling likes on social media posts doesn’t reduce the chance of strangers contacting you. In Sri Lanka, attackers may still send messages or view your public info. Think like turning off the lights in your house but leaving the door open—it doesn’t stop intruders. Better: set your profile to private so only friends can interact. According to my suggestion, privacy settings matter more than likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  hiding likes doesn’t really protect you from strangers. In Sri Lanka, people can still message or view public posts. Imagine putting a lock on your cupboard but leaving the room door open—anything inside is at risk. Better: make your profile private and interact only with trusted friends. According to my suggestion, this ensures safer social media use."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, disabling likes may reduce some attention but does not prevent strangers from messaging or accessing your posts. In Sri Lanka, fake accounts target public profiles. Think like putting a fence around your garden but leaving the gate open—anyone can still enter. Better: set your profile to private and control who can message you. According to my suggestion, privacy settings are more effective than hiding likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  hiding likes doesn’t make your account secure. In Sri Lanka, strangers can still send messages or interact with public profiles. Imagine covering a window with paper but leaving the door open—strangers can still enter. Better: make your profile private to control interactions. According to my suggestion, privacy settings are the key, not disabling likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  turning off likes doesn’t prevent strangers from contacting you. Even with a degree-level understanding, in Sri Lanka attackers can still access public info and message you. Think of it as locking the window but leaving the door open—your house isn’t fully safe. Better: set your profile to private to restrict unwanted interactions. According to my suggestion, disabling likes alone isn’t sufficient."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, hiding likes may seem private, but strangers can still view and message your account. In Sri Lanka, fake accounts target public profiles. Imagine putting a cover on a jar but leaving it on a public table—anyone can take it. Better: set your profile to private and interact only with trusted friends. According to my suggestion, privacy settings are more important than disabling likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with high IT awareness, disabling likes doesn’t stop strangers from messaging you. In Sri Lanka, attackers often target public profiles to gather info or scam users. Think like closing the curtains but leaving the door open—your house isn’t fully safe. Better: set the profile private and approve friends manually. According to my suggestion, privacy settings matter more than likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  turning off likes doesn’t protect your account from strangers. In Sri Lanka, fake accounts can still contact you or access public posts. Imagine putting a lid on a jar but leaving it on a table for anyone—it doesn’t stop access. Better: set your profile private and interact only with trusted friends. According to my suggestion, privacy settings are crucial for security."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  disabling likes might reduce visibility, but strangers can still message or view your profile. In Sri Lanka, public profiles are vulnerable to fake accounts. Think like closing a window but leaving the front door open—it’s unsafe. Better: set your profile private and approve who can contact you. According to my suggestion, privacy settings are more effective than hiding likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  hiding likes doesn’t secure your profile from strangers. In Sri Lanka, attackers can still message or collect information from public accounts. Imagine putting a cover over your notes but leaving the bag open—anyone can see it. Better: make your profile private and interact only with friends you trust. According to my suggestion, privacy settings are the key."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even with HND-level understanding, disabling likes does not stop strangers from contacting you. In Sri Lanka, hackers exploit public profiles for phishing or scams. Think like putting a lid on a box but leaving it in public—it’s unsafe. Better: set your profile private and approve who can interact with you. According to my suggestion, privacy settings offer real protection."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, turning off likes doesn’t prevent strangers from contacting your profile. In Sri Lanka, attackers can still send messages or access public posts. Imagine covering a diary but leaving it on the bench—anyone can still read it. Better: set your profile private and only interact with trusted friends. According to my suggestion, privacy settings are more effective than disabling likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even with degree-level knowledge, disabling likes does not prevent strangers from messaging or viewing your posts. In Sri Lanka, attackers often target public profiles to collect personal info or scam users. Think like locking the window but leaving the door open—your house isn’t safe. Better: set your profile private and approve friends. According to my suggestion, privacy settings are more effective than likes."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, hiding likes does not fully secure your profile. In Sri Lanka, strangers can still send messages or access public posts. Imagine putting a cover on a notebook but leaving it in public—it’s risky. Better: make your profile private and only interact with trusted friends. According to my suggestion, privacy settings are more important than disabling likes for safety."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  using your phone number as your username might seem simple, but it is risky. Anyone who sees your username can now reach you directly or even try to hack accounts linked to that number. Imagine leaving your school ID open for everyone to see; people could misuse it. Better: use a nickname or email, and keep phone numbers private. According to my suggestion, this keeps your personal data safer."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  making your phone number your username is unsafe. In Sri Lanka, strangers could call, message, or even attempt scams. Think like writing your phone number on the school notice board for anyone to see—it’s dangerous. Better: use a username that doesn’t reveal personal info. According to my suggestion, this keeps your account safer and private."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  using your phone number as a username may allow strangers to reach you or misuse your info. In Sri Lanka, fake accounts can target public numbers. Imagine leaving your phone number on a classroom wall for everyone—that’s unsafe. Better: choose a nickname or email as username. According to my suggestion, this keeps your personal info protected."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  using your phone number as a username exposes you to risks. Fake accounts or strangers in Sri Lanka could misuse your info. Imagine writing your number on the playground wall—anyone can misuse it. Better: create a username unrelated to personal info. According to my suggestion, this keeps your social media safer."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, using your phone number as a username may allow hackers or strangers to contact you directly. In Sri Lanka, public numbers are often exploited. Think of it like leaving your phone number in a crowded market for everyone—dangerous. Better: choose a unique username or email. According to my suggestion, this helps prevent privacy breaches."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  putting your phone number as a username can expose you to strangers and scammers. In Sri Lanka, fake profiles often use such info to trick girls. Think like writing your number on a public notice board—it’s unsafe. Better: use a nickname or email. According to my suggestion, this improves your account privacy."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  using a phone number as username is unsafe even if you are degree-educated. Strangers in Sri Lanka can contact you or attempt hacking. Imagine giving your number openly at a seminar—it’s risky. Better: use a username unrelated to personal info. According to my suggestion, this protects your identity online."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, using your phone number as username exposes your account to strangers or scams. In Sri Lanka, fake accounts target public numbers. Think like putting your number on a public billboard—it’s unsafe. Better: use a private nickname or email. According to my suggestion, this keeps your social media safer."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with IT knowledge, using a phone number as username is unsafe. Hackers can target your account or phone directly. Think of it like leaving your personal number on a busy street—it’s risky. Better: use an email or nickname. According to my suggestion, this increases your account security."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even if you know tech, using your phone number as username allows strangers to reach you. In Sri Lanka, fake profiles exploit public numbers. Imagine putting your number on a public wall—it’s unsafe. Better: choose a username unrelated to your personal info. According to my suggestion, this ensures safer online activity."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  using your phone number as a username is risky even with IT awareness. Attackers in Sri Lanka can misuse it for scams or social engineering. Imagine leaving your number on a busy notice board—it’s unsafe. Better: use a safe nickname or email. According to my suggestion, this protects your privacy online."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  using a phone number as username may expose your info to strangers or scammers. In Sri Lanka, fake accounts often target public numbers. Imagine leaving your phone number openly on a street—it’s risky. Better: create a username unrelated to personal info. According to my suggestion, this keeps your social media safer."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even with HND-level IT knowledge, using your phone number as username is unsafe. Hackers or strangers can contact or scam you. Imagine leaving your phone in public—it can easily be stolen. Better: use a nickname or email. According to my suggestion, this secures your account."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, using your phone number as username exposes your profile to attackers. In Sri Lanka, fake accounts exploit public numbers to scam users. Think like giving your personal number to everyone on the street—it’s unsafe. Better: use a private nickname or email. According to my suggestion, this protects your social media identity."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even with degree-level IT knowledge, using your phone number as username is risky. Attackers in Sri Lanka can misuse it for phishing or scams. Imagine giving your number to random people at a seminar—it’s unsafe. Better: choose a username unrelated to personal info. According to my suggestion, this protects your online security."
  },
  {
    "questionId": "Q2",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, using your phone number as username exposes you to scams or unwanted contacts. In Sri Lanka, fake profiles often target such accounts. Imagine putting your number on a public billboard—it’s unsafe. Better: use a private nickname or email. According to my suggestion, this keeps your social media safer."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  changing the app theme to dark might make your phone look cool, but it does not protect your account from strangers. Imagine painting your school bag black thinking nobody can see it—people still notice it and can open it. The real way to reduce unwanted messages is to set your profile private. According to my suggestion, privacy settings are much more effective than just a dark theme."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  switching to dark theme might look stylish, but it won’t stop strangers from messaging you. In Sri Lanka, public profiles can be contacted easily regardless of the theme. Imagine painting your diary black but leaving it open on a table—anyone can still read it. Better: make your profile private. According to my suggestion, this gives real protection."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  changing the theme to dark does not prevent strangers from messaging you. In Sri Lanka, attackers target public profiles regardless of appearances. Think like painting a locker black but leaving the lock open—it’s unsafe. Better: set the profile to private so only friends can contact you. According to my suggestion, this improves safety significantly."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  a dark theme does not protect your account. Strangers in Sri Lanka can still send messages or interact with public profiles. Imagine coloring your notebook black but leaving it open in class—people can still see it. Better: make your profile private. According to my suggestion, privacy settings are more important than looks."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, switching to dark theme might reduce eye strain but does not reduce messages from strangers. In Sri Lanka, public profiles are vulnerable to unwanted contact. Imagine painting your car black but leaving the doors unlocked—it won’t stop thieves. Better: make your profile private and control who can contact you. According to my suggestion, privacy settings are key."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  changing theme to dark does not secure your account from strangers. Attackers in Sri Lanka can still message or view public profiles. Imagine putting a cover on a jar but leaving it on a public table—it can still be accessed. Better: set your profile private. According to my suggestion, this gives real security."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  even with degree-level knowledge, changing to a dark theme does not stop strangers from messaging or accessing your account. Imagine locking a window but leaving the door open—your house is still unsafe. Better: make your profile private to control who contacts you. According to my suggestion, privacy settings are far more effective than themes."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, using dark theme does not protect your account from strangers. In Sri Lanka, fake profiles can still message you or view posts. Imagine covering your notebook but leaving it on a public desk—people can still read it. Better: set your profile private. According to my suggestion, privacy settings matter more than themes."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with high IT skills, a dark theme won’t prevent strangers from messaging you. Think of it as painting your school bag black but leaving it open—people can still open it. Better: set profile to private. According to my suggestion, privacy controls are the key."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  a dark theme doesn’t stop strangers from contacting your account. Imagine painting your diary black but leaving it open in class—anyone can see it. Better: make your profile private. According to my suggestion, controlling who can see your posts is the real protection."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  switching to dark theme may reduce screen glare but it won’t prevent strangers from messaging. In Sri Lanka, public profiles are vulnerable. Think like painting a car black but leaving doors unlocked—unsafe. Better: set your profile to private. According to my suggestion, privacy settings are stronger than themes."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  dark theme doesn’t protect your social media. Strangers in Sri Lanka can still message or view posts. Imagine covering your notes but leaving the bag open—people can still access it. Better: set profile to private. According to my suggestion, privacy settings are more effective than themes."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even with HND-level IT knowledge, changing theme to dark doesn’t prevent strangers from contacting you. Think like painting the outside of a house black but leaving the doors unlocked—unsafe. Better: set profile private. According to my suggestion, privacy settings matter more than looks."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, changing to dark theme won’t stop strangers from messaging your account. In Sri Lanka, public profiles remain vulnerable. Imagine covering a diary but leaving it on a public table—people can still read it. Better: make your profile private. According to my suggestion, privacy settings give real protection."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even with degree-level IT knowledge, changing to dark theme won’t stop strangers from contacting you. Imagine locking the windows but leaving the front door open—your house is still unsafe. Better: set profile to private. According to my suggestion, privacy settings are more effective than themes."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, dark theme may look nice, but it won’t prevent strangers from messaging or seeing your posts. Imagine covering your notebook but leaving it on a public desk—unsafe. Better: make your profile private. According to my suggestion, privacy settings are the key to security."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  turning off the sound might make your phone quieter, but it won’t stop strangers from messaging you. Imagine your school bag being silent when someone opens it—it doesn’t stop them from taking your things. The real protection is to set your profile to private, so only friends can contact you. According to my suggestion, privacy settings are much more effective than sound settings."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  turning off notification sounds won’t prevent strangers from messaging you. Think of it like your diary making no noise, but anyone can still read it. Better: make your profile private, so only trusted friends can contact you. According to my suggestion, this keeps your social media interactions safe."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  turning off sounds might seem like it stops messages, but in Sri Lanka, anyone can still contact public profiles. Think like silencing a bell at school—the thief can still enter. Better: make your profile private. According to my suggestion, controlling who can contact you is the real protection."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  silencing notifications does not stop strangers from messaging you. Imagine your notebook making no noise, but anyone can still open it. Better: make your profile private. According to my suggestion, privacy settings are the key to security."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, turning off sounds reduces distractions but does not reduce unwanted messages. In Sri Lanka, public profiles remain vulnerable. Think of a house with silent alarms—the thief can still enter. Better: set your profile to private and control who can contact you. According to my suggestion, privacy settings are much more effective."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  turning off notification sounds doesn’t protect your account from strangers. Imagine covering a jar with a lid, but leaving it in a public area—anyone can open it. Better: make your profile private. According to my suggestion, privacy settings are the real protection."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  even with degree-level knowledge, turning off sounds won’t prevent strangers from contacting your account. Think like locking the window but leaving the door open—your house is still unsafe. Better: set your profile to private. According to my suggestion, privacy settings are far more effective than silencing notifications."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, silencing notifications does not stop strangers from messaging. In Sri Lanka, public profiles are still exposed. Imagine a diary making no noise but being left on a public desk—people can still read it. Better: make your profile private. According to my suggestion, privacy settings give real security."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with high IT skills, turning off sounds won’t prevent strangers from messaging. Think of it like silencing a bell in school—the thief can still take things. Better: set profile to private. According to my suggestion, privacy settings are the key for protection."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  turning off notification sounds may make your phone quiet but does not stop strangers from messaging you. Imagine silencing your notebook, but leaving it open in class—anyone can read it. Better: set profile to private. According to my suggestion, privacy settings provide real security."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  silencing notifications does not reduce risk from strangers. In Sri Lanka, public profiles are vulnerable. Think like muting an alarm but leaving the door unlocked—it’s unsafe. Better: make your profile private. According to my suggestion, privacy settings are stronger than sounds."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  turning off sounds does not prevent strangers from messaging your account. Imagine covering your notes but leaving them on a public desk—anyone can still read. Better: set profile to private. According to my suggestion, privacy settings are much more effective."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even with HND-level IT knowledge, turning off sounds does not prevent strangers from messaging. Think like muting your home alarm but leaving the doors open—unsafe. Better: make your profile private. According to my suggestion, privacy settings provide real security."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, silencing notifications does not protect your account. In Sri Lanka, public profiles remain exposed. Imagine covering your diary but leaving it on a public table—anyone can still read. Better: set profile to private. According to my suggestion, privacy settings are the key."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even with degree-level knowledge, turning off sounds won’t stop strangers from messaging. Imagine locking windows but leaving the front door open—your house is still unsafe. Better: set profile private. According to my suggestion, privacy settings are far more effective than silencing notifications."
  },
  {
    "questionId": "Q3",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, turning off sounds does not prevent strangers from messaging your account. Imagine covering your notebook but leaving it on a public desk—unsafe. Better: make your profile private. According to my suggestion, privacy settings are the real protection."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  enabling filters is about making your photos look nice, but it doesn’t protect your personal information. Imagine putting a colorful cover on your school bag—it looks good, but anyone can still open it and take your books. The real reason to check app permissions is to control what data apps can access, like your location or contacts. According to my suggestion, this keeps your social media safer."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  using filters might make your posts prettier, but it won’t protect your privacy. Think of it like decorating your notebook while leaving it open in class—everyone can still see your notes. Reviewing app permissions ensures apps don’t access unnecessary personal info. According to my suggestion, this keeps your account safer."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  enabling filters only affects appearance and doesn’t protect your private information. Imagine using a shiny locker but leaving it unlocked—anyone can access your stuff. Reviewing app permissions ensures apps don’t misuse your data. According to my suggestion, this is how you stay safe online."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  filters may make your pictures look nice, but they don’t secure your personal data. Imagine putting stickers on a diary but leaving it open for others—unsafe. Reviewing app permissions controls what apps can access. According to my suggestion, this is a better way to protect your social media."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, using filters makes content look good but does nothing for security. Imagine painting your door a bright color but leaving it unlocked—anyone can still enter. Checking app permissions ensures apps don’t access private information unnecessarily. According to my suggestion, this is how you control your online privacy."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  filters are for looks only and don’t protect your data. Imagine decorating your notebook while leaving it open for strangers—unsafe. Reviewing app permissions ensures apps cannot misuse your personal info. According to my suggestion, this is a key step to protect your privacy online."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  filters improve visual appeal but don’t secure personal data. Imagine putting stickers on a diary but leaving it on a public desk—anyone can read it. Reviewing app permissions limits what apps can access, like your contacts or location. According to my suggestion, this keeps your social media accounts safer."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, filters only enhance appearance and don’t protect your information. Think of decorating your notebook but leaving it in a common area—anyone can read it. Reviewing app permissions ensures apps don’t access your data unnecessarily. According to my suggestion, this is how to maintain privacy on social media."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with IT knowledge, enabling filters doesn’t protect your personal information. Imagine a locked cupboard painted bright colors—looks nice but security depends on the lock, not the paint. Checking app permissions ensures apps don’t access data like location or contacts. According to my suggestion, this is the practical way to protect privacy."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  filters may make photos attractive but do not protect your data. Imagine a diary cover with beautiful designs but left open in class—anyone can read it. Reviewing app permissions ensures apps cannot misuse personal info. According to my suggestion, this is the effective way to safeguard privacy online."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  filters are only for looks and do nothing for privacy. Think of painting a door but leaving it unlocked—unsafe. Reviewing app permissions prevents apps from accessing unnecessary personal information. According to my suggestion, this ensures better security on social media."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  using filters is visual only; it doesn’t secure personal data. Imagine decorating your notebook but leaving it on a public table—it’s unsafe. Reviewing app permissions limits apps’ access to sensitive information. According to my suggestion, this is the proper way to stay safe online."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, filters may enhance your content but don’t protect personal data. Imagine painting a locker but leaving it unlocked—anyone can open it. Checking app permissions ensures apps don’t misuse your information. According to my suggestion, this improves your social media security."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, filters only make posts prettier; they don’t secure personal data. Imagine covering a diary with stickers but leaving it open for anyone—unsafe. Reviewing app permissions protects your privacy. According to my suggestion, this is the best practice for safe social media use."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  filters enhance visual appeal but don’t prevent apps from accessing personal info. Think of painting a door but leaving it unlocked—looks nice but insecure. Reviewing app permissions ensures data like contacts, photos, and location are protected. According to my suggestion, this is how to maintain security online."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, filters are for looks and do not protect your personal information. Imagine decorating a notebook but leaving it open in public—unsafe. Reviewing app permissions ensures apps cannot misuse private info. According to my suggestion, this keeps your social media account secure."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  updating your password is important for account security, but it is not the main reason to review app permissions. Imagine locking your school bag—you’re safe, but if someone else is secretly taking notes from your bag, a lock alone won’t help. Reviewing permissions helps control what apps can access, like your contacts or location. According to my suggestion, managing app permissions is the real step for privacy."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  changing your password is useful, but it does not control what apps can see. Imagine locking your diary but leaving pages open for others—it’s not fully safe. Reviewing permissions ensures apps don’t access unnecessary information. According to my suggestion, this is how to keep your social media account protected."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  updating passwords is a good habit but it doesn’t manage what apps can access. Imagine changing the lock on your locker but leaving the windows open—someone can still peek inside. Reviewing permissions helps you control data access. According to my suggestion, privacy settings are more effective than only changing passwords."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  updating passwords is not enough to protect your privacy. Think of locking your diary but leaving it on a shared table—anyone can still see it. Reviewing app permissions prevents apps from misusing your personal info. According to my suggestion, permission checks are more important for social media safety."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, updating passwords helps your account security, but it won’t stop apps from accessing data like location or contacts. Imagine changing the padlock on a locker but leaving the window open—someone can still look inside. Reviewing app permissions ensures better control over your data. According to my suggestion, this is the real step to protect social media privacy."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  changing passwords is useful, but it does not prevent apps from collecting private data. Imagine locking a diary but leaving the pages exposed—it’s unsafe. Reviewing app permissions allows you to limit what apps can see. According to my suggestion, this is the better method for privacy protection."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  updating your password is good practice, but it doesn’t control app access. Think like changing a door lock but leaving the windows open—your house is still vulnerable. Reviewing app permissions gives you real control over who can access your data. According to my suggestion, this is a stronger measure for social media security."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, changing your password is helpful but doesn’t prevent apps from accessing personal information. Imagine locking your diary but leaving it on a public table—anyone can see it. Reviewing permissions ensures apps can’t misuse your data. According to my suggestion, this is the key step for privacy protection."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with high IT skills, updating a password alone doesn’t control what apps can access. Imagine a locker with a strong lock but open windows—security is incomplete. Reviewing app permissions prevents apps from accessing unnecessary personal data. According to my suggestion, this is the main way to protect privacy online."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  updating passwords is not enough to manage app data access. Imagine locking your diary but leaving it on a shared table—people can still read it. Reviewing permissions gives you control over what apps can see. According to my suggestion, this ensures your social media privacy."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  changing passwords only protects against account login theft, not apps misusing data. Think like changing a door lock but leaving windows open—vulnerable. Reviewing app permissions ensures your private info like contacts or location is protected. According to my suggestion, this is the real privacy step."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  updating your password is helpful but doesn’t manage what apps can see. Imagine locking a diary but leaving it on a public desk—anyone can still read. Reviewing permissions allows you to control app access. According to my suggestion, this is how to keep social media safe."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, changing your password helps prevent unauthorized logins but doesn’t prevent apps from accessing personal data. Imagine locking the door but leaving windows open—vulnerable. Reviewing app permissions ensures only necessary data is shared. According to my suggestion, this is the correct privacy measure."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, updating passwords alone does not manage app access to personal information. Think of locking your diary but leaving it open on a public table—unsafe. Reviewing permissions ensures better control over your data. According to my suggestion, this is the proper step for social media privacy."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  changing passwords is important but does not control what apps can access. Imagine changing a door lock but leaving windows open—your house remains insecure. Reviewing app permissions ensures private data like location and contacts are protected. According to my suggestion, this is the correct approach for privacy."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, updating your password is helpful but does not prevent apps from accessing personal data. Imagine locking your diary but leaving it in public—unsafe. Reviewing app permissions allows control over data access. According to my suggestion, this is the key step for social media safety."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  adding new friends doesn’t have anything to do with reviewing app permissions. Imagine inviting everyone in your class to your birthday party without checking if they are trustworthy—you might end up with trouble. Reviewing app permissions is about controlling what apps can access from your profile, like contacts, location, or photos. According to my suggestion, controlling data access is the real way to stay safe online."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  adding new friends is fun but does not protect your privacy. Think of it like giving your diary to everyone in the class—it’s not safe. Reviewing app permissions lets you decide which apps can see your personal info. According to my suggestion, checking permissions is the proper way to keep your social media secure."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  adding friends is about connecting with people, not about controlling app access. Imagine sharing your locker combination with everyone in the school—it’s risky. Reviewing app permissions ensures that apps don’t misuse your data like contacts or location. According to my suggestion, managing app permissions is the safer approach."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  adding friends doesn’t help you manage privacy. Imagine sharing your diary with everyone in the neighborhood—it’s unsafe. Reviewing app permissions controls what apps can access from your account. According to my suggestion, checking permissions is the real way to stay secure."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, adding new friends is about social connection, not security. Think like giving out your house keys to anyone—it’s dangerous. Reviewing app permissions helps you control which apps can access sensitive data like contacts or location. According to my suggestion, this is the step that really protects privacy."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  adding friends does not control app access to your information. Imagine lending your notebook to everyone in class—it’s unsafe. Reviewing app permissions lets you manage what apps can see. According to my suggestion, this is the correct approach to maintain social media privacy."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  adding friends doesn’t help with privacy or app permissions. Imagine giving your diary to random people—it’s risky. Reviewing app permissions ensures apps can’t misuse your data like photos, location, or contacts. According to my suggestion, managing permissions is what really keeps your account safe."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, adding new friends is unrelated to protecting your account. Think of it like letting everyone read your diary—it’s unsafe. Reviewing app permissions allows you to control what apps can see. According to my suggestion, this is the practical way to secure your social media."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with good IT knowledge, adding friends doesn’t protect your privacy. Imagine giving access to your house to strangers—it’s risky. Reviewing app permissions ensures apps don’t access unnecessary personal data. According to my suggestion, controlling app access is the key for online safety."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  adding friends is social, not protective. Think of it like letting strangers into your house—it’s unsafe. Reviewing app permissions helps you manage what apps can see from your profile. According to my suggestion, this is the real step to stay safe online."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  adding friends does not control data access. Imagine giving strangers keys to your house—it’s dangerous. Reviewing app permissions ensures apps cannot misuse private info like contacts or location. According to my suggestion, this is the correct way to protect privacy."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  adding friends does not secure your account. Imagine letting everyone read your diary—it’s unsafe. Reviewing app permissions lets you control what apps can access. According to my suggestion, this is the key to maintaining social media privacy."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, adding new friends is about social networking, not security. Think like giving house keys to strangers—it’s risky. Reviewing app permissions lets you control app access to sensitive information. According to my suggestion, this is how to protect your data effectively."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, adding friends is not related to privacy. Imagine letting everyone peek into your diary—it’s unsafe. Reviewing app permissions allows you to control which apps can access your data. According to my suggestion, this is the real way to maintain social media safety."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  adding new friends does not affect what apps can access from your profile. Imagine giving diary access to everyone—it’s unsafe. Reviewing app permissions ensures your data like contacts, photos, and location are protected. According to my suggestion, this is the correct approach for privacy."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, adding friends does not secure your social media account. Imagine letting strangers read your private diary—it’s unsafe. Reviewing app permissions allows you to control access to your personal info. According to my suggestion, this is the best way to maintain privacy online."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  clicking a suspicious link from a stranger is very risky. Imagine someone sending a sweet box but hiding a snake inside—if you open it, you’ll get hurt. Hackers can steal your account or personal info through that link. According to my suggestion, always ignore or report such messages instead of clicking, to stay safe online."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  clicking a link from a stranger can harm your account. Imagine receiving a gift but someone hides a harmful insect inside—opening it can be dangerous. Hackers can steal your info. According to my suggestion, it’s safer to ignore or report such messages."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  opening suspicious links from unknown people is risky. Think of it like eating candy from a stranger—it might be poisoned. Hackers can use links to steal passwords or install malware. According to my suggestion, ignore or report these messages to stay secure."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  clicking unknown links is unsafe. Imagine receiving a package with a hidden insect—you can get hurt. Similarly, hackers can steal your information. According to my suggestion, ignore or report such messages to protect yourself online."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, clicking a suspicious link is like opening a box from a stranger—you might get trapped by malware or hackers. This can compromise your accounts or personal information. According to my suggestion, ignoring or reporting such links is the safe choice."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  opening unknown links is dangerous. Imagine receiving a sweet with a hidden insect—you can get hurt. Hackers can steal your personal info. According to my suggestion, the safest approach is to ignore or report the message."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  clicking links from strangers can compromise your account. Imagine opening a locked box that someone secretly wired with electricity—you get hurt. Hackers can steal your credentials through such links. According to my suggestion, always ignore or report suspicious messages."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, clicking a stranger’s link is risky. Think of a gift with a hidden snake—you can get hurt. Hackers can steal your data. According to my suggestion, it’s best to ignore or report these links to stay safe online."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with good IT knowledge, clicking a suspicious link is dangerous. Imagine opening a package from a stranger that contains malware—it can compromise your personal data or accounts. According to my suggestion, always ignore or report such links."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  clicking unknown links is unsafe. Imagine a gift hiding poison inside—it can harm you. Hackers can steal data through such links. According to my suggestion, ignore or report suspicious messages to protect yourself."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  opening links from strangers is risky even if you understand IT. Imagine opening a candy from a stranger that is poisoned—you could get hurt. Hackers use links to steal info or infect devices. According to my suggestion, ignore or report these messages."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  clicking unknown links can compromise your device and accounts. Think of a gift hiding a dangerous insect—you can get hurt. Hackers can steal your personal info. According to my suggestion, ignoring or reporting such links is the safest choice."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even with advanced knowledge, clicking suspicious links from strangers is unsafe. Malware or hackers can steal your data. Imagine opening a sealed box that contains harmful chemicals—it’s dangerous. According to my suggestion, ignoring or reporting the message is the correct action."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, clicking links from strangers is very risky. Imagine receiving a gift with a hidden scorpion—you can get harmed. Hackers can steal your accounts. According to my suggestion, always ignore or report such messages."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  opening suspicious links can compromise your personal information or accounts. Think of opening a sealed box with hidden danger—it’s risky. According to my suggestion, ignore or report messages from strangers to protect yourself online."
  },
  {
    "questionId": "Q5",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, clicking links from strangers is unsafe. Imagine a gift hiding a harmful insect—you might get harmed. Hackers can steal your data through such links. According to my suggestion, ignore or report these messages to remain safe online."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  asking a stranger for more info is not safe. Imagine a stranger coming to your home and you start asking questions—they might trick you. Similarly, hackers can use your response to gain information or trick you further. According to my suggestion, the safest step is to ignore or report suspicious messages to protect your account."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  asking strangers about a link is risky. Imagine talking to a stranger who gives you fake instructions—they might cheat you. Hackers can use your curiosity to steal data. According to my suggestion, ignoring or reporting the message is the safe choice."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  even asking a stranger for more info is unsafe. Think of it like responding to a stranger who calls you and asks personal things—they might trick you. Hackers can use this info to hack your account. According to my suggestion, ignoring or reporting suspicious messages is safer."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  asking for more info from strangers can be dangerous. Imagine replying to a stranger and giving them hints about your personal life—they could misuse it. Hackers do the same online. According to my suggestion, ignore or report the message instead."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, asking a stranger for information about a suspicious link can make you vulnerable. Imagine a stranger tricking you by pretending to be a friend—they might steal your secrets. According to my suggestion, ignoring or reporting is the correct way to stay safe."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  asking a stranger for details can put you at risk. Think of it like talking to a stranger who pretends to help but actually cheats you. Hackers behave similarly online. According to my suggestion, ignore or report suspicious messages."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  even if you are curious, asking a stranger about a suspicious link is unsafe. Imagine talking to someone pretending to help but intending to steal your secrets. Hackers can use your response to access accounts. According to my suggestion, ignore or report the message instead."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, asking strangers for more info about links is risky. Think like replying to a stranger and accidentally giving clues about yourself—they might misuse it. Hackers act similarly online. According to my suggestion, always ignore or report such messages."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with advanced IT skills, asking a stranger for details about a suspicious link is unsafe. Hackers can use your curiosity to collect data or compromise your account. According to my suggestion, ignoring or reporting suspicious messages is the safe approach."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  asking for more info from a stranger can put your privacy at risk. Hackers often trick users by pretending to be helpful. According to my suggestion, ignore or report such messages to protect yourself."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  asking a stranger about a suspicious link can be dangerous. Hackers can use this interaction to gain personal info or spread malware. According to my suggestion, the safe choice is to ignore or report such messages."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  responding to a stranger’s link request can make your account vulnerable. Hackers use these tricks to steal personal data. According to my suggestion, ignoring or reporting suspicious links is the safe practice."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, asking a stranger for more info is risky. Hackers can use your response to gain access to your accounts or personal info. According to my suggestion, ignore or report the message instead of replying."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, responding to unknown links or messages can put your privacy at risk. Hackers can exploit your curiosity. According to my suggestion, ignoring or reporting suspicious messages is the safest step."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  even with strong IT knowledge, asking a stranger about a suspicious link is unsafe. Hackers can use your reply to steal data or install malware. According to my suggestion, the safe approach is always to ignore or report."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, replying to a stranger to ask about a suspicious link can compromise your privacy. Hackers may use your response to steal information. According to my suggestion, ignoring or reporting such messages is the correct safety measure."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  replying with a smiley to a stranger’s suspicious message is not safe. Imagine someone sending a fake letter, and you respond with a smile—it encourages them to trick you further. Hackers can use your reply to confirm your account is active and try to steal your data. According to my suggestion, ignoring or reporting the message is much safer."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  replying with a smiley to a stranger’s message may seem friendly but it’s risky. Imagine giving a stranger a sign that you are listening—they might use it to cheat you. Hackers can confirm your account is active and attempt to hack it. According to my suggestion, it’s safer to ignore or report the message."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  sending a smiley to an unknown person is unsafe. Think of it like waving at a stranger who might be a trickster—they can use that signal against you. Hackers often check who responds to see which accounts are active. According to my suggestion, ignoring or reporting the message protects you better."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  replying to a stranger with a smiley is risky. Imagine showing a stranger you trust them—they could use it to fool you. Hackers can confirm your account is active and target it. According to my suggestion, ignoring or reporting suspicious messages is safer."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, even a small reply like a smiley can signal to hackers that your account is active. Imagine someone waving to a stranger who might have bad intentions—they can plan to trick you. According to my suggestion, ignoring or reporting suspicious messages keeps you safe."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  responding with a smiley to a stranger’s message can alert them that you are active and curious. Imagine giving a stranger a signal—they might use it to trick you. According to my suggestion, it’s safer to ignore or report the message."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  replying with a smiley might seem harmless but it shows hackers your account is active. Think of it like nodding at a stranger who wants to deceive you—they can target you more easily. According to my suggestion, ignoring or reporting the message is safer."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, sending a smiley to a stranger is risky. Imagine signaling a stranger that you are approachable—they may exploit it. Hackers can detect active accounts this way. According to my suggestion, ignoring or reporting is the correct approach."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with IT knowledge, replying with a smiley can alert hackers that your account is active and susceptible. Imagine responding to a stranger who may have bad intentions—they can use it against you. According to my suggestion, ignoring or reporting suspicious messages is safer."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  replying with a smiley to strangers is unsafe. Hackers can see your account is active and may attempt to trick you. Imagine giving a stranger a signal—you could be at risk. According to my suggestion, ignoring or reporting such messages is best."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  even advanced users should avoid replying to suspicious messages. Hackers check who responds to see which accounts are active. Imagine signaling a stranger—it can be risky. According to my suggestion, ignoring or reporting is the safe choice."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  replying to a stranger with a smiley may indicate curiosity and an active account, which hackers exploit. Imagine giving a signal to a stranger—it’s risky. According to my suggestion, ignoring or reporting suspicious messages is safer."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, replying with a smiley shows hackers that you are active and engaged. Think of it like signaling a stranger—it can lead to trouble. According to my suggestion, ignoring or reporting such messages protects your privacy."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, even a small reply to a suspicious message can signal hackers. Imagine giving a stranger a hint you are present—they may exploit it. According to my suggestion, ignoring or reporting suspicious messages is the correct action."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  replying with a smiley to unknown messages can indicate to hackers that your account is active. Think like signaling a stranger who may have harmful intentions—they can use it against you. According to my suggestion, always ignore or report suspicious messages."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, replying with a smiley to strangers can alert hackers that your account is active, which is risky. Imagine signaling a stranger—you could be targeted. According to my suggestion, ignoring or reporting suspicious messages is the safest approach."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  asking a friend to check your profile seems helpful, but it’s not reliable. Imagine giving someone a secret diary and asking them to tell you what others see—they might miss things or give wrong info. Your privacy could be compromised if your friend accidentally shares your details. According to my suggestion, using the built-in 'View As' tool is safer and shows exactly what the public sees."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  asking a friend to check your profile is not always safe. Imagine giving your diary to a friend to see what others see—they might miss something or tell others. Hackers or privacy leaks can happen this way. According to my suggestion, use the 'View As' privacy tool for an accurate view."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  asking a friend to show how your profile appears is not accurate. Imagine asking someone to describe your home’s front door to others—they may forget details or exaggerate. Privacy risks increase if friends unintentionally share info. According to my suggestion, the 'View As' tool is precise and safe."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  friends might try to help, but asking them to check your profile is risky. They could miss details or accidentally leak info. Imagine giving someone your notebook to review—some notes may be seen by others. According to my suggestion, using the privacy tools like 'View As' is more reliable and secure."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, even though friends mean well, asking them to check your profile for public view is not fully safe. Think of it as asking someone to check a locked box—they might open it wrongly or reveal something. According to my suggestion, the 'View As' tool ensures exact visibility without risking your privacy."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  friends may not notice everything and could accidentally share your private info. Imagine asking someone to review your diary—they might reveal something you didn’t want. According to my suggestion, using 'View As' ensures an accurate and safe way to check your profile."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  relying on a friend to see your public profile isn’t fully accurate. Imagine asking someone to describe a secret room—they might forget or mislead. Hackers could exploit shared info. According to my suggestion, the 'View As' tool provides exact visibility and keeps your account secure."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, asking friends to check your profile is not always safe. Imagine giving them a diary—they might reveal details you didn’t want. Hackers can misuse shared info. According to my suggestion, use 'View As' to see exactly what the public can view safely."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with good IT knowledge, friends may overlook details when checking your profile. Imagine asking someone to inspect your home—they might miss hidden areas. Using 'View As' shows exactly what is visible publicly. According to my suggestion, this tool is more precise and safe."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  friends might miss some details, making it unreliable. Imagine someone reviewing your house—they might not see all corners. Using 'View As' accurately shows your profile from the public’s perspective. According to my suggestion, this method is safer."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  even advanced users should not rely on friends to view their profile publicly. Imagine a guide giving incomplete directions—they could miss critical areas. Using the 'View As' tool provides a precise view and avoids privacy risks. According to my suggestion, this is the correct method."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  friends may unintentionally give wrong info about your profile visibility. Imagine someone describing a complex building—they might omit key parts. Using 'View As' ensures you see exactly what public users can view. According to my suggestion, this is safe and accurate."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, friends checking your profile might overlook privacy issues or accidentally leak info. Imagine asking a colleague to review sensitive documents—they may miss some parts. Using 'View As' provides precise control over what others see. According to my suggestion, this is the safer approach."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, even with experience, friends may not accurately show what public users can see. Imagine someone reviewing your private notes—they might miss confidential info. Using 'View As' ensures accuracy. According to my suggestion, this is the correct approach."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  relying on a friend for public profile visibility can be risky. Imagine asking a friend to describe your private files—they could miss details or make mistakes. 'View As' is precise and shows exactly what others see. According to my suggestion, always use it."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, friends might unintentionally give incorrect info about your profile. Imagine asking someone to check confidential documents—they may miss critical details. Using 'View As' ensures you know exactly what the public sees. According to my suggestion, this is safer and accurate."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  opening your profile in incognito mode might seem like it shows what the public sees, but it’s not accurate. Think of it like wearing sunglasses to look at your own house—you may miss some rooms or objects. Social media platforms can still show different info depending on settings. According to my suggestion, the 'View As' tool gives an exact view of what others can see."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  using incognito mode may seem helpful, but it doesn’t truly show what the public sees. Imagine peeking at your house through a dark window—you might not notice everything. Social media privacy settings can change what others see. According to my suggestion, 'View As' is safer and accurate."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  opening your profile in incognito may miss details because social media shows different info depending on privacy rules. Imagine checking your school notice board while wearing tinted glasses—you may miss some announcements. According to my suggestion, 'View As' shows exactly what the public can see."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  incognito mode doesn’t guarantee an accurate public view. Think of it like checking your diary through a foggy window—you might not see everything. According to my suggestion, using 'View As' gives a clear and safe view of your profile."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, even if you use incognito, social media platforms can still show info differently. Imagine inspecting your office files with a dark filter—you may miss some details. According to my suggestion, 'View As' gives an exact representation of what the public sees."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  incognito mode might hide some info, but it doesn’t fully replicate what others see. Imagine looking at your study notes with tinted glasses—you may misinterpret them. According to my suggestion, using 'View As' is precise and safe."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  opening your profile in incognito may give a partial view, but social media shows different info based on privacy settings. Imagine checking your home through a colored lens—you might miss rooms. According to my suggestion, 'View As' ensures you see exactly what the public sees."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, using incognito mode does not provide a fully accurate view. Imagine checking your diary in dim light—you could miss important notes. According to my suggestion, the 'View As' tool is precise and safer."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with IT skills, incognito mode cannot replicate exactly what the public sees. Social media may show content differently. Imagine testing your office layout through a tinted window—you may overlook areas. According to my suggestion, 'View As' gives a complete and accurate view."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  using incognito doesn’t guarantee the correct public view. Think of it like inspecting a room through a foggy window—you might missee items. According to my suggestion, 'View As' provides a safe and exact view of your profile."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  even advanced users cannot rely on incognito mode because privacy settings alter what is visible. Imagine checking a confidential folder through colored glasses—you may misinterpret. According to my suggestion, 'View As' shows exactly what the public sees."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  incognito does not give an accurate public view. Imagine reviewing your notes with a tinted lens—you might miss important info. According to my suggestion, using 'View As' ensures a precise view."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even experienced users may get incomplete info via incognito mode. Think of inspecting a sensitive report through dark glasses—you may misread details. According to my suggestion, 'View As' gives the exact public view."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, using incognito mode may hide certain profile elements, giving a misleading view. Imagine checking private files through a tinted lens—you may miss confidential details. According to my suggestion, 'View As' is the accurate and safe method."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  incognito mode cannot fully replicate the public perspective of your profile. Think of looking at your home with colored glasses—you may miss important areas. According to my suggestion, 'View As' ensures a precise and safe view."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, using incognito does not give an accurate public view. Imagine reviewing a confidential document through a tinted lens—you might overlook key info. According to my suggestion, 'View As' provides the exact and safe view of your profile."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  changing your username does not show how your profile appears to others. Imagine changing your school nickname—it doesn’t change how teachers see your behavior or work. Hackers or strangers can still see the same posts or info depending on privacy settings. According to my suggestion, using the 'View As' tool is the correct way to check your profile visibility."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  changing your username won’t show you the public view of your profile. Imagine changing your nickname at school—it doesn’t change how others see your homework or posts. According to my suggestion, 'View As' is the right tool to accurately check what others can see."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  even if you change your username, it doesn’t affect what people see on your profile. Imagine giving yourself a new alias in school—it doesn’t hide your previous achievements or behavior. According to my suggestion, 'View As' provides a precise view of public visibility."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  changing your username does not accurately show how others see your profile. Imagine using a different nickname in class—it doesn’t change how your classmates notice your work. According to my suggestion, using 'View As' ensures you see your profile exactly as the public does."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, changing your username won’t give a real view of what others can see. Think of it like changing your name tag at the office—it doesn’t hide what others see on your desk. According to my suggestion, 'View As' is accurate and reliable."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  even if you update your username, it does not change the public view. Imagine changing your nickname for fun—it doesn’t hide the projects you’ve done. According to my suggestion, the 'View As' tool is precise and safe."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  changing the username won’t affect your profile’s public appearance. Think of it like updating your email ID—it doesn’t hide previous emails or posts. According to my suggestion, 'View As' shows exactly what others can see."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, even if you change your username, people will still see the same posts depending on your privacy settings. Imagine changing your Instagram handle—it doesn’t hide your old stories. According to my suggestion, 'View As' is the right way to check public view."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  advanced users should also know that changing the username doesn’t alter public visibility. Imagine updating your company email—it doesn’t change how your profile or posts appear externally. According to my suggestion, 'View As' provides precise control."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  changing the username alone doesn’t affect what public users see. Think of it like changing your pen color in class—it doesn’t hide your previous notes. According to my suggestion, using 'View As' ensures accuracy and safety."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  changing your username won’t reveal how your profile looks to others. Imagine updating your nickname—it doesn’t hide your old posts or details. According to my suggestion, 'View As' gives an exact public view."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  updating your username alone doesn’t help you see the public perspective. Imagine changing your nickname—it doesn’t change how your classmates view your work. According to my suggestion, 'View As' is the accurate way to check your profile."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, changing your username does not affect what others can see. Think of it like changing your display name on LinkedIn—it doesn’t hide old posts or info. According to my suggestion, 'View As' provides exact visibility."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, even with experience, changing your username won’t show the public view accurately. Imagine changing your handle on Instagram—it doesn’t hide past posts. 'View As' is precise and safe. According to my suggestion, always use it."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  changing your username won’t give you an accurate picture of your public profile. Imagine changing your office ID—it doesn’t hide your previous work. 'View As' shows exactly what the public can see, which is safer. According to my suggestion, always rely on it."
  },
  {
    "questionId": "Q6",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, updating your username alone does not affect the public’s view of your profile. Imagine changing your social media handle—it doesn’t hide old content. 'View As' is accurate and ensures your privacy. According to my suggestion, this is the best approach."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking that avoiding real-time vacation posts is only about likes is wrong. Imagine telling your whole class about your holiday while your house is empty—people knowing this can be risky. Hackers or burglars can target empty homes. According to my suggestion, protecting your safety is far more important than likes."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  avoiding posting vacation updates is not just about getting fewer likes. Imagine showing your house empty to strangers by posting live updates—it increases risk. According to my suggestion, safety is more important than social attention, so think before posting."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  thinking this is about reducing likes is misleading. Imagine leaving your house unprotected while sharing every move online. Burglars can see this. According to my suggestion, avoid posting personal locations in real-time to protect yourself."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  it’s not about likes. Posting your vacation live is like showing your empty home to strangers—this can be dangerous. According to my suggestion, privacy and safety should come first, not online attention."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, reducing likes is not the real reason to avoid live updates. Imagine leaving your house empty while everyone knows you’re away. Burglars or scammers could exploit this. According to my suggestion, protect personal safety first by avoiding real-time posts."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  posting live updates just to get likes is risky. Imagine strangers seeing your empty home while you’re on holiday. According to my suggestion, your safety is more important than online attention."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  thinking it’s about likes is incorrect. Posting vacation updates in real-time can reveal that your house is empty, inviting theft. According to my suggestion, avoid sharing live locations and prioritize privacy."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, avoiding real-time vacation posts is not about reducing likes. Sharing live updates can expose your home while you’re away. According to my suggestion, protect your safety first, likes come later."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with higher IT knowledge, the concern is not likes. Real-time posts reveal your empty house, increasing burglary risk. According to my suggestion, focus on privacy and security over online attention."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  likes are not the main issue. Real-time posts can reveal your absence to burglars. According to my suggestion, safeguard your privacy before worrying about social approval."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  posting live updates for likes is risky. Strangers can track your location and exploit your absence. According to my suggestion, avoid posting your location in real-time to ensure safety."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  reducing likes is not the reason to avoid real-time updates. Live posts can make you vulnerable to theft or stalking. According to my suggestion, prioritize privacy and safety over social attention."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, even advanced users should know that likes are irrelevant. Posting live can expose personal security risks, like burglars knowing your home is empty. According to my suggestion, delay posting and use privacy settings."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, live updates for likes can be dangerous. People can exploit your absence. According to my suggestion, protect your privacy and post after returning home if needed."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  reducing likes is not why you avoid real-time updates. Live sharing can reveal that you’re away from home and attract burglars. According to my suggestion, focus on security first and social attention later."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, likes are irrelevant here. Posting live vacation details can make your home vulnerable. According to my suggestion, prioritize safety over social media recognition."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking that avoiding real-time vacation posts is about making friends jealous is not correct. Imagine your schoolmates being upset about your holiday pictures—it doesn’t affect your safety. The real risk comes from strangers knowing your house is empty. According to my suggestion, focus on protecting yourself, not worrying about jealousy."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  it’s not about making friends jealous. Sharing live vacation updates can put your home at risk. Imagine posting while your house is empty—burglars might notice. According to my suggestion, safety is more important than anyone feeling jealous."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  avoiding jealousy is not the main reason. Posting live vacation info can expose that your home is empty, inviting theft. According to my suggestion, always prioritize personal safety over social emotions."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  friends being jealous is a minor concern. Posting real-time updates risks your security by showing that your house is empty. According to my suggestion, focus on protecting yourself first."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, jealousy is not the reason to avoid live updates. Imagine leaving your house empty while showing your trip—strangers can take advantage. According to my suggestion, privacy and security matter more than social envy."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  friends feeling jealous is not a strong reason to avoid live posts. The real issue is safety. Imagine posting while your home is empty—burglars can see it. According to my suggestion, focus on privacy first."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  jealousy is irrelevant here. Posting live vacation updates exposes your house being empty. According to my suggestion, focus on security rather than others’ emotions."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, friends being jealous is not the main concern. Live posts can put your home at risk. According to my suggestion, safety and privacy should be prioritized over social reactions."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with IT skills, jealousy is not a real reason. Real-time vacation posts can expose that your home is empty. According to my suggestion, security should come first."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  friends’ jealousy is minor. Posting live can make your home vulnerable. According to my suggestion, focus on protecting your personal safety."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  avoiding jealousy is irrelevant. Real-time updates show that your house is empty, creating risks. According to my suggestion, always protect privacy and safety first."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  friends’ jealousy is not the main concern. Sharing live updates exposes your absence. According to my suggestion, prioritize safety over social emotions."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, avoiding jealousy is not important. Real-time posts can reveal your empty house. According to my suggestion, privacy is more critical than social considerations."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, jealousy is a minor issue. Sharing live vacation details can expose your home. According to my suggestion, ensure safety and privacy first."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  friends feeling jealous is not the reason to avoid posting. Real-time updates can make your house vulnerable. According to my suggestion, always protect privacy first."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, avoiding jealousy is not the main concern. Real-time updates reveal that your home is empty. According to my suggestion, focus on privacy and safety over social emotions."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking that avoiding real-time vacation posts is about making your stories short is wrong. Imagine telling your whole class about your holiday step by step—it may be long, but the real risk is strangers knowing your house is empty. According to my suggestion, protect your safety first instead of worrying about story length."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  story length is not the main concern. Posting live vacation updates can put your home at risk. Imagine showing every single moment to strangers while your house is empty. According to my suggestion, prioritize safety and privacy first."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  avoiding long stories is irrelevant. The real danger comes from sharing your location live, making your home vulnerable. According to my suggestion, focus on protecting your privacy, not story length."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  the length of stories does not determine safety. Posting live updates can show your house is empty to potential burglars. According to my suggestion, focus on privacy and security over how long your stories are."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, story length is a minor issue. Posting real-time updates exposes your location and home status. According to my suggestion, use privacy settings and delay posts for safety."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  long stories don’t make a difference to security. Posting real-time updates can reveal your home is empty. According to my suggestion, prioritize your privacy first."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  story length is irrelevant. Sharing vacation details live can expose your empty home. According to my suggestion, focus on safety and delay posting until you return."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, avoiding long stories is not the reason. Posting live can put your house at risk. According to my suggestion, protect your privacy first and worry about story length later."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even advanced users should know that story length is irrelevant. Real-time posts can show that your home is empty, increasing burglary risk. According to my suggestion, prioritize privacy and safety."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  long stories are not the concern. Real-time posts can expose your home to strangers. According to my suggestion, protect yourself first before thinking about story length."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  story length does not matter. Posting updates in real-time can reveal that your house is empty, making you vulnerable. According to my suggestion, focus on privacy and security first."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  the length of stories is minor. Sharing vacation details live can put your home at risk. According to my suggestion, ensure your privacy and safety first."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, story length is not important. Real-time updates can expose your location and empty house. According to my suggestion, delay posting and protect your privacy."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, long stories don’t affect security. Posting live updates can reveal your home is empty. According to my suggestion, protect your personal safety first."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  the length of your stories doesn’t matter. Real-time vacation posts can make your home vulnerable. According to my suggestion, focus on safety and privacy over social media presentation."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, story length is irrelevant. Sharing live updates exposes your home and personal safety. According to my suggestion, prioritize privacy first, then think about content length."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  changing your profile picture often is not the main risk for identity theft. Imagine swapping photos in your school profile—it might confuse friends but doesn’t expose personal data like your address or ID. According to my suggestion, focus on protecting sensitive details rather than just updating pictures frequently."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  frequently changing your profile picture doesn’t increase identity theft risk much. Think of it like switching your notebook cover—it doesn’t reveal personal information. According to my suggestion, secure your personal info, like address or ID, more than worrying about picture changes."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  changing profile pictures often is minor. The real risk is sharing sensitive info, like ID documents or full address. According to my suggestion, focus on securing personal data rather than worrying about frequent photo updates."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  updating pictures frequently is not dangerous by itself. The bigger risk is sharing personal information that could be misused. According to my suggestion, protect sensitive details first, picture updates second."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, frequently changing profile photos may look distracting but doesn’t cause identity theft. The real threat is exposing personal details. According to my suggestion, secure personal info and documents, that’s priority."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  changing profile pictures often is harmless compared to sharing sensitive data. Think of it as redecorating your room—it’s cosmetic. According to my suggestion, prioritize keeping personal info safe."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  frequent picture updates don’t directly increase identity theft risk. The real concern is exposing critical information online. According to my suggestion, secure sensitive info first."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, changing pictures often won’t make you vulnerable. The bigger danger is personal data exposure. According to my suggestion, focus on privacy of sensitive info rather than cosmetic changes."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with higher IT skills, frequent photo changes are not a risk for identity theft. Real threat comes from exposing personal details or documents. According to my suggestion, keep sensitive info safe first."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  changing pictures often is harmless. Real risk is sharing critical info online that can be misused. According to my suggestion, safeguard personal data, not cosmetic updates."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  identity theft is not caused by changing photos. The bigger risk is exposing addresses, IDs, or personal info. According to my suggestion, protect sensitive info first."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  frequently updating pictures doesn’t matter much. The key risk is sensitive information exposure. According to my suggestion, focus on privacy of critical data rather than cosmetic changes."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, changing profile pictures often won’t cause identity theft. The main risk is sharing sensitive info. According to my suggestion, safeguard personal information first."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, picture changes are not dangerous. The real threat is personal information being exposed. According to my suggestion, prioritize securing sensitive info."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  frequent profile picture changes don’t cause identity theft. Exposure of sensitive data is the main danger. According to my suggestion, always protect personal information first."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, changing pictures often is harmless. The real threat is revealing personal details online. According to my suggestion, focus on keeping sensitive data secure."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  logging out frequently from social media is not risky—it’s actually a good habit for security. Imagine leaving your school locker open; logging out is like locking it. According to my suggestion, continue logging out to protect your account."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  logging out often is safe, not dangerous. Think of it as locking your school bag after classes. According to my suggestion, keep logging out to secure your account."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  logging out frequently doesn’t increase identity theft risk; it reduces it. Like closing your classroom door when you leave, it keeps your account secure. According to my suggestion, continue this habit."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  logging out frequently is actually smart. It’s like locking your home when you leave—it prevents misuse. According to my suggestion, keep practicing this habit."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, logging out frequently is good practice. Imagine leaving your office drawer unlocked—logging out prevents unauthorized access. According to my suggestion, maintain this habit to secure your social media accounts."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  logging out is safe and smart. Think of it like closing your diary after writing; it prevents others from reading. According to my suggestion, continue logging out frequently."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  logging out often reduces risk, it’s not a problem. Imagine leaving your laptop logged in at a cyber café—logging out prevents misuse. According to my suggestion, keep doing it."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, logging out is safe. Like locking your home door, it protects your account. According to my suggestion, continue this good habit."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with higher IT knowledge, logging out frequently is smart, not risky. It prevents unauthorized access. According to my suggestion, maintain this habit consistently."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  logging out is a good practice. Think of it as locking your digital diary. According to my suggestion, continue logging out for safety."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  logging out frequently is safe and recommended. Like closing office drawers before leaving, it prevents misuse. According to my suggestion, keep up this habit."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  logging out is smart. It’s like locking your cupboard at home; it stops others from using your things. According to my suggestion, continue this habit."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, logging out frequently is good security practice. Imagine leaving your lab unlocked; logging out keeps your account safe. According to my suggestion, maintain this habit."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, logging out often is safe. Like locking your personal diary, it prevents unauthorized access. According to my suggestion, continue logging out."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  logging out frequently is not a risk; it enhances security. Think of it as securing your office before leaving. According to my suggestion, keep practicing this habit."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, logging out is a safe habit, like locking your house. It doesn’t increase risk. According to my suggestion, maintain this practice for online safety."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  making stories is not directly risky for identity theft. Imagine sharing your school day in stories—it’s fun but doesn’t give out personal info like your address or ID. According to my suggestion, focus on protecting sensitive personal information, because that’s what really matters."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  creating stories on social media is harmless in terms of identity theft. Think of it like showing your day to friends; it doesn’t reveal critical personal info. According to my suggestion, the focus should be on keeping sensitive details safe."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  making stories is not the main threat. The danger comes from sharing sensitive personal information. According to my suggestion, continue making stories safely but avoid posting private details that could be misused."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  making social media stories is mostly harmless. It’s like keeping a diary for friends to see, but the risk is in sharing personal info. According to my suggestion, protect your privacy while enjoying stories."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, creating stories isn’t dangerous for identity theft. The real risk is exposing sensitive details. According to my suggestion, you can make stories, but don’t include personal info like addresses or ID numbers."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  posting stories is safe, but you must avoid sensitive info. Think of it like sharing your day with friends at tuition—it’s okay as long as you don’t give private info. According to my suggestion, focus on privacy first."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  making stories doesn’t increase identity theft risk directly. Real threat comes from sharing critical personal info. According to my suggestion, enjoy stories safely but avoid posting sensitive details."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, making stories is generally safe. The danger is if you include personal info like your ID or address. According to my suggestion, protect sensitive information while enjoying stories."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with higher IT knowledge, making stories isn’t risky for identity theft. The real concern is sharing private info. According to my suggestion, you can make stories, but keep personal details safe."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  making stories is fine, but avoid including sensitive data. Think of it like posting updates at school—fun but safe. According to my suggestion, privacy first, stories second."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  identity theft doesn’t come from making stories; it comes from sharing private info. According to my suggestion, you can post stories safely while keeping sensitive data private."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  making stories is harmless unless you include sensitive personal information. According to my suggestion, protect your private info and enjoy sharing stories safely."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, posting stories doesn’t increase identity theft risk directly. The real risk is sensitive info exposure. According to my suggestion, focus on privacy and continue making stories safely."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, stories are safe, but only if sensitive personal info is not shared. Think of it like showing photos to friends in class—safe if you don’t give away personal secrets. According to my suggestion, prioritize privacy."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  creating stories doesn’t cause identity theft unless you share critical personal info. According to my suggestion, enjoy stories safely, but protect your private data."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, making stories is generally safe. The danger is posting sensitive info like address or ID. According to my suggestion, keep personal information secure and continue making stories safely."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking that deleting the app is the only way to secure your social media is not the best idea. Imagine deleting WhatsApp from your phone just because you want privacy – it solves the immediate problem but you also lose communication with friends and family. In Sri Lanka, you might miss important notices or school updates. Instead, review your privacy settings regularly, control who sees your posts, and limit personal details exposure. That keeps your data safe without losing contact."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  deleting the app might seem like a quick fix, but it’s not practical. Just like throwing away a diary instead of locking it, you avoid one problem but lose all communication and information. In Sri Lanka, you may miss school group notices or family updates. A smarter approach is to adjust settings, limit personal info sharing, and regularly review who can see your posts. This way, your data stays safe and you stay connected."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  deleting an app is like running away from a problem instead of learning to manage it. You lose access to friends, educational groups, and other benefits while the underlying risks remain. In Sri Lanka, missing updates from tuition classes or clubs is inconvenient. Better: configure privacy, limit personal info exposure, and review permissions often. That keeps you protected and connected at the same time."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  deleting an app isn’t a real solution for privacy. It’s like discarding a diary instead of locking it—problems don’t go away, and you lose useful communication. In Sri Lanka, you might miss family messages or tuition updates. The smarter approach is adjusting privacy settings, limiting personal details, and checking who can see your posts. This keeps your account safe without losing connections."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, deleting an app is an extreme measure. You cut yourself off from school groups, work contacts, and friends. In Sri Lanka, this could mean missing important notices or social coordination. A better method is controlling privacy settings, restricting exposure of personal info, and using features like two-step verification. This protects your data effectively while keeping your digital life functional."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  removing the app solves nothing long-term. You might feel safer, but you lose communication, school group updates, and family messages. In Sri Lanka, missing information can be inconvenient. Instead, learn to manage privacy settings, restrict personal info exposure, and review permissions regularly. This keeps you safe without giving up social interaction."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  deleting the app may seem like the easiest solution, but it’s like avoiding a problem instead of managing it. You lose valuable connections and miss updates from work, school, or family. In Sri Lanka, this could affect communication with friends or classmates. Instead, review privacy settings, limit the visibility of personal info, and regularly check permissions. This approach protects your data without isolating yourself."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, deleting the app is not the most practical way to stay safe. It’s like burning a diary instead of locking it—you lose benefits and still don’t learn good habits. In Sri Lanka, you might miss updates from family or school groups. Better: adjust privacy settings, limit who can see personal information, and regularly review permissions to keep data safe while staying connected."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  with better tech skills, you should know deleting the app is overkill. You remove access to friends, updates, and social learning opportunities. In Sri Lanka, it might make you miss important school or tuition updates. Instead, secure your account by reviewing privacy settings, limiting exposure of personal data, and monitoring permissions regularly. This balances safety and connectivity."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  deleting the app may feel safe but is impractical. It cuts you off from friends and updates from school or family groups. In Sri Lanka, this can cause inconvenience. Instead, focus on managing privacy, restricting personal info, and reviewing permissions often. This protects your data while keeping social connections intact."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  deleting the app is like closing a door to avoid danger but throwing away the key. You lose contact with peers, clubs, and educational updates. In Sri Lanka, missing tuition or work info can be problematic. A smarter approach is reviewing privacy settings, limiting what personal data is visible, and using verification tools. This ensures security while maintaining access."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  deleting an app does not teach you good habits and may disconnect you from friends or school groups. In Sri Lanka, this might result in missed notices or messages. Instead, focus on privacy control, limit exposure of personal details, and review permissions regularly to keep your account safe and connected."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, removing the app is too extreme. You lose contacts, updates, and social benefits. In Sri Lanka, this could mean missing essential messages or notices. Instead, review privacy settings, restrict personal info, and enable security features like two-step verification. This keeps your data safe while maintaining communication."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, deleting the app is not a long-term solution. You might feel secure but lose access to friends, school, or family updates. In Sri Lanka, missing messages can be inconvenient. The better approach is managing privacy settings, limiting personal info exposure, and checking permissions often for effective security without isolation."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  deleting an app may temporarily remove risk but cuts you off from important social and professional connections. In Sri Lanka, missing updates from work, tuition, or family can be problematic. Instead, control privacy settings, limit personal info exposure, and regularly check permissions. This way, your data stays safe without losing connectivity."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, deleting an app is an extreme action. It disconnects you from friends, work, and educational groups. In Sri Lanka, this may result in missed updates. A better approach is reviewing and tightening privacy settings, limiting personal details, and monitoring permissions regularly. This balances security with maintaining connections."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking public friend lists are only for party invites is a small misunderstanding. When you keep your friend list public, strangers and scammers can study who you know, spot patterns (like family or workplace links), and then craft believable fake messages targeted at those people. In Sri Lanka that might look like someone pretending to be a relative asking for an emergency loan. Instead, make friend lists private and be cautious when strangers use mutual friends as a trust signal."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  it’s tempting to think friend lists are harmless and only useful for event invites, but publicly showing who you’re connected with makes it easier for a bad actor to map your friends and family. In Sri Lanka scammers can use that map to send convincing messages pretending to be a friend or relative. To stay safe, hide your friend list, question unexpected messages even from mutual friends, and confirm with a phone call before trusting requests."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  assuming public friend lists only lead to social invites misses the bigger danger: attackers can analyze your network to impersonate people you know and create believable lures. For example, they could message multiple people in your circle with the same fake emergency story to increase pressure. In Sri Lanka this works well for social engineering. Make friend lists private, and teach family to verify odd requests by phone."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  friend lists aren’t only for parties — publicly visible lists let attackers map who matters to you and then pretend to be one of them. A scammer might contact your cousin or friend using details gleaned from your profile, so keep lists private. If someone asks for money or personal information, call the person directly before helping. Simple checks stop many Sri Lankan social-engineering scams."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, treating public friend lists as only useful for invites underestimates their value to attackers. Cybercriminals can harvest a friend list to see ties, job roles, or family structure and then craft targeted phishing or impersonation messages. In our local context, scammers exploit mutual connections to ask for money or sensitive info. Hide friend lists, use two‑step verification, and remind friends to verify requests out-of-band."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  public friend lists are more useful to attackers than you think. They allow bad actors to profile your network and launch convincing scams—pretending to know someone you are close with. In Sri Lanka, requests posing as relatives asking for urgent money are common. Protect yourself by making friend lists private and telling close contacts to confirm unusual messages by phone or in person."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  assuming public friend lists are only for social conveniences ignores the social-engineering risks. An attacker can map your friends to identify high‑value targets and craft messages that look like they come from people you trust. In Sri Lanka this can quickly become a convincing money or information scam. Lock down friend lists, and educate your network to be wary of messages that cite mutual connections."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, it’s easy to think friend lists are for invites, but public lists give attackers a blueprint of your social circle. Scammers use that to send tailored fake messages to several friends at once, making the scam seem real. Keep your friend list private and check with the person directly if you receive surprising requests purportedly from mutual friends."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with some tech knowledge, downplaying public friend lists as only for invites is risky. Adversaries can scrape those lists to build social graphs, identify your weak links, and launch multi-target impersonation or phishing campaigns. In Sri Lanka such tactics are used in fake job, loan, and family emergency scams. Make friend lists private, limit what mutual friends can see, and verify requests outside the platform."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  public friend lists let attackers study who you trust and how you’re connected—information they use to create believable lies. A scammer could contact multiple friends to increase pressure to send money. To prevent this, set friend lists to private, and if you see strange messages that reference mutual friends, call those friends directly to confirm."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  assuming friend lists are harmless overlooks how attackers build trust. They scan public lists, find relationships, and impersonate people or fabricate stories using real names. In Sri Lanka, that’s effective because many people trust mutual connections—so keep lists private, enable account protections, and teach family members to confirm unusual requests by phone."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  friend lists are more than event tools; public lists become a roadmap for attackers to impersonate others in your circle. That’s how targeted scams spread fast—someone gets a message 'from a friend' and acts without checking. Make your friend list private, and always verify money or data requests through a phone call or face-to-face confirmation."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, public friend lists enable malicious actors to mine your social graph, find patterns, and assemble convincing social-engineering attacks—much more than party invites. In Sri Lanka, scammers exploit mutual friends to increase credibility. Recommendation: restrict visibility of your friends, use privacy review tools, and instruct family to verify any money requests by voice call."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, friend lists should not be public because attackers use them to map relationships and impersonate trusted contacts. This makes frauds like fake-uncle or fake-colleague requests effective. Set friend lists to private and make a habit of calling friends to confirm unexpected messages that refer to mutual connections."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  public friend lists give adversaries the raw data needed to construct credible social-engineering attacks and identity fraud. They find mutual connections and exploit social proof. For Sri Lankan users, that often becomes convincing money-request or impersonation scams. Fix: hide friend lists, review mutual‑friend visibility, and always verify sensitive requests via an independent channel."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, friend lists are a rich data source for attackers who map social ties and then impersonate someone within your network. In Sri Lanka such targeted scams frequently request urgent money or personal details. Best practice: make your friend list private, educate contacts about verification, and use platform privacy tools to reduce what strangers can learn about your circle."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking public friend lists are only used to block or remove people misses the point. When your friend list is visible, attackers can still study your social circle and send tailored fake messages to many of your friends at once, increasing the chance someone falls for it. In Sri Lanka these mass-targeting tricks are used to ask for money or personal info. Make your friend list private, and teach friends to ignore suspicious requests."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  public friend lists aren’t just for blocking people. Even if you don’t use the list to manage who sees posts, strangers can use it to build trust and send fake messages to many people in your circle. This makes scams more believable. In Sri Lanka, always keep your friend list private and double-check any unexpected messages from people you both know."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  assuming public friend lists only help with blocking or removing users is incomplete. They can be harvested by attackers to identify targets and coordinate scams that reference mutual friends. That multiplies pressure and credibility. To reduce risk, make friends private, and if you receive a request mentioning mutual contacts, verify by phone before engaging."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  public friend lists are more dangerous than just a tool to remove people. They act as a directory for scammers who then message multiple mutuals with the same story to make it seem urgent and real. In Sri Lanka these tricks work well. Solution: hide friend lists and always verify requests referencing mutual friends through a direct call."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, it’s not about blocking—public friend lists give attackers a map of relationships to exploit. They can contact several people in your network with tailored messages, increasing the scam’s legitimacy. This social pressure often forces quick action. Keep friend lists private and encourage your contacts to verify money or data requests independently."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  public friend lists do more than let you block strangers—they let attackers discover who you trust and then impersonate those people with believable messages. In Sri Lanka, this technique is used for urgent-sounding scams. Make friend lists private and confirm any suspicious message by calling the person directly."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  public friend lists are not just about moderation—they’re a data source for social engineering. Attackers use lists to identify and target multiple mutual contacts with coordinated messages. That raises credibility and success rates for scams. Hide your friend list and use independent verification for any unusual request that references mutual friends."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, public friend lists are more than a visibility setting—they’re a directory attackers use to plan scams involving multiple people in your circle. These coordinated attempts appear trustworthy. Protect your network by hiding friend lists and always verifying requests that reference mutual friends via phone."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even if you think friend lists only help with removing people, attackers see them as mapping tools to understand relationships and increase attack success by messaging groups of mutual contacts. In Sri Lanka coordinated scams are effective. Restrict friend visibility and adopt out-of-band verification steps for monetary or sensitive requests."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  public friend lists help attackers coordinate targeted messages to several contacts at once, boosting believability. That is more dangerous than any moderation convenience. Set friend lists to private and verify requests referencing mutual friends directly by phone or in person."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  thinking public friend lists are only a blocking tool underestimates their role in reconnaissance. Attackers use lists to plan mass-targeting of mutual contacts and craft believable narratives. In Sri Lanka these coordinated scams are common. Best practice: make friend lists private and insist on direct verification for requests involving money or personal data."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  friend lists do more than allow blocking—they provide attackers with the network topology needed to scale social engineering attacks. They can message many of your contacts with the same story. Protect your circle by hiding friends and using independent verification for unusual requests."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, publicly visible friend lists are a reconnaissance tool attackers use to coordinate scams across multiple targets in your network. This increases the pressure and perceived legitimacy of the fraud. Restrict friend list visibility, apply two‑factor authentication, and encourage friends to verify suspicious requests via a trusted channel."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, public friend lists are not harmless — they enable attackers to orchestrate multi‑target scams that leverage mutual connections. These coordinated approaches are very effective in Sri Lanka. Make your friend list private and insist on voice or in‑person verification for requests involving money or private data."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  public friend lists provide the map attackers need to launch coordinated social‑engineering attacks across your network. By contacting multiple mutuals they manufacture urgency and credibility. Hide friend lists, review mutual visibility, and adopt strict verification practices for sensitive requests."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, public friend lists allow attackers to plan and execute targeted campaigns that contact several of your mutual connections, greatly increasing credibility. In Sri Lanka such campaigns often request urgent help or money. Keep friend lists private and verify any such requests with a direct phone call."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking public friend lists are only useful for games or invites is too narrow. Attackers can view that list to pick targets, learn who your close friends are, and send fake messages to them to trick you later. For instance, someone might message your friend pretending to be you asking for mobile recharge top‑up—simple but effective. Keep friend lists private and confirm any unusual requests by calling the person directly."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  public friend lists aren’t just for parties or games; they let strangers see who you trust. Scammers use that to impersonate people in your circle and send believable messages. In Sri Lanka, fake requests for money or help are common. To avoid this, make your friends list private and always verify strange requests by phone before responding."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  assuming public friend lists are harmless and only used for trivial things ignores their misuse. Attackers can study your circle and then target friends with fake stories to trick you. A common local scam is asking for urgent money using a mutual friend’s name. Hide your friend list and teach your network to verify unusual requests by calling the person directly."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  friend lists are not just useful for games; they’re a resource for scammers who build believable lies using mutual contacts. This is how many fake‑help or fake‑loan scams spread. Keep friend lists private and if a message sounds odd, always confirm with the person using a phone call or a face‑to‑face question."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, public friend lists are more dangerous than they look; attackers mine them to target your close contacts and craft social‑engineering messages that look credible. In Sri Lanka, these often turn into money‑request scams. Make friend lists private, enable account protections, and tell friends to verify any unusual requests before sending money or information."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  your friend list might seem innocent for games or invites, but scammers use it to identify targets and impersonate trusted people. That’s how many local scams succeed. Keep friend lists private and confirm suspicious messages with a direct phone call."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  public friend lists are often treated like a harmless social feature, but they’re a goldmine for social engineers who want to impersonate friends and trick people into sending money or data. In Sri Lanka such scams are frequent. Set your friend list to private and get into the habit of verifying unusual requests by voice or in person."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, public friend lists may seem useful for harmless features, but they enable scammers to find and impersonate people close to you, increasing the success of fraud. Protect your circle by making the friend list private and always verify unexpected requests with a direct phone call."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  even with tech understanding, treating friend lists as trivial ignores the reconnaissance value they provide to attackers. They can craft targeted fraud using mutual contacts. In Sri Lanka, that often becomes convincing financial scams. Hide friend lists and insist on out‑of‑band verification for requests."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  friend lists help attackers learn who you trust and then impersonate those people, making scams appear real. That’s why many frauds ask you to confirm via mutual friends. Keep friend lists private and always call to verify money or information requests."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  public friend lists are not only social features—they’re reconnaissance data for attackers to launch targeted impersonation and phishing. In our local context, scammers exploit mutual connections to request urgent transfers. Protect yourself by hiding friend lists, and if someone asks for urgent help, confirm via telephone or in person with the named friend."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  friend lists let attackers find your close contacts to impersonate and increase the believability of scams. That’s often how money-request scams succeed in Sri Lanka. Make friend lists private, and always verify surprising requests directly with the person supposedly asking."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, public friend lists are an information source attackers mine for targeted social engineering—more than just for invites or games. They identify people to impersonate and coordinate scams across mutual contacts. The remedy is simple: hide your friend list, enable stronger account protections, and verify unusual requests off‑platform."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, public friend lists are exploited to locate and impersonate people in your circle, making scams seem legitimate. In Sri Lanka this often converts into fake‑help or loan scams. Keep your friends private and insist on voice verification for any money or private info requests."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  friend lists are a reconnaissance tool used by attackers to profile relationships and launch credible social-engineering attacks. They contact several mutuals to build pressure and authenticity. Hide friend lists, enable two‑factor authentication, and require out‑of‑band verification for sensitive requests."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, publicly visible friend lists facilitate targeted impersonation and coordinated scams that leverage mutual acquaintances for credibility. In Sri Lanka, this is a common vector for money and identity fraud. Best practice: hide friend lists, review privacy settings regularly, and always verify unusual requests via a phone call."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking that deleting the app is the only way to secure your social media is not the best idea. Imagine deleting WhatsApp from your phone just because you want privacy – it solves the immediate problem but you also lose communication with friends and family. In Sri Lanka, you might miss important notices or school updates. Instead, review your privacy settings regularly, control who sees your posts, and limit personal details exposure. That keeps your data safe without losing contact."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  deleting the app might seem like a quick fix, but it’s not practical. Just like throwing away a diary instead of locking it, you avoid one problem but lose all communication and information. In Sri Lanka, you may miss school group notices or family updates. A smarter approach is to adjust settings, limit personal info sharing, and regularly review who can see your posts. This way, your data stays safe and you stay connected."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  deleting an app is like running away from a problem instead of learning to manage it. You lose access to friends, educational groups, and other benefits while the underlying risks remain. In Sri Lanka, missing updates from tuition classes or clubs is inconvenient. Better: configure privacy, limit personal info exposure, and review permissions often. That keeps you protected and connected at the same time."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  deleting an app isn’t a real solution for privacy. It’s like discarding a diary instead of locking it—problems don’t go away, and you lose useful communication. In Sri Lanka, you might miss family messages or tuition updates. The smarter approach is adjusting privacy settings, limiting personal details, and checking who can see your posts. This keeps your account safe without losing connections."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, deleting an app is an extreme measure. You cut yourself off from school groups, work contacts, and friends. In Sri Lanka, this could mean missing important notices or social coordination. A better method is controlling privacy settings, restricting exposure of personal info, and using features like two-step verification. This protects your data effectively while keeping your digital life functional."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "  removing the app solves nothing long-term. You might feel safer, but you lose communication, school group updates, and family messages. In Sri Lanka, missing information can be inconvenient. Instead, learn to manage privacy settings, restrict personal info exposure, and review permissions regularly. This keeps you safe without giving up social interaction."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  deleting the app may seem like the easiest solution, but it’s like avoiding a problem instead of managing it. You lose valuable connections and miss updates from work, school, or family. In Sri Lanka, this could affect communication with friends or classmates. Instead, review privacy settings, limit the visibility of personal info, and regularly check permissions. This approach protects your data without isolating yourself."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Miss, deleting the app is not the most practical way to stay safe. It’s like burning a diary instead of locking it—you lose benefits and still don’t learn good habits. In Sri Lanka, you might miss updates from family or school groups. Better: adjust privacy settings, limit who can see personal information, and regularly review permissions to keep data safe while staying connected."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  with better tech skills, you should know deleting the app is overkill. You remove access to friends, updates, and social learning opportunities. In Sri Lanka, it might make you miss important school or tuition updates. Instead, secure your account by reviewing privacy settings, limiting exposure of personal data, and monitoring permissions regularly. This balances safety and connectivity."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  deleting the app may feel safe but is impractical. It cuts you off from friends and updates from school or family groups. In Sri Lanka, this can cause inconvenience. Instead, focus on managing privacy, restricting personal info, and reviewing permissions often. This protects your data while keeping social connections intact."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  deleting the app is like closing a door to avoid danger but throwing away the key. You lose contact with peers, clubs, and educational updates. In Sri Lanka, missing tuition or work info can be problematic. A smarter approach is reviewing privacy settings, limiting what personal data is visible, and using verification tools. This ensures security while maintaining access."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  deleting an app does not teach you good habits and may disconnect you from friends or school groups. In Sri Lanka, this might result in missed notices or messages. Instead, focus on privacy control, limit exposure of personal details, and review permissions regularly to keep your account safe and connected."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, removing the app is too extreme. You lose contacts, updates, and social benefits. In Sri Lanka, this could mean missing essential messages or notices. Instead, review privacy settings, restrict personal info, and enable security features like two-step verification. This keeps your data safe while maintaining communication."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, deleting the app is not a long-term solution. You might feel secure but lose access to friends, school, or family updates. In Sri Lanka, missing messages can be inconvenient. The better approach is managing privacy settings, limiting personal info exposure, and checking permissions often for effective security without isolation."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  deleting an app may temporarily remove risk but cuts you off from important social and professional connections. In Sri Lanka, missing updates from work, tuition, or family can be problematic. Instead, control privacy settings, limit personal info exposure, and regularly check permissions. This way, your data stays safe without losing connectivity."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, deleting an app is an extreme action. It disconnects you from friends, work, and educational groups. In Sri Lanka, this may result in missed updates. A better approach is reviewing and tightening privacy settings, limiting personal details, and monitoring permissions regularly. This balances security with maintaining connections."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking never to post anything might feel safe, but it’s not practical. Imagine not sharing your school project pictures with your classmates just because you are scared someone might misuse them. You miss opportunities to communicate, learn, and connect with friends. Instead, post thoughtfully, avoid sharing sensitive personal information, and regularly review your privacy settings. That way, you can enjoy social media safely without giving up fun or learning."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  if you never post anything, you might feel secure, but you also miss chances to share school updates or talk to friends. In Sri Lanka, sharing class notes or cultural festival pictures is common and helpful. The better approach is to post safely, check who can see it, and avoid sharing private details. This keeps you connected and safe at the same time."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  never posting anything is like locking yourself in your room to avoid danger. You miss out on important school updates, social interactions, and learning opportunities. In Sri Lanka, students often use social media for class discussions or club updates. Instead, post wisely, protect personal information, and review who can see your posts. That keeps you safe while still participating socially."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  avoiding posting completely is unnecessary and limiting. You may feel safe, but you also miss class announcements, friends’ activities, or cultural updates. In Sri Lanka, sharing safely is key. Use privacy controls, limit sensitive info, and think before posting. This balances security and social participation effectively."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, never posting is an extreme approach. You miss important professional or social connections. In Sri Lanka, social media is often used for learning, clubs, or workplace updates. Better: review privacy settings, limit sensitive information exposure, and post selectively. That keeps your account safe while maintaining connections and opportunities."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Miss, never posting may seem secure, but it disconnects you from friends, colleagues, and important updates. In Sri Lanka, staying connected is vital for school and work. Instead, manage privacy settings, limit personal info sharing, and post thoughtfully. This ensures safety without isolation."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  never posting anything is like avoiding all interaction. You lose professional networking, social updates, and learning opportunities. In Sri Lanka, social media helps students and professionals stay informed and connected. Instead, post selectively, protect sensitive info, and review privacy controls. This way, you stay safe and connected."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Madam, never posting anything may feel safe but limits communication with friends, family, and colleagues. In Sri Lanka, social media is a useful tool for school, work, and social connections. Instead, post carefully, protect personal information, and control visibility. This keeps your account secure while still participating in the community."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  with better IT skills, you should know avoiding posting is unnecessary. You lose out on sharing important updates, school activities, and social interactions. In Sri Lanka, students often use social media for learning and connecting with friends. Instead, post safely, limit exposure of personal info, and check privacy settings regularly. This gives safety and social engagement at the same time."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  never posting is overcautious. You miss school updates, friends’ messages, and cultural interactions. In Sri Lanka, staying socially active safely is important. Instead, use privacy controls, limit sensitive info, and post thoughtfully. This balances safety with social participation."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  avoiding all posts is extreme. You lose learning opportunities, social communication, and class discussions. In Sri Lanka, posting wisely is key. Review who can see your posts, avoid sharing sensitive personal information, and post selectively. This ensures you stay safe and connected."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  never posting anything may feel protective but isolates you from friends, classmates, and updates. In Sri Lanka, social media helps with school and social life. Instead, post carefully, manage privacy, and limit sensitive details. This ensures safety while maintaining social interactions."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, never posting anything is unnecessarily restrictive. You miss social, educational, and professional updates. In Sri Lanka, social media is used to stay connected and informed. Better: manage privacy settings, limit personal info, and post selectively. This balances security with active participation."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, never posting is not practical. You lose social, educational, and professional opportunities. In Sri Lanka, it is better to post safely, review privacy settings, and limit sensitive information exposure. This keeps you secure while remaining socially active."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  never posting anything is an overreaction. You lose networking, learning, and social interactions. In Sri Lanka, social media is a tool for education and work. Instead, post thoughtfully, protect sensitive info, and control visibility. This ensures security while maintaining connections."
  },
  {
    "questionId": "Q10",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, never posting is overly cautious. It disconnects you from professional, social, and educational updates. In Sri Lanka, carefully posting with privacy controls and limiting sensitive information is more effective. This approach balances security with active participation in social and professional life."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  thinking that following celebrities will teach you social media safety is misleading. Just because a popular person posts something doesn’t mean it’s safe for you. Imagine copying a classmate who shares their personal phone number publicly—you might get into trouble. In Sri Lanka, sharing personal details carelessly can lead to scams or bullying. Instead, learn from verified safety guides, adjust privacy settings, and post wisely. That way, you stay protected while enjoying social media."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "  copying celebrities on social media might look fun, but it’s risky. Just because they post certain photos or info doesn’t mean it’s safe for you. Imagine following a famous person sharing personal contacts—you could face identity misuse. In Sri Lanka, always check privacy settings, avoid oversharing, and learn from trusted safety tips. This keeps you safe and smart online."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  thinking celebrities are role models for safety is wrong. Their accounts may be managed by teams, not reflecting real-life risks. Imagine sharing your home location like a celebrity—you might get targeted by scammers. In Sri Lanka, always adjust privacy, limit personal info exposure, and learn safe posting habits. This keeps you connected while reducing risks."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "  copying celebrities’ online habits is not safe. Their posts may be controlled or edited by professionals. Imagine sharing your school timetable like a celebrity—you could face misuse. In Sri Lanka, review privacy settings, avoid sharing sensitive info, and follow trusted safety guidelines. This balances social engagement and security."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Aiya, relying on celebrities for social media safety is unwise. Their accounts are managed differently, and copying them can expose you to phishing or scams. In Sri Lanka, posting like them without precautions might leak personal info. Instead, review privacy, control audience settings, and learn online safety best practices to protect yourself effectively."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Miss, following celebrities for safety tips is risky. Their posts are often curated, and doing the same might expose you to identity theft or misuse. In Sri Lanka, always manage privacy, limit personal info, and learn safety practices from trusted sources. This ensures your social media use is both safe and informed."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "  celebrities are not guides for social media safety. Their accounts may be public or managed by teams, and copying them can expose personal data. In Sri Lanka, sharing personal info like them could lead to scams. Better approach: use privacy settings, post selectively, and follow verified safety resources. This keeps your online life secure while staying active socially."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Madam, copying celebrities’ social media habits is not safe. Their accounts are often controlled professionally, so following blindly could risk your privacy. In Sri Lanka, sharing personal information like them can lead to misuse. Instead, adjust privacy, limit exposure of sensitive info, and follow trusted safety guidelines. This keeps your account secure and smartly managed."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  with better IT knowledge, you should know celebrities are not security experts. Copying their behavior can expose your personal info, such as phone numbers or locations. In Sri Lanka, online scams are common. The correct way is to control privacy, limit data exposure, and follow verified safety guides. This way, you stay connected safely."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "  celebrities may seem safe, but copying them blindly can risk personal data exposure. In Sri Lanka, sharing sensitive info can attract phishing or harassment. Instead, learn safe posting habits, manage privacy settings, and avoid oversharing. This keeps you socially active yet protected online."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  following celebrities for security tips is misleading. Their posts are often curated or managed by professionals. In Sri Lanka, mimicking them could expose your personal info. Instead, post thoughtfully, control privacy settings, and follow verified safety guides to maintain security while staying socially engaged."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "  celebrities are not role models for social media safety. Copying them may put you at risk of scams or misuse of personal info. In Sri Lanka, it’s safer to adjust privacy, limit personal data exposure, and follow trusted safety practices. This ensures safe and smart social media use."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Aiya, following celebrities for safety is unwise. Their accounts are often managed professionally, and copying them can expose you to phishing, spam, or identity misuse. In Sri Lanka, sharing info like them could be risky. Instead, review privacy settings, limit exposure, and follow trusted safety practices to stay secure."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Miss, celebrities’ posts may look safe but copying them is risky. In Sri Lanka, posting personal info like them can lead to misuse. Better: manage privacy settings, limit sensitive data, and learn online safety from reliable sources. This ensures you stay safe while enjoying social media."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "  celebrities are not guides for social media safety. Their accounts are often public or professionally managed, so copying them could expose personal information. In Sri Lanka, online scams and identity misuse are risks. Better: manage privacy, limit personal data sharing, and follow verified safety guidelines. This keeps your account secure and socially active."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Madam, copying celebrities for social media safety is unsafe. Their accounts are curated or professionally managed, and following them blindly could risk your privacy. In Sri Lanka, posting personal info carelessly could lead to scams. Instead, adjust privacy settings, limit personal info, and follow trusted safety guides to stay secure while socially active."
  }
]
