[
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, 'https://' doesn’t make a website load faster. It actually means the site is secure and uses encryption to protect your information. Just imagine you're sending a message to a friend — HTTPS keeps others from reading it on the way. In Sri Lanka, this helps when using online banking or school portals. According to my suggestion, option B is better because it teaches you that HTTPS focuses on safety, not speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "HTTPS doesn’t relate to loading speed; it’s about online security. Think of it like locking your school bag — it may take a moment longer, but it keeps your books safe. In Sri Lanka, we often log in to learning platforms; HTTPS protects your passwords from being stolen. According to my suggestion, option B is correct because it ensures privacy and security, not speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "HTTPS isn’t meant to speed up a website. It’s a secure communication layer that encrypts data between your device and the website. Like sealing a letter in an envelope, HTTPS prevents others from reading what you send. In Sri Lankan e-learning portals or job sites, HTTPS keeps your logins safe. Option B is better because it highlights encryption and protection, not speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "HTTPS is not related to faster browsing; it’s about encrypted communication. Even though some secure sites may load slightly slower, they protect your personal data, which is more important. In Sri Lanka, where online transactions are rising, HTTPS ensures banking safety. According to my suggestion, option B is better because it focuses on encryption, the key to cybersecurity."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "My dear, HTTPS doesn’t make websites faster; it makes them safer. Think of it like wearing a seatbelt — it may not make the car go quicker, but it keeps you safe. In Sri Lanka, when you open school or banking sites, HTTPS keeps hackers away. So, according to my suggestion, option B is better as it teaches the real meaning of online protection."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "HTTPS doesn’t increase speed but ensures safety. It’s like locking your diary before you leave home — others can’t read what’s inside. Many Sri Lankan sites use HTTPS to protect your details while studying or applying online. Option B is better because it highlights security and encryption, not speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "HTTPS is a secure connection, not a performance feature. Think of it as a shield that guards your data. In Sri Lanka, while making university payments or filling out online forms, HTTPS ensures your details are encrypted. So, according to my suggestion, option B is better because it focuses on protection, not page load speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "HTTPS doesn’t make websites load faster; it adds a layer of security. Even if it takes a second more, it safeguards personal data. In Sri Lanka, where scams are increasing, this protection matters. According to my suggestion, option B is the right choice since it ensures encryption and privacy instead of speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "HTTPS doesn’t affect site speed — it’s designed for encryption. Like wearing a helmet, it adds safety without changing your riding speed. Sri Lankan youth using free Wi-Fi should know HTTPS prevents data theft. According to my suggestion, option B is better as it focuses on secure connections, not performance."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "HTTPS protects user privacy by encrypting communications. It’s not related to page speed. Imagine sealing an envelope before posting it — that’s what HTTPS does online. In Sri Lankan online studies or freelancing, HTTPS prevents credential leaks. So, option B is better because it recognizes HTTPS as an encryption system, not a speed booster."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "HTTPS ensures data confidentiality through SSL/TLS encryption. While it may slightly slow down loading, its value lies in trust and security. Sri Lankan businesses using payment systems rely on HTTPS for customer safety. According to my suggestion, option B is correct as it captures this encryption principle accurately."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "HTTPS, using TLS encryption, doesn’t accelerate page loading; it secures data transmission. Many Sri Lankan e-commerce sites like Kapruka or PickMe rely on HTTPS for transaction safety. According to my suggestion, option B is better because it acknowledges encryption as the key factor, not speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "HTTPS doesn’t make browsing faster, my girl. It keeps your data safe from hackers. Think of it like using a lock for your phone. In Sri Lanka, when using apps for payments or schoolwork, HTTPS ensures security. Option B is better because it represents protection through encryption, not speed."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "HTTPS encrypts your connection, not increases speed. Just like wearing a helmet, it adds safety, not performance. For Sri Lankan students applying to universities or using bank apps, HTTPS ensures protection. According to my suggestion, option B is better since it emphasizes the security layer."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "HTTPS means HyperText Transfer Protocol Secure, which encrypts data. It doesn’t influence speed but builds trust. Many Sri Lankan online portals depend on HTTPS for data safety. According to my suggestion, option B is correct as it points to encryption as the real purpose of HTTPS."
  },
  {
    "questionId": "Q1",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "HTTPS creates secure communication using encryption, not speed optimization. In Sri Lanka, users on public Wi-Fi or e-learning portals rely on HTTPS for data confidentiality. According to my suggestion, option B is better because it focuses on encryption and trust-building between user and website."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, 'https://' isn’t just for government websites. It’s used by almost every safe site like Facebook, Gmail, and bank portals. In Sri Lanka, even your school site may use HTTPS to protect your login. Think of it like a safety lock for all doors, not only government ones. According to my suggestion, option B is better since it means a secure, encrypted connection."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "HTTPS is not limited to government sites; it’s a security standard for all websites. Imagine every online form you fill, whether for school or social media — HTTPS keeps your data private. In Sri Lanka, local stores and universities also use HTTPS. Option B is better as it shows HTTPS secures data, not limits it to government domains."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "HTTPS appears on all trusted sites, not just government ones. It encrypts data between the browser and server. For example, when applying for jobs or doing e-learning in Sri Lanka, HTTPS keeps your passwords safe. According to my suggestion, option B is better because it explains the encryption that protects any website user, not just officials."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "HTTPS isn’t specific to government domains; it’s a global standard for online safety. Sri Lankan businesses, universities, and even small e-commerce sites use HTTPS to protect user trust. Option B is better since it defines HTTPS as a secure communication method for all web users, not a government-only feature."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "My dear, HTTPS isn’t just for government websites. Even your Facebook, YouTube, and bank accounts use it to protect your data. Think of it like having a lock on every home, not just the president’s house. In Sri Lanka, many school and university sites use it too. According to my suggestion, option B is better as it focuses on safety for everyone."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "HTTPS isn’t a government-only thing. It’s a protection symbol that any safe site uses to keep users’ information private. For example, Sri Lankan job portals and university systems use HTTPS to guard data. Option B is better as it correctly explains that HTTPS provides encryption, not government restriction."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "HTTPS is not a government label but a web standard for data security. Whether it's Dialog’s payment page or your university LMS, HTTPS ensures no one reads your personal details. In Sri Lanka, this helps prevent scams and data theft. Option B is better since it defines HTTPS as encryption for all websites, not only official ones."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "HTTPS is not reserved for government use. It’s like having a lock that anyone can install on their door. Businesses, schools, and banks in Sri Lanka all use HTTPS to protect information. According to my suggestion, option B is the correct answer as it highlights that HTTPS provides encrypted communication for every site, not just .gov ones."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "HTTPS isn’t only for government pages. It’s used in almost every safe website — from YouTube to school portals. Think of it as a digital lock everyone can use. In Sri Lanka, HTTPS helps users avoid fake sites. According to my suggestion, option B is correct because it means secure, encrypted communication, not government ownership."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "HTTPS provides encryption and integrity to all websites, not limited to .gov domains. In Sri Lanka, many banks and universities implement HTTPS to protect users. Thinking it’s government-only is a misunderstanding. According to my suggestion, option B fits better since it highlights HTTPS as a universal standard for encrypted communication."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "HTTPS applies to every secure site, not just official ones. It’s like a lock that both banks and government offices use. Sri Lankan institutions such as SLT and private universities all depend on HTTPS to protect users. Option B is better because it emphasizes HTTPS as a web encryption method for all, not a government feature."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "HTTPS is a web security protocol ensuring encrypted data exchange, used universally — not just by government domains. In Sri Lanka’s growing e-commerce scene, HTTPS ensures safe payments. Option B is better as it recognizes HTTPS as an encryption standard applied to all websites, not restricted to .gov addresses."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Girl, HTTPS is not only for government websites. It’s like a common safety rule that all good sites follow. From Facebook to your school’s web page, HTTPS protects your passwords. In Sri Lanka, every trusted site uses it. Option B is better because it shows HTTPS is about encryption, not ownership."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "HTTPS means secure communication for all websites, not only government ones. Many Sri Lankan online services like banks and shopping sites rely on it to maintain user privacy. According to my suggestion, option B is correct as it represents HTTPS as an encryption technology used widely across all web platforms."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "HTTPS provides encryption for all sites, not just government domains. It ensures safe data transfer for everything from e-learning to online shopping in Sri Lanka. Believing it’s for .gov sites only is a common myth. Option B is better since it correctly defines HTTPS as universal encryption technology."
  },
  {
    "questionId": "Q1",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "HTTPS ensures data privacy and encryption for everyone online, not only for government users. Sri Lankan organizations like banks and delivery services depend on it to secure transactions. Option B is better because it identifies HTTPS as a universal encryption layer, ensuring trust across all web platforms."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Malli, ad blockers are helpful, but they are not the main reason for browser security. Think like this: your school gate is not to stop ice cream sellers but to stop strangers who may harm. Similarly, browser security protects from hackers, fake links, and data theft — not just ads. Learn to update browsers and use strong passwords to stay safe."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, blocking ads is a small part of what security tools do. Browser security mainly prevents malicious websites, phishing pages, and harmful scripts. Ads may be annoying, but some are safe while others hide traps. So next time, think like using a helmet — not just for dust but to save your life in accidents. That’s how browser protection works."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, you might feel browser protection is only about stopping ads, but real browser security fights cyber threats like phishing, malware, and tracking. Ads can be managed separately using blockers, but security layers focus on privacy and safe connections. Imagine your bike lock — it’s not to stop birds sitting but thieves stealing it. That’s the difference here."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a basic tech level, it's important to see browser security as a shield against attacks, not an ad filter. Ads may distract, but security features stop data leaks, phishing, and unsafe downloads. In Sri Lanka, many public Wi-Fi users forget this. Stay aware by checking HTTPS and avoiding pop-ups instead of assuming ad blocking equals safety."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Aiyo malli, browser security isn’t mainly to block ads. It’s to guard your data, stop phishing, and warn you about risky sites. Ad blockers can be added separately. Think of it like a school prefect — their duty is discipline, not chasing away vendors outside the gate. Learn to focus on real online threats instead of ads only."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "In Sri Lanka, many users misunderstand that browser protection is for ads. Actually, it’s for verifying site certificates, scanning downloads, and blocking malware. Ads can be visual clutter, but the deeper danger is fake websites stealing your data. Improve by learning about SSL, site permissions, and browser updates — they’re your real shields, not ad blockers."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, as an HND-level learner, know that browser security modules protect data integrity, detect malicious scripts, and encrypt traffic. Ad blocking is just cosmetic. Think about your firewall — it’s not for reducing pop-ups but preventing attacks. So, focus on enabling HTTPS, clearing cookies, and learning phishing signals. That’s the path to cyber maturity."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "As a degree-level IT student, you likely know that ad blocking is a usability feature, not core security. Browser security involves sandboxing, safe browsing APIs, and SSL validation. Ads may carry malicious code, but protection systems act much deeper — at the connection and code execution level. Always differentiate between UX enhancement and true cybersecurity."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, browser protection is not mainly to stop ads but to protect your private data and warn you from unsafe websites. Ads may look harmless, but the real danger is fake websites. Imagine your mother closing the gate to keep you safe, not to stop ice cream sellers. That’s how browser protection works — to protect, not to block fun."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, browser security protects your accounts, not just your screen from ads. Ads are just small things that distract you, but the bigger risk is someone stealing your password through fake pages. So, don’t think like removing an ad makes you safe. Think of it like wearing a mask — it helps, but you still need medicine to avoid illness."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, you may think browser security only blocks ads, but its real job is to guard your information, scan risky downloads, and protect online accounts. Ads can be removed by plugins, but security helps prevent real cyber harm. Like how we clean our kitchen but still lock the door, browser safety goes beyond surface-level cleanliness."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Sis, for a degree-level student, it’s good to know browser protection involves security layers beyond ad blocking. It ensures encryption, detects malware, and protects login credentials. Ads are like noise, but cyber threats are silent thieves. To move forward, focus on features like HTTPS, certificate validation, and secure password management instead of ad blocking."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Mage duwa, browser security keeps your personal data safe — not mainly to stop advertisements. Ads can distract you, but real threats are hackers and fake sites. Like how we cover food from flies, it’s not the cover that matters most but keeping the food clean. So keep browsers updated and avoid unsafe links instead of worrying about ads."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Darling, many think browser protection is for ad removal, but it’s far more powerful. It verifies safe connections, blocks harmful scripts, and keeps your accounts private. Ads can annoy, yes, but cyberattacks are dangerous. Imagine if your social media login was stolen — scary, right? So always update browsers and enable security warnings before browsing."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Sis, ad blocking is not browser security. It’s just one tool to improve user comfort. Real protection lies in encryption, malicious site alerts, and sandboxing. Think of it like wearing makeup — it looks nice but doesn’t stop you from getting sick. Real safety is the antivirus and browser shield behind the scenes protecting your system."
  },
  {
    "questionId": "Q1",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, you can understand that ad blockers enhance user experience, not security. Browser protection focuses on authentication, malware prevention, and privacy. Ads can mislead but aren’t the root issue. Like Sri Lankan online shopping — removing banners doesn’t make it safer; using secure payment gateways does. Learn to distinguish comfort from protection."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, using public Wi-Fi doesn’t make your battery drain faster — that’s not the main risk. The real danger is that hackers can intercept your data. Imagine you’re sending your school report via email at the bus station; if the Wi-Fi isn’t secure, someone could see it. In Sri Lanka, this is common in cafes and bus stations. Option C is better because it highlights data safety, not battery life."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, your phone battery may not be affected by public Wi-Fi, but your personal information can be stolen if the network is unprotected. Think of it like leaving your school bag unattended in a crowded bus station — the danger is theft, not exhaustion. In Sri Lanka, many cafes offer free Wi-Fi, so always use a VPN or secure network. Option C is better as it emphasizes interception risk."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, connecting to public Wi-Fi won’t make your phone drain faster directly. The big threat is that attackers on the same network can capture your data, like passwords or banking info. Imagine accessing a university portal in Colombo using unprotected Wi-Fi — your login info could be stolen. Option C is better because it focuses on cybersecurity risk rather than battery life."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Using public Wi-Fi doesn’t impact battery life much; the main risk is data interception. In Sri Lanka, students often connect at libraries or cafes. Without protection, personal emails, banking, and university accounts can be compromised. Think of your data as cash — unprotected networks are like leaving money on the street. Option C is better because it warns about real cyber threats."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, your battery won’t run out faster just because you use public Wi-Fi. The danger is that someone could see your messages, pictures, or passwords if the network is open. For example, using Wi-Fi at a Colombo café without protection could let hackers steal your information. Option C is better as it teaches about data interception, not battery life."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, public Wi-Fi doesn’t make your phone weaker or drain faster. The real problem is that strangers on the same network can access your private information. In Sri Lanka, this can happen in libraries or buses. So always use a VPN or secure sites. Option C is better because it explains the main cybersecurity risk — interception of data."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, battery draining is not the risk of public Wi-Fi. The main danger is hackers capturing your sensitive information, such as social media logins or online banking. Imagine using a free Wi-Fi at a popular café in Colombo — someone could steal your credentials. Option C is better as it highlights the interception threat, not battery issues."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, connecting to public Wi-Fi doesn’t reduce your battery significantly. The real concern is data security. When using open networks in Sri Lanka like malls or cafes, hackers can intercept your private information. Think of your data like money; unprotected networks are risky. Option C is better because it teaches the correct cybersecurity risk."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Using public Wi-Fi doesn’t directly drain battery. The real threat is that someone on the same network can capture your sensitive information, like passwords or emails. For example, a student in Colombo using open Wi-Fi at a café could be vulnerable. Option C is better as it emphasizes data interception and safe browsing, not battery concerns."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Many users mistakenly think battery is the main concern on public Wi-Fi. In reality, unencrypted networks allow attackers to intercept traffic. Sri Lankan freelancers or students using Wi-Fi in libraries or cafes should protect sensitive info with a VPN. Option C is better because it highlights data interception, not battery issues."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Battery usage is a minor effect; the main problem with public Wi-Fi is security. Attackers can monitor unprotected connections, capturing sensitive data like bank credentials or university login info. In Sri Lanka, public networks in cafes or transport hubs are common. Option C is better because it focuses on the real risk — interception of data."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Battery drain is irrelevant compared to the cybersecurity risk of public Wi-Fi. Hackers on the same network can capture sensitive data, even in Colombo cafés or universities. Using HTTPS and VPNs is essential. Option C is better because it accurately identifies the risk of data interception, which is the key danger here."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Girl, your battery won’t really drain faster with public Wi-Fi. The real risk is that hackers can see your messages or passwords. In Sri Lanka, public places like buses or cafés offer open Wi-Fi, which can be dangerous. Option C is better because it teaches the actual security concern — interception of personal data."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, public Wi-Fi is not about battery life. Its danger is that unprotected networks allow cybercriminals to steal information like online banking or school login credentials. Many Sri Lankan cafés or libraries provide free Wi-Fi, but without protection, it’s risky. Option C is better because it explains the main cybersecurity threat."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, battery issues are minor. The main risk with public Wi-Fi is attackers intercepting sensitive data. Think of using open Wi-Fi at Colombo City Center — hackers could steal account info. Option C is better because it teaches correct cybersecurity practice: always use secure networks or VPNs."
  },
  {
    "questionId": "Q2",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At higher level, understand that public Wi-Fi does not primarily affect battery but exposes data to interception. Sri Lankan students or professionals using open networks need HTTPS and VPN protection. Option C is better because it teaches the real threat — data interception — rather than focusing on an irrelevant factor like battery drain."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, using public Wi-Fi doesn’t make your phone heat up significantly. The real threat is that hackers can intercept your personal data, like WhatsApp messages or banking info. Imagine connecting your laptop in a Colombo café; someone could sneakily capture your credentials. Option C is better because it correctly identifies data interception as the main risk, not phone heating."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, your phone might feel warm sometimes, but public Wi-Fi doesn’t cause that directly. The real danger is attackers seeing your private information on an unprotected network. In Sri Lanka, open networks at bus stations or malls can be risky. Option C is better since it emphasizes interception of sensitive data, which is the main cybersecurity concern."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, a heating phone isn’t the real problem with public Wi-Fi. The danger is hackers intercepting unencrypted data like passwords or emails. Imagine checking your university portal in Colombo over an open Wi-Fi; attackers could capture your login. Option C is better because it focuses on real cyber threats rather than phone temperature."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Using public Wi-Fi doesn’t cause your phone to heat up significantly. The main risk is that attackers can intercept sensitive data like online banking or personal emails. In Sri Lanka, many students and professionals use open networks in cafés or libraries. Option C is better because it correctly points to data interception rather than device heating."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, your phone won’t really get hot just from using public Wi-Fi. The true danger is that hackers can capture your personal information, like messages or banking details, over unprotected networks. Think about using Wi-Fi at Colombo City Center — someone could see your data. Option C is better because it focuses on actual cyber risks, not phone heat."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, phones may warm up for many reasons, but public Wi-Fi isn’t one of them. The main danger is attackers intercepting your private data. In Sri Lanka, libraries and cafés provide open Wi-Fi which can be risky if unprotected. Option C is better because it correctly highlights the risk of data interception."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, heating phones are not the problem here. The real threat of public Wi-Fi is that attackers can capture sensitive information like passwords or school accounts. Imagine using free Wi-Fi in Colombo without a VPN — someone could steal your login. Option C is better because it emphasizes real cyber danger."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, your phone heating up is not the main issue with public Wi-Fi. The main risk is data interception — someone could see your emails or banking info. In Sri Lanka, open networks in malls or cafes can be risky. Option C is better because it focuses on real cybersecurity threats instead of device heating."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Aiyo malli, phone heating is a minor effect. The real problem with public Wi-Fi is that hackers can intercept your traffic, capturing sensitive data like passwords and emails. Sri Lankan students and workers using café or library Wi-Fi should be careful. Option C is better because it emphasizes data security, not device heat."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Many people confuse device heating with Wi-Fi risks. The real danger is that attackers on open networks can intercept your data, like bank or social media logins. In Sri Lanka, using open networks without a VPN is risky. Option C is better as it focuses on actual cybersecurity threats rather than phone heating."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, a warm phone is not the security risk. Public Wi-Fi can allow hackers to capture sensitive information, from emails to online transactions. Think about using free Wi-Fi at a Colombo café — without encryption, your data is exposed. Option C is better because it emphasizes the main threat: data interception."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, understand that device heating is negligible compared to the risk of data interception on public Wi-Fi. Hackers can sniff traffic and steal credentials. In Sri Lanka, open networks are everywhere — cafes, libraries, and bus stations. Option C is better because it accurately identifies the cybersecurity threat, not the hardware effect."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, phone heating is not the main concern on public Wi-Fi. The real threat is that someone could intercept your messages or passwords. Using open networks in Sri Lanka without protection is risky. Option C is better as it highlights the actual cybersecurity risk — data interception — instead of focusing on phone heat."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, your phone getting hot isn’t the problem. The danger is attackers capturing sensitive information over unprotected Wi-Fi. Many open networks in Colombo or other cities can be risky without a VPN. Option C is better because it focuses on the real threat: data interception."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, heating is minor. The real risk is that cybercriminals could intercept sensitive information on public Wi-Fi. Imagine using free Wi-Fi in Colombo without protection — someone could steal your passwords or banking info. Option C is better because it teaches correct cyber safety practice."
  },
  {
    "questionId": "Q2",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher level, device heat is irrelevant compared to cybersecurity risk on public Wi-Fi. Hackers can capture sensitive information from open networks. In Sri Lanka, students and professionals need HTTPS, VPNs, and caution. Option C is better because it teaches real risk — interception of private data — not phone heating."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, slow website loading is not the main risk of using public Wi-Fi. The real threat is someone intercepting your personal data like WhatsApp messages or online banking details. Imagine you are checking your school email at a Colombo café using open Wi-Fi — hackers could capture your login information. Option C is better because it focuses on real cybersecurity risk, not internet speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, slow-loading sites may be annoying, but the danger of public Wi-Fi lies in data interception. In Sri Lanka, students often connect in libraries or cafés. Hackers on the same network can steal passwords or banking information. Option C is better because it emphasizes the real risk of data theft rather than just waiting a few extra seconds for a page to load."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, thinking that slower websites are the problem is a common mistake. The real issue is that unprotected public Wi-Fi allows attackers to intercept sensitive information, like login credentials or personal emails. In Colombo, free Wi-Fi in cafés or buses can be dangerous without protection. Option C is better because it focuses on cybersecurity risk, not site speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Using public Wi-Fi may sometimes slow down websites, but that is not the main risk. The real danger is hackers capturing sensitive data like online banking or school portal logins. In Sri Lanka, students and professionals often connect to free Wi-Fi in cafés and libraries. Option C is better because it teaches the real cybersecurity threat — data interception — instead of focusing on speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, slow websites aren’t the main danger of public Wi-Fi. The real threat is that someone could intercept your private information, like messages or passwords. Imagine using open Wi-Fi at a Colombo mall; hackers could steal your login details. Option C is better because it emphasizes data interception, which is the real risk, not page loading speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, websites may load slowly sometimes, but the bigger risk with public Wi-Fi is data interception. In Sri Lanka, open networks in libraries, cafés, and buses can allow attackers to steal sensitive information. Option C is better because it explains the main threat — interception of personal data — not slow site loading."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, slow-loading websites are not the main risk. The real danger is that cybercriminals could intercept your sensitive information like passwords or bank accounts over public Wi-Fi. Imagine using free Wi-Fi in Colombo without a VPN — your data could be exposed. Option C is better because it focuses on actual cybersecurity threats rather than internet speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Sis, public Wi-Fi may cause slight slowness, but the main threat is attackers intercepting your private information. In Sri Lanka, open networks at cafés or libraries are common. Option C is better because it emphasizes the real cybersecurity risk of data interception, not just the inconvenience of slower pages."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Aiyo malli, website speed is not the main concern on public Wi-Fi. The real problem is that hackers can intercept sensitive data like emails, banking info, or social media credentials. In Sri Lanka, open networks in cafés or libraries are common. Option C is better because it teaches about real cyber threats rather than just page load speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Many think that slow websites are the main risk on public Wi-Fi, but the real issue is data interception. Hackers on unprotected networks can capture passwords and private info. Sri Lankan students and professionals using open Wi-Fi should protect themselves with VPNs. Option C is better because it focuses on the true cybersecurity threat."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, thinking speed is the problem is misleading. The main risk on public Wi-Fi is that attackers can intercept sensitive information like banking credentials or personal emails. Colombo cafés and libraries often offer free Wi-Fi, but without protection, it’s risky. Option C is better because it focuses on real cybersecurity risk rather than slow website loading."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, it’s important to know that website speed is a minor issue. The primary risk of public Wi-Fi is interception of sensitive data. Hackers can steal credentials or personal information on open networks. Option C is better because it highlights the real cybersecurity concern, not a temporary slowdown."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, slow websites are not the main danger of public Wi-Fi. The real threat is that attackers can see your private messages, emails, and passwords. Using open networks in Sri Lanka without VPN is risky. Option C is better because it emphasizes the real cybersecurity risk rather than just page loading speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, website slowness is minor compared to the real risk: attackers intercepting sensitive data on public Wi-Fi. In Colombo, cafés, libraries, and buses provide open networks. Option C is better because it explains the main cybersecurity concern — data interception — not temporary loading delays."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, slow-loading websites are not the main problem. The real risk on public Wi-Fi is interception of sensitive information like banking or social media accounts. Free networks in Sri Lanka are convenient but risky without VPNs or HTTPS. Option C is better because it focuses on actual cybersecurity threats, not speed."
  },
  {
    "questionId": "Q2",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher level, understand that website speed is not a cybersecurity risk. The main concern is that attackers can intercept private data on unprotected public Wi-Fi networks. In Sri Lanka, students and professionals need HTTPS and VPNs for protection. Option C is better because it focuses on the real threat — interception of sensitive information."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, just checking if a website looks colorful won’t keep your personal info safe. Hackers can make even flashy websites look attractive to trick you. Imagine clicking a colorful website claiming to be your school portal in Colombo — your login info could be stolen. The safe approach is to check if the site uses HTTPS, which encrypts your data and keeps it secure."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, a colorful site may look nice, but it doesn’t mean it’s secure. Cybercriminals often create visually attractive fake websites to steal information. For example, if you enter your bank info on a flashy but fake site in Sri Lanka, hackers could misuse it. Always look for HTTPS to ensure your data is encrypted and safe."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, flashy colors on a website are not a sign of safety. Hackers design attractive pages to deceive users. In Sri Lanka, students logging into university portals need to be cautious. HTTPS indicates encrypted communication, which protects sensitive info like passwords or emails. Option D is better because it focuses on real cybersecurity protection, not appearance."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Using visual appeal as a safety check is misleading. Colorful websites can still be malicious. For instance, Sri Lankan users entering personal data on a flashy fake site risk theft of banking or email credentials. Always verify HTTPS to ensure secure communication. Option D is better as it directly addresses encryption and data security."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, a website looking colorful does not mean it is safe. Hackers can make fake sites attractive to trick you. Imagine entering your school portal login in Colombo on a flashy website — someone could steal your info. Option D, checking HTTPS, is better because it protects your personal information using encryption."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, colorfulness is not security. Many fake websites look nice to trick users. If you enter bank or school info on such sites in Sri Lanka, your credentials could be stolen. Always check for HTTPS to ensure encryption and protect your data. Option D is better because it targets real cybersecurity protection."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, bright or flashy websites don’t guarantee safety. Hackers often create attractive pages to lure users. In Sri Lanka, students or professionals need to check HTTPS to ensure the site encrypts your data. Option D is better as it focuses on actual protection rather than appearances."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, don’t trust a colorful website for safety. Hackers can make malicious sites look appealing. In Colombo or other Sri Lankan cities, entering personal info on such sites is risky. Always verify HTTPS, which ensures secure, encrypted communication. Option D is better because it focuses on true cybersecurity measures."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "At higher IT awareness, you should know that colorfulness doesn’t indicate security. Hackers use attractive designs to steal info. In Sri Lanka, users accessing open portals must check HTTPS to encrypt data like passwords. Option D is better as it highlights the real protection method rather than visuals."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Visual appeal is misleading; a colorful website doesn’t mean it’s secure. Cybercriminals use attractive sites to deceive users. Sri Lankan students or professionals entering personal info need to check HTTPS for encryption. Option D is better because it directly ensures secure data transmission."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Malli, flashy colors are not a safety indicator. Even attractive websites can be malicious. In Sri Lanka, checking HTTPS before submitting personal info is crucial to encrypt data and prevent theft. Option D is better because it addresses real cybersecurity risks."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At an advanced level, website aesthetics are irrelevant for security. Hackers can create visually appealing sites to steal sensitive info. Sri Lankan users entering personal data should always verify HTTPS for encrypted communication. Option D is better because it emphasizes real data protection."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, colorfulness doesn’t equal safety. Hackers can design attractive sites to steal info. In Colombo or other areas, always check HTTPS for encryption before entering personal information. Option D is better because it focuses on protecting sensitive data, not site looks."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, flashy websites can be traps. Hackers create colorful but fake pages to steal personal info. In Sri Lanka, always look for HTTPS before submitting data. Option D is better as it emphasizes the real way to stay safe online."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, don’t trust a colorful website. Hackers use attractive designs to mislead users. Checking HTTPS ensures encryption, which protects your personal info. In Sri Lanka, this is important for online banking, university portals, and social media. Option D is better because it focuses on actual cybersecurity."
  },
  {
    "questionId": "Q3",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At an advanced level, visual appeal is irrelevant for security. Even flashy websites can be malicious. Sri Lankan users entering sensitive info must verify HTTPS for encrypted communication. Option D is better because it teaches real cybersecurity practices."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, just reading popups won’t make a website safe. Popups can be misleading or fake, trying to trick you into giving personal info. Imagine seeing a popup claiming to be your school portal in Colombo — it might be a phishing attempt. The right approach is to check HTTPS, which encrypts your data and ensures it reaches the real website securely."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, popups can be traps. Just reading them doesn’t guarantee safety. Hackers often use popups to steal information. For example, a popup claiming a bank login is required might actually be a phishing scam in Sri Lanka. Option D is better because checking HTTPS ensures encrypted communication, protecting your sensitive data."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, popups are often deceptive. Reading them carefully doesn’t make your data safe. Imagine a Colombo café where a fake school portal popup asks for login — hackers can steal it. The correct action is to verify HTTPS, which encrypts your connection and keeps your info secure. Option D is safer and practical."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Reading popups isn’t enough for safety. Popups can be fake attempts to collect your info. In Sri Lanka, students or professionals might see such popups on university or banking sites. Checking HTTPS is the real way to ensure secure, encrypted communication. Option D is better as it focuses on true cybersecurity measures."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, reading all popups doesn’t make a website safe. Hackers can create fake popups to steal information. Imagine a Colombo mall Wi-Fi site asking for your personal info — it could be dangerous. Checking HTTPS is the correct way to ensure your data is encrypted and secure. Option D is better for real protection."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, popups can mislead you. Just reading them carefully doesn’t protect your info. In Sri Lanka, hackers may create popups asking for banking or social media credentials. Option D is better because HTTPS ensures your data is encrypted and reaches the real website safely."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, reading popups won’t make your personal info safe. Hackers can use fake popups to trick users into revealing passwords or emails. In Colombo or other cities, always check HTTPS to encrypt your connection and protect sensitive information. Option D is better for actual cybersecurity."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, popups can be traps. Reading them won’t protect your data. Hackers create fake popups to steal info. Sri Lankan students or professionals using websites should always verify HTTPS. Option D is better because it focuses on real data encryption and cybersecurity."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, just reading popups won’t make a site safe. Popups can be phishing attempts to steal credentials. In Sri Lanka, public Wi-Fi or online portals may show fake popups asking for info. Option D is better because checking HTTPS ensures encrypted communication and real security."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT awareness shows that popups are often deceptive. Reading them carefully is not enough. Hackers can trick users into giving sensitive info. Sri Lankan users should focus on HTTPS for encryption and secure communication. Option D is better for protecting data properly."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, popups can be misleading, even when carefully read. Hackers use them to steal personal info. In Colombo, students or professionals accessing portals should check HTTPS. Option D ensures encryption and real security, which popups reading cannot guarantee."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, understanding popups as security checks is wrong. Hackers can craft deceptive popups to steal information. Sri Lankan users entering sensitive info online must verify HTTPS to ensure encrypted communication. Option D is better because it addresses real cybersecurity threats."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, reading popups won’t make the website safe. Hackers can use them to steal personal info. In Sri Lanka, students or shoppers using open networks should focus on HTTPS. Option D is better because it ensures data encryption and real security."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, popups can mislead even careful readers. Hackers create fake popups to steal information. Sri Lankan users should verify HTTPS to ensure encrypted communication. Option D is better because it protects sensitive data correctly."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, reading popups doesn’t protect your personal info. Hackers can use deceptive popups to steal credentials. Users in Colombo and across Sri Lanka should verify HTTPS for encryption. Option D is better because it focuses on real cybersecurity protection."
  },
  {
    "questionId": "Q3",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher level, understanding popups as safety checks is incorrect. Hackers can create fake popups to collect data. Sri Lankan users entering sensitive info online should verify HTTPS for encrypted and secure communication. Option D is better because it teaches actual cyber safety."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, a website loading fast does not mean it’s safe. Hackers can create fake websites that load quickly to trick you. Imagine quickly opening a Colombo school portal that looks fast but is fake — your login info could be stolen. The safe approach is to check HTTPS, which encrypts your data and ensures it reaches the real website securely."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, just because a website loads quickly doesn’t mean it’s trustworthy. Hackers can make fake sites fast and appealing. In Sri Lanka, if you enter personal data on a fast-looking but fake site, it could be stolen. Always check HTTPS for encryption and real protection. Option D is safer because it secures your data, not just speed."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, fast-loading websites may be attractive, but they can still be malicious. Imagine a Colombo café where you open a quickly loading university portal that’s fake — your login could be captured. The correct practice is to verify HTTPS, which encrypts your connection and protects sensitive info. Option D is better because it ensures real cybersecurity."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Speed alone does not equal safety. Hackers can create fast-loading websites that look legitimate. Sri Lankan students or professionals entering personal info on such sites risk theft of credentials. Always check for HTTPS to ensure encrypted communication. Option D is better because it addresses real cybersecurity protection."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, fast-loading websites are not always safe. Hackers can make fake sites load quickly to trick users. Imagine entering your school portal login in Colombo on a fast website — it could steal your info. Checking HTTPS ensures your data is encrypted. Option D is better because it focuses on real protection."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, speed doesn’t guarantee safety. Hackers can make fake websites load quickly. In Sri Lanka, entering personal info on such sites can be risky. Always verify HTTPS for secure, encrypted communication. Option D is better because it ensures real cybersecurity protection."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, a fast website may look good but can be malicious. Hackers can design quickly loading sites to capture sensitive information. In Colombo or other cities, always check HTTPS for encryption. Option D is better because it protects your data properly."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, fast-loading websites aren’t automatically safe. Hackers can create quickly loading fake sites to steal information. Sri Lankan users entering personal info should verify HTTPS for encrypted communication. Option D is better because it focuses on actual cybersecurity measures."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, a website loading fast doesn’t guarantee it’s secure. Hackers can make fake sites load quickly to deceive users. In Colombo, accessing a portal without HTTPS is risky even if it loads fast. Option D is better because HTTPS ensures encrypted, secure communication."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT awareness shows that speed is not safety. Hackers can create quickly loading fake sites to capture info. Sri Lankan students or professionals must verify HTTPS before entering sensitive data. Option D is better because it focuses on real cybersecurity protection."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, fast websites can be traps. Hackers design quickly loading fake portals to steal personal info. In Colombo, always check HTTPS to encrypt communication. Option D is safer because it addresses actual cybersecurity risks, not speed."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, website speed is irrelevant for security. Hackers can make fast-loading fake sites to steal data. Users entering sensitive info in Sri Lanka should always verify HTTPS to ensure encrypted, secure communication. Option D is better because it teaches actual cybersecurity."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, fast websites aren’t necessarily safe. Hackers can create quick-loading fake sites to trick users. Sri Lankan students using open portals should always check HTTPS for encryption. Option D is better because it focuses on protecting sensitive information."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, fast-loading websites can still be malicious. Hackers create quick fake portals to steal personal info. Sri Lankan users should always verify HTTPS before entering data. Option D is better because it ensures encryption and real cybersecurity protection."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, website speed is not a sign of security. Hackers design fast-loading fake sites to collect sensitive info. In Sri Lanka, always verify HTTPS for encryption. Option D is better because it focuses on real cybersecurity measures."
  },
  {
    "questionId": "Q3",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At an advanced level, fast-loading websites don’t indicate safety. Hackers can make them quickly to steal sensitive data. Sri Lankan users should verify HTTPS to ensure encrypted communication. Option D is better because it teaches actual cybersecurity best practices."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, downloading software from random websites is very risky. Hackers often hide viruses or malware in such files. Imagine downloading a game from an unknown site in Colombo — your laptop or phone could get infected, stealing passwords or bank info. The safe way is to use official app stores or the official website of the software to ensure it’s clean and secure."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, random websites may offer free software, but often they include viruses or spyware. For example, downloading a PDF converter from an unknown site in Sri Lanka could infect your device. Using official stores or the software’s official website is safer because it ensures authenticity and protects your data."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, random sites are dangerous for downloading software. Hackers can hide malware that steals personal info or damages your device. For instance, a Colombo student downloading an unknown app may risk banking credentials. Option B is better because official sources verify the software is safe and genuine."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Downloading from random websites is highly unsafe. Malware or trojans can be hidden in these files. Imagine a professional in Colombo downloading a random utility — it could compromise sensitive work data. Option B, using official app stores or websites, ensures you get authentic software and reduces risk of cyberattacks."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, random websites may look safe but can carry viruses or malware. Imagine downloading a game on your phone from an unknown site in Colombo — hackers could steal your personal info. Using official app stores or the software’s official website is safer because it protects your device and data."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, random sites often hide malware. If you download software from an unknown website in Sri Lanka, your laptop or phone could get infected. Official app stores or websites ensure the software is authentic and safe, protecting your personal info."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, downloading software from unknown websites is risky. Malware or viruses can steal sensitive information. For example, a Colombo university student could lose login credentials. Official app stores or websites verify the software, making it much safer."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, random websites may hide malware in software downloads. Imagine downloading an editing tool for work from an unknown site in Sri Lanka — your personal and professional info could be at risk. Official stores or websites ensure software authenticity and protect your data."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, even at higher IT awareness, random sites remain unsafe. Hackers embed malware to steal data or damage devices. Sri Lankan users should always download from official app stores or verified websites to ensure software safety."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT proficiency shows that random websites are untrustworthy. Malware or trojans can be hidden in such downloads. Colombo students and professionals should always use official sources to protect their devices and personal data."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, random websites may offer free software, but they are often malicious. Hackers can steal credentials or damage devices. Always use official stores or software websites for secure, verified downloads in Sri Lanka."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At an advanced level, you know that random sites can host malware. Downloading from such sources risks sensitive info and device security. Always rely on official app stores or websites for verified software, ensuring cybersecurity in Sri Lanka."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, random websites can be dangerous. Hackers hide malware in downloads. Sri Lankan users should download only from official stores or verified websites to protect devices and personal info."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, even if a website seems attractive, it could contain malware. Official app stores or websites are safer and ensure software authenticity. Sri Lankan users should avoid random downloads to protect their data."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, random websites are risky for downloading software. Malware or viruses can steal credentials. In Sri Lanka, always use official app stores or websites for verified, safe software downloads."
  },
  {
    "questionId": "Q4",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher level, random sites remain unsafe. Hackers can hide malware, risking personal and professional data. Always download software from official app stores or verified websites in Sri Lanka to ensure authenticity and safety."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, downloading software through social media links is dangerous. Hackers often share fake links on Facebook or WhatsApp in Sri Lanka, which can install malware or steal passwords. Just imagine clicking a link in a Colombo WhatsApp group claiming to have a free game, and it secretly steals your info. The safe way is to download from official app stores or the software’s official website."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, links on social media can look trustworthy but may hide malicious software. In Sri Lanka, hackers can share fake app download links on Facebook groups or Instagram. Clicking them may infect your device or steal personal info. Always use official app stores or verified websites to ensure safe downloads."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, social media links are risky for downloading software. Hackers post links that seem safe but contain malware. For example, a Colombo student might click a Facebook link to get an educational app and unknowingly install spyware. The correct approach is official app stores or verified websites for safe downloads."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Downloading software from social media links is unsafe. Hackers can disguise malicious apps as normal files. In Sri Lanka, professionals or students may be tempted by free apps in WhatsApp groups or Facebook pages, but this risks malware infections. Official stores or websites provide verified and safe software."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, social media links for software downloads can be traps. Hackers post fake links on Facebook or WhatsApp in Sri Lanka. Clicking these may install viruses or steal passwords. The safe way is to use official app stores or verified websites for downloading."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, social media links often look safe but may carry malware. In Sri Lanka, hackers share fake links in Facebook groups or Instagram. Clicking them could harm your device or steal personal info. Always download apps from official stores or verified websites."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, links on social media for software downloads are risky. Hackers post them to steal info or infect devices. For example, a Colombo university student could click a fake WhatsApp link and get malware. Always use official stores or verified websites for safe downloads."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, downloading apps through social media is unsafe. Hackers often post fake links on WhatsApp or Facebook pages in Sri Lanka, which can install malware or steal info. Official app stores or verified websites are the safe choice for authentic software."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, even with high IT awareness, social media links can be malicious. Hackers share fake app downloads on Facebook, Instagram, or WhatsApp in Sri Lanka. Downloading from these can compromise devices or data. Official stores or verified websites are always safer."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT proficiency doesn’t make social media links safe. Hackers in Sri Lanka post fake links that can install malware or steal credentials. Always rely on official stores or verified websites for secure downloads."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, social media links for software downloads remain dangerous. Hackers can disguise malicious apps as legitimate. Sri Lankan users should prefer official app stores or verified websites to protect devices and sensitive data."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, downloading software via social media links is unsafe. Hackers may post malicious files on WhatsApp, Facebook, or Instagram in Sri Lanka. Verified app stores or official websites ensure authentic and secure downloads."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, social media links can be traps. Hackers often post fake download links in WhatsApp or Facebook groups in Sri Lanka. Using official app stores or verified websites keeps devices and personal data safe."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, even if a social media link looks genuine, it may carry malware. In Sri Lanka, fake links on Facebook or Instagram could compromise your data. Official app stores or verified websites are the secure way to download software."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, links on social media for downloading apps are risky. Hackers use them to steal information or install malware. Sri Lankan students or professionals should always use official app stores or websites for safe downloads."
  },
  {
    "questionId": "Q4",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, downloading software via social media is unsafe. Hackers may post malicious files on Facebook, Instagram, or WhatsApp in Sri Lanka. Verified app stores or official websites ensure authentic, secure software downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, downloading software from friends via email can be risky. Even well-meaning friends’ devices might be infected, and they could unknowingly send malware. Imagine getting a math learning app from a friend in Colombo and it secretly contains a virus. The safer method is to download from official app stores or the software’s official website to ensure authenticity and security."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, even trusted friends can accidentally forward infected files through email. In Sri Lanka, receiving a file from a friend claiming to be safe might still contain malware. To stay safe, always download software from official stores or verified websites, which guarantees a secure and authentic copy."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, downloading software from a friend’s email is not fully safe. Their device might be compromised and unknowingly pass malware. For example, a Colombo student getting a learning app this way could infect their laptop. Option B is better because official app stores or websites verify software authenticity and security."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Downloading from friends via email may seem convenient, but it can be dangerous. Even trusted sources can unknowingly forward infected files. Professionals in Sri Lanka might receive useful apps that contain malware. Official stores or the software’s website ensure the download is authentic and safe."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, downloading software from a friend’s email is risky. Their device might be infected, so even a well-meaning file could contain malware. Imagine getting a drawing app from a Colombo friend — it could secretly harm your device. Always use official stores or verified websites for safe downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, friends can unknowingly send infected files via email. In Sri Lanka, even if you trust the sender, the software might contain malware. Official app stores or verified websites provide safe, authentic downloads, keeping your device and data protected."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, receiving software from a friend via email isn’t fully safe. Their computer might be infected and pass malware. Colombo students downloading apps this way risk their devices. Always prefer official app stores or verified websites for secure downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, even if the software comes from a friend via email, it could contain hidden malware. In Sri Lanka, professionals or students could unknowingly install harmful files. Official stores or verified websites ensure authentic, safe software downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, downloading software from friends’ emails is risky because their device could be infected. Even with high IT knowledge, malware can be unknowingly forwarded. Sri Lankan users should always use official app stores or verified websites to guarantee safety."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT awareness still does not make friends’ emails safe. Hackers may have infected their devices unknowingly. In Sri Lanka, downloading software via email may compromise your data. Always use official stores or verified websites for secure downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, friends’ emails can carry hidden malware even if they seem trustworthy. Colombo users downloading software this way risk device security. Official app stores or websites ensure verified and safe downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, receiving software via email from friends is unsafe. Their system could be compromised, passing malware unknowingly. Sri Lankan users should rely on official stores or the software’s website for safe and authentic downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, even if a friend sends software via email, it could contain malware. Sri Lankan students or general users risk their devices. Official app stores or verified websites are safer for secure downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, friends’ emails might carry hidden malware even if trustworthy. In Sri Lanka, downloading software this way could compromise personal data. Always use official app stores or verified websites for safety."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, even trusted friends may unknowingly send infected files via email. Sri Lankan users downloading software this way could risk malware. Official app stores or verified websites ensure authentic and safe downloads."
  },
  {
    "questionId": "Q4",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, receiving software via email from friends is still unsafe. Their system could unknowingly pass malware, risking data and device security in Sri Lanka. Official app stores or verified websites provide safe and verified downloads."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, a browser cookie is not a virus. Cookies are small files stored by websites to remember your preferences, like login details or language. Imagine visiting a Sri Lankan news website — cookies remember your choice of Sinhala or English. Viruses, on the other hand, are harmful programs that can steal data or damage your device. Cookies are helpful, not dangerous, when used properly."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, cookies are not viruses. They store information like login sessions or shopping cart items. For example, visiting a Colombo e-commerce site, cookies remember what items you viewed. Unlike viruses, cookies don’t harm your device but help websites function better."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, cookies are tiny files that store browsing info like preferences or login status. Visiting a Sri Lankan university portal, cookies keep you logged in. They are not viruses; viruses are harmful programs that can steal data or damage devices. Option A is correct because cookies are safe and useful."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Cookies are not viruses. They are small data files stored by websites to enhance your browsing experience. For instance, a Colombo professional logging into an online banking portal has their preferences stored by cookies. Viruses are malicious programs; cookies, when used safely, are helpful."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, browser cookies are not viruses. They are small files that help websites remember things like your language or login. For example, a Colombo news site remembers your preferred language with cookies. Viruses are harmful, but cookies are safe and useful for browsing."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, cookies are not viruses. They save information like your login or preferences. For instance, a Colombo online store remembers what items you added to the cart. Unlike viruses, cookies are safe and improve your browsing experience."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, cookies are tiny files stored by websites to remember preferences, login sessions, or items in a cart. Visiting a Colombo site, cookies help you stay logged in. They are not viruses; viruses harm devices, while cookies improve browsing convenience."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, browser cookies are not viruses. They are small data files that help websites remember your choices, like login info or preferred language. Viruses damage devices; cookies, if managed properly, enhance your browsing experience safely."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, cookies store browsing data like login sessions and preferences. They are not viruses, which are harmful software. For example, a Colombo user visiting an e-learning portal benefits from cookies keeping them logged in. Option A is correct because cookies are useful, not harmful."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT proficiency shows that cookies are safe small files storing browsing info, unlike viruses which are harmful. In Sri Lanka, a student visiting an online tuition platform uses cookies for session management. Cookies enhance convenience and security if handled properly."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, cookies are small files that store preferences and session info. They do not damage devices like viruses. Colombo users benefit from cookies on e-commerce and educational sites. Option A is correct; cookies are safe tools for enhanced browsing."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Cookies are not viruses; they store data like login info and site preferences. Professionals in Colombo visiting online portals use cookies for convenience. Viruses are harmful programs, while cookies improve usability and session management securely."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, cookies store browsing data like login sessions and preferences. They are safe and not viruses. Visiting a Sri Lankan e-commerce site, cookies help remember your cart or language. Option A is correct because cookies enhance browsing, unlike viruses."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, cookies are tiny files storing your browsing preferences and login info. They are not viruses, which harm devices. Colombo users benefit from cookies on shopping or education sites. Option A is correct and safe."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, cookies are small data files that remember login sessions, site preferences, and cart items. They are not viruses. In Sri Lanka, cookies improve browsing convenience safely on e-commerce or educational sites."
  },
  {
    "questionId": "Q5",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher level, cookies are small files storing preferences and session data. They are safe and help websites function better. Professionals in Colombo use cookies for convenience and efficiency. Option A is correct; cookies are not viruses."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, a browser cookie is not an image. Cookies are small files that store information about your browsing, like login details or site preferences. Imagine visiting a Colombo e-commerce website — cookies remember what you added to your cart. Images are just pictures, while cookies help websites remember you and make your browsing easier and faster."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, cookies are not images. They are tiny files storing information like your login session or preferences on a site. For example, a Colombo student visiting an online tuition website will have cookies remembering their last login. Images just show content visually; cookies store useful data for better browsing."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, a cookie is not an image. Cookies store small bits of data, like your language preference or login details, to improve your experience. Visiting a Sri Lankan news website, cookies remember your preferred language. Images are just pictures, but cookies help the site remember you."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Cookies are not images; they are small data files stored by websites to remember your preferences, login details, or other browsing information. A Colombo professional visiting an online banking portal benefits from cookies remembering their session, whereas images only display content without storing data."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, cookies are not pictures. They are small files that save your browsing preferences, like login info or language. For example, a Colombo news site uses cookies to remember if you prefer Sinhala or English. Images only show visuals, but cookies help websites remember you."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, browser cookies are not images. They store data like login sessions or cart items. Visiting a Colombo e-commerce website, cookies help remember what you added to your cart. Images just display content; cookies save useful browsing information."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, cookies are not images. They are tiny files storing info like preferences or login status. Visiting a Colombo university portal, cookies keep you logged in. Images show content visually, but cookies help websites remember and serve you better."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, cookies are small files that remember your browsing data, like login info or language preferences. They are not images. A professional in Colombo benefits from cookies keeping sessions active on online portals. Images just display content without storing useful data."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, cookies are not images; they store useful browsing information like login sessions or preferences. A Colombo user visiting an e-learning portal benefits from cookies to stay logged in. Images only display visuals and do not store such data."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even at a high IT proficiency, cookies are not images. They are tiny files storing session info, preferences, or cart items. A Colombo student using an online tuition site benefits from cookies, whereas images only show content."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, cookies are small files storing browsing data, not images. For example, a Colombo professional visiting an e-commerce site has cookies remembering login and cart items. Images only display content visually, cookies enhance user experience and convenience."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Cookies are not images; they store small pieces of data like login info, preferences, or session details. Colombo professionals visiting online portals benefit from cookies. Images display visuals but do not store any useful information for browsing."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, cookies are not pictures. They store browsing info like login sessions and preferences. Visiting a Colombo e-commerce site, cookies remember your choices. Images just show content, but cookies help websites serve you better."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, cookies are small files storing your browsing data, like login info or preferences. They are not images. In Colombo, online shopping or learning platforms use cookies to remember users, enhancing convenience and user experience."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, cookies are tiny files storing session data, preferences, or login info. They are not images. Colombo university or office users benefit from cookies keeping sessions active and preferences saved. Images just display visuals without storing data."
  },
  {
    "questionId": "Q5",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher level, cookies are small files storing browsing data like session info or preferences. They are not images. Professionals in Colombo benefit from cookies keeping accounts logged in and sites personalized. Images do not store such data."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, a browser cookie is not a popup. Popups are windows that appear on your screen, often to advertise or alert you, while cookies are small files storing information like login details or preferences. Imagine visiting a Colombo online store: a popup may show a discount, but a cookie remembers what items you added to your cart for next time. Cookies help websites work smoothly and remember your choices."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, cookies are not popups. Popups are windows that appear while browsing, often for ads, but cookies store small files with information like your login session or preferences. For instance, a Colombo student visiting an online tuition website will have cookies keeping them logged in, while popups just show messages."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, browser cookies are tiny files storing browsing data like session info or site preferences, not popups. Visiting a Sri Lankan news website, popups may appear for subscriptions, but cookies remember your language preference or login. Cookies help the website remember you and improve browsing convenience."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Cookies are not popups. Popups are windows that appear for alerts or advertisements, while cookies store browsing data like login info or preferences. Colombo professionals benefit from cookies remembering session details on portals, whereas popups are just temporary visual messages."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, cookies are not popups. Popups are windows that appear while visiting sites, often for ads or notifications, but cookies are small files that remember your login info or preferences. Visiting a Colombo e-commerce website, cookies help remember your cart while popups just show messages temporarily."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, browser cookies are tiny files storing your browsing data like login sessions or preferences, not popups. For example, visiting a Colombo online store, a popup may advertise a discount, but cookies remember the items in your cart for the next visit."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, cookies are small files storing session info, preferences, or login details. Popups are just windows showing messages or ads. Colombo university portals use cookies to remember your login and preferences, improving browsing, while popups are temporary and do not store data."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, cookies are small files storing your browsing data like login info or site preferences, not popups. A Colombo professional visiting an online portal benefits from cookies remembering their session. Popups only display temporary messages or ads and do not save any useful data."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, cookies are not popups. Cookies are tiny files that store useful browsing info like session details or preferences, while popups are temporary windows showing alerts or advertisements. Colombo users benefit from cookies keeping sessions active and preferences saved."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even at high IT knowledge, cookies are not popups. Cookies store small bits of data for session management or preferences. Visiting a Colombo e-learning site, cookies remember your login, whereas popups just appear for temporary notifications or ads."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, cookies are small files storing data like login info, site preferences, and sessions. They are not popups, which are temporary windows for alerts or ads. Colombo users benefit from cookies keeping websites personalized and sessions active."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a degree level, cookies are small files storing preferences, login info, and session data. They are not popups. Professionals in Colombo benefit from cookies keeping sessions active and personalizing sites. Popups only display temporary messages or advertisements."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, cookies are not popups. They store browsing info like login sessions and preferences. Colombo users visiting e-commerce sites benefit from cookies remembering their choices, while popups only show temporary messages or ads."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, cookies are tiny files storing your session info and site preferences. They are not popups, which are temporary alert windows. Colombo students or office users benefit from cookies keeping sessions active and websites personalized."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, cookies store browsing data like login sessions and preferences. They are not popups, which are temporary windows for alerts or ads. Colombo users benefit from cookies keeping sessions and preferences saved, improving browsing experience."
  },
  {
    "questionId": "Q5",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher level, cookies are small files storing login info, preferences, and session data. They are not popups. Professionals in Colombo visiting online portals benefit from cookies keeping sessions active and personalizing their browsing experience. Popups only display temporary information."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, clicking links quickly without checking is very risky. Cybercriminals can disguise malicious links to steal your personal info. Imagine you get a link on WhatsApp claiming to show cricket scores in Colombo; clicking immediately could install malware or lead to phishing. Always hover to check the URL first to make sure it’s legitimate and safe."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, clicking links hastily is dangerous. Even familiar sites can be faked by attackers. For example, a Colombo student getting a link about online tuition may end up on a fake page stealing login info. Hover over the link to verify it before clicking to protect yourself."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, clicking links quickly without verification can lead to malware or phishing. Imagine getting a Colombo e-commerce site link via email claiming discounts; clicking without checking could compromise your account. Hovering over the link shows the actual URL, which helps avoid scams."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Clicking links quickly without checking is unsafe. Even trusted-looking sites can be malicious. For example, a Colombo professional receiving an email about online banking could be tricked. Always hover over links to preview URLs and verify legitimacy to avoid phishing and malware."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, clicking a link quickly is risky. Bad actors can disguise harmful links to steal personal info. Imagine a Colombo girl receiving a WhatsApp link claiming free exam tips; clicking fast could install malware. Hover to check the URL first to stay safe."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, clicking links immediately can be dangerous. Fake websites can steal login info. For example, a Colombo student getting an online tuition link might end up on a phishing site. Always hover over links to verify before clicking."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, clicking a link quickly without checking can expose you to malware or phishing attacks. Imagine a Colombo university portal link sent via email being fake; you could lose your login details. Hover over links to see the actual URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, clicking links quickly is unsafe. Malicious websites can look real. For example, a Colombo professional receiving an email claiming updates to an online portal could be tricked. Hover over links to verify the actual URL before clicking to stay secure."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, even with IT knowledge, clicking links quickly is dangerous. Malicious actors can disguise URLs. Colombo users receiving a banking link must hover first to see the real URL to prevent phishing and malware attacks."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT proficiency does not justify clicking links without checking. Attackers can create convincing fake links. Colombo students visiting online tuition sites must hover over links to verify before clicking to protect credentials."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, clicking links hastily can compromise security. Malicious actors often use phishing URLs. Colombo e-commerce or banking site users should hover first to see the true URL before clicking to prevent scams."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, clicking links immediately without verification is unsafe. Even legitimate-looking links can be fake. Colombo professionals should hover to preview the URL and ensure authenticity before accessing to prevent phishing or malware."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, clicking links quickly is dangerous. Attackers can disguise URLs. Colombo students or general users should hover to preview links first to avoid malware or phishing attacks."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, even with IT awareness, clicking links without checking can lead to phishing or malware. Colombo users should hover over the link to see the actual URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, clicking links hastily can compromise your data. Attackers disguise malicious URLs. Colombo university users should hover over links to preview and confirm authenticity before clicking."
  },
  {
    "questionId": "Q6",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, clicking links immediately is unsafe. Malicious actors can create convincing fake URLs. Colombo professionals should always hover to preview the actual link and ensure security before accessing."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, asking a friend to try a link first is not very safe. Your friend might also not notice a disguised phishing link. Imagine receiving a link about online tuition in Colombo; even your friend could get tricked. The safest way is to hover over the link to see the real URL yourself before clicking."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, relying on a friend to check links can be risky. Even trusted friends may not recognize malicious links. For example, a Colombo student might send a link about study materials, but it could be a phishing page. Hovering over links yourself is safer and ensures the URL is genuine."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, asking a friend to verify a link is not reliable. Friends might also be unaware of phishing or malware threats. Visiting a Colombo e-commerce site, a friend might think the link is safe, but hovering over it yourself ensures you see the real URL and avoid scams."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Relying on a friend to test a link is not secure. Even trusted friends can be deceived by fake websites. Colombo professionals should hover over links themselves to verify the actual URL before clicking, ensuring safe browsing and avoiding phishing."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, asking friends to click a link first is risky. They might not spot a fake link either. For example, a Colombo girl could receive a WhatsApp link about free exam tips; even a friend could get tricked. Hover over the link yourself to verify safety."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, depending on friends to check links isn’t safe. They might unknowingly click malicious links. Colombo students should hover over links themselves to confirm the real URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, asking a friend to verify a link is not safe. They may also fall for phishing. Colombo university users should hover over links to check the actual URL, protecting their login and personal data."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, relying on friends to test a link can be unsafe. Even trusted friends may not detect fake URLs. Colombo professionals should hover over the link themselves to see the real URL and ensure security before clicking."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, asking a friend to try a link first is not reliable. Even people with good IT knowledge can be deceived by phishing links. Colombo users should hover over links themselves to verify authenticity before clicking."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT proficiency does not mean you should depend on friends to check links. Malicious actors can trick anyone. Colombo students must hover over links to see the real URL, ensuring safe browsing."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, even experienced users shouldn’t rely on others to verify links. Friends might miss phishing URLs. Colombo e-commerce or banking users should hover over the link themselves to check the real destination and avoid risks."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals should not depend on others to test links. Even IT-savvy colleagues can be tricked. Colombo professionals must hover over links to preview the URL themselves to prevent phishing and malware attacks."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, asking friends to check links is risky. They might also not notice malicious URLs. Colombo users should hover over links themselves to verify the real URL and stay safe online."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, even with IT knowledge, relying on friends to test links can be dangerous. Colombo students should hover over the link themselves to ensure it’s safe before clicking."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, depending on friends to verify a link is not secure. They could fall for phishing too. Colombo university users should hover over links themselves to preview the actual URL and protect their accounts."
  },
  {
    "questionId": "Q6",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, relying on friends to check links is unsafe. Colombo professionals should hover over links themselves to verify the real URL, preventing phishing and malware threats."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, taking a screenshot of a link does not make it safe. Screenshots only capture the image of the link but do not reveal if it’s a phishing or malicious URL. Imagine getting a link on WhatsApp about Colombo tuition materials; a screenshot won’t show the real destination. Hovering over the link to preview the actual URL is the safest way."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, screenshots don’t verify links. They only capture what is visible on your screen. A Colombo student may screenshot an online tuition link, but it might still lead to a phishing page. Always hover over the link to see the real URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, screenshots can’t protect you from malicious links. They just save the image, not the actual URL. Colombo e-commerce users may screenshot a link claiming discounts, but it could still be harmful. Hover over links to check the real URL and stay safe."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Taking a screenshot of a link does not make it safe. Even Colombo professionals could be misled by a screenshot of a phishing link. Hovering over the link to preview the actual URL ensures you are visiting a legitimate site."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, screenshots do not make links safe. They just capture an image but do not show where the link really goes. A Colombo girl receiving a WhatsApp link could still be at risk. Hover over links to check the actual URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, screenshots don’t help in verifying links. Even if you capture it, the URL could be malicious. Colombo students should hover over links to see the real destination to protect their login and personal info."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, screenshots only show the appearance of a link. They don’t reveal whether it’s safe. Colombo university users should hover over links themselves to check the actual URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, taking screenshots of links is not a safe practice. It does not verify the URL. Colombo professionals should always hover over links to preview the actual destination and avoid phishing or malware."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, even with IT knowledge, screenshots don’t verify links. They only save what you see. Colombo users should hover over the link themselves to see the real URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT proficiency doesn’t make screenshots safe. Screenshots capture an image but not the actual URL. Colombo students should hover over links to check the real destination."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, screenshots cannot confirm the safety of links. They only display an image. Colombo professionals visiting e-commerce or banking portals should hover over links to verify URLs and avoid phishing."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, screenshots do not guarantee link safety. Colombo professionals must hover over links to check the actual URL before accessing to prevent malware or phishing attacks."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, screenshots don’t make links safe. They just capture what is visible but cannot verify the real URL. Colombo users should hover to preview the link before clicking."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, screenshots are not a safe method to check links. Colombo students should hover over links themselves to see the actual URL to avoid phishing or malware."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, screenshots only capture the appearance of a link. They don’t verify its safety. Colombo university users should hover over links to check the real URL before clicking."
  },
  {
    "questionId": "Q6",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, taking screenshots does not confirm the safety of links. Colombo professionals must hover over the actual link themselves to ensure it is legitimate and avoid phishing or malware risks."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, just because a pop-up closes automatically doesn’t mean it’s safe. Pop-ups can trick you into entering personal info even if they disappear quickly. Imagine you are browsing a Colombo e-learning site and a pop-up asks for your login; it might be phishing. Always be careful and never enter personal details in unexpected pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, the fact that a pop-up closes by itself is not a safety feature. Pop-ups can still be malicious and steal your personal info. For example, a Colombo student might see a pop-up asking for exam results credentials, but it could be a phishing attempt. Avoid entering personal info in such forms."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, pop-ups closing automatically is irrelevant to safety. They can still capture sensitive info. Colombo users may encounter pop-ups on shopping or tuition sites asking for personal data; closing quickly doesn’t make them safe. Only enter info on verified websites."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even if a pop-up closes on its own, it doesn’t guarantee safety. Colombo professionals might see pop-ups on work-related portals asking for credentials. Pop-ups can be phishing attempts, so never enter personal info unless you are sure about the source."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, a pop-up closing automatically doesn’t make it safe. Pop-ups can trick you into giving personal info. For instance, a Colombo girl browsing a learning site may get a pop-up asking for her password; it could be fake. Always avoid entering details into pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, pop-ups closing themselves does not mean they are secure. Colombo students could encounter pop-ups asking for sensitive info on tuition or exam websites. They might look harmless, but they could be phishing attempts. Don’t enter personal information."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, just because a pop-up closes automatically doesn’t make it safe. Colombo university users might see pop-ups asking for login details or personal info; it could be phishing. Only enter info on trusted and verified websites."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, pop-ups closing by themselves is not a sign of safety. Colombo professionals might see pop-ups on portals asking for sensitive info; these can be phishing attacks. Always confirm the website before entering personal details."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, automatic closing of a pop-up does not ensure it’s safe. Malicious pop-ups can steal credentials quickly. Colombo users should only enter personal info on verified sites, not in pop-ups that appear unexpectedly."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with IT knowledge, a pop-up closing on its own is not a security measure. Colombo students might get phishing pop-ups on tuition sites. Only trust verified links and pages for entering personal information."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, closing automatically does not make a pop-up safe. Colombo professionals using online banking or shopping sites may see pop-ups that are phishing attempts. Always avoid entering personal data into pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, a pop-up closing automatically is not a sign of security. Colombo professionals should be careful of pop-ups requesting login or personal info, as these could be phishing attacks. Enter data only on verified websites."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, a pop-up closing itself doesn’t guarantee safety. Colombo students or users could be tricked into entering personal info. Always confirm the website and avoid entering sensitive details in unexpected pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, automatic pop-up closure is not a safety measure. Colombo students should never enter personal info into pop-ups, as they can be used for phishing even if they disappear quickly."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, pop-ups closing by themselves do not make them safe. Colombo university users may see pop-ups asking for sensitive info that are phishing attempts. Enter data only on verified, trusted sites."
  },
  {
    "questionId": "Q7",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, pop-ups closing automatically do not indicate security. Colombo professionals should avoid entering personal info in pop-ups and only use verified websites for sensitive data."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, pop-ups can do more than just send spam. While spam is annoying, the bigger danger is that they can steal your personal info for phishing or scams. Imagine receiving a pop-up on a Colombo tuition site asking for your password; it might also email you spam and steal credentials. Always avoid entering details in pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, yes pop-ups can send spam, but that’s not the main risk. Colombo students might see pop-ups asking for exam results credentials; entering info could lead to phishing or malware. Always check and avoid entering sensitive data into pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, pop-ups sending spam is minor compared to stealing info. Colombo e-commerce users may see pop-ups claiming discounts; if you enter personal info, attackers can misuse it. Always enter data only on verified sites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Spam is not the main threat. Colombo professionals may receive pop-ups requesting login info; entering data could lead to phishing. Avoid pop-ups and only use trusted sites for personal information."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, pop-ups can send spam, but the bigger risk is stealing personal info. A Colombo girl browsing learning sites might see a pop-up asking for her password; it could steal data and send spam. Avoid entering info in pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, sending spam is minor; pop-ups can steal info too. Colombo students encountering pop-ups asking for credentials should not enter data, even if it looks harmless."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, pop-ups sending spam is less harmful than stealing info. Colombo university users should avoid entering personal info in pop-ups; only use trusted websites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, pop-ups may send spam, but the real risk is phishing. Colombo professionals encountering pop-ups requesting login info should avoid entering personal data and stick to verified sites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, spam is minor; the real danger is pop-ups stealing credentials. Colombo users should avoid entering data in pop-ups and only trust verified sites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with IT knowledge, pop-ups sending spam are less harmful than phishing attacks. Colombo students should enter personal info only on trusted, verified sites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, spam from pop-ups is not the main risk; personal info can be stolen. Colombo professionals should avoid entering credentials or sensitive info into pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals must understand that spam is minor compared to phishing or data theft. Colombo professionals encountering pop-ups should only enter info on verified websites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, spam from pop-ups is less dangerous than stealing info. Colombo students should avoid entering personal data in pop-ups; only use trusted sites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, sending spam is minor; pop-ups can also steal info. Colombo students should never enter personal info into pop-ups unless sure of the site’s legitimacy."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, pop-ups sending spam is less concerning than stealing info. Colombo university users should avoid entering personal info in pop-ups and only use trusted websites."
  },
  {
    "questionId": "Q7",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, pop-ups sending spam is minor; the main risk is phishing. Colombo professionals should enter info only on verified sites and avoid pop-ups requesting sensitive data."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, the amount of data a pop-up uses is not the main concern. The real risk is that pop-ups can trick you into giving personal info or passwords. Imagine browsing a Colombo tuition website; a pop-up might ask for your login and steal it even if it uses little data. Always avoid entering info into pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, worrying about data usage is not the main issue. Pop-ups can be malicious and steal personal info. For example, a Colombo student may get a pop-up claiming free exam tips; entering info could lead to phishing. Focus on safety, not data consumption."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, pop-ups using more data doesn’t make them unsafe or safe. The danger is that they can collect passwords or personal info. Colombo e-commerce users should avoid entering details in pop-ups and only use verified websites."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even if a pop-up uses a lot of data, the main threat is stealing personal info. Colombo professionals might see pop-ups asking for credentials; data usage is irrelevant. Only enter info on trusted, verified sites."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, the concern is not how much data pop-ups use. The bigger danger is giving personal info. For example, a Colombo girl could see a pop-up asking for passwords; it could be phishing. Avoid entering details in pop-ups."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, pop-ups using too much data is not the main risk. Colombo students should focus on avoiding entering personal info in pop-ups, as phishing and scams are the real danger."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, pop-ups consuming more data doesn’t make them safe or dangerous. The risk is stealing info. Colombo university users should avoid entering personal info into pop-ups and stick to verified sites."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, data usage is not the main issue with pop-ups. Colombo professionals should be aware that pop-ups can request personal info and may be phishing attempts. Only use verified websites for sensitive info."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, the amount of data a pop-up uses is not relevant to its safety. Colombo users should focus on avoiding entering sensitive information in pop-ups, which could be phishing or malicious."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with IT knowledge, pop-ups using more data doesn’t indicate safety. Colombo students should avoid entering personal information in pop-ups and rely only on trusted sites."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, data consumption of a pop-up is irrelevant. Colombo professionals should focus on verifying the website before entering any personal or login info to avoid phishing."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, pop-up data usage does not determine safety. Colombo professionals should avoid entering credentials or personal info in pop-ups and only use verified websites."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, how much data a pop-up uses is not important. Colombo students should focus on avoiding giving personal info in pop-ups, which could be phishing attacks."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, data usage of pop-ups is not the concern. Colombo students should avoid entering personal info into pop-ups to stay safe from phishing or scams."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, whether pop-ups use a lot of data or not, the risk is personal info theft. Colombo university users should avoid pop-ups asking for login credentials and only trust verified sites."
  },
  {
    "questionId": "Q7",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, pop-up data usage is not a safety indicator. Colombo professionals should never enter sensitive information into pop-ups and always verify the website first."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, using a VPN is not for downloading more apps. The main purpose is to protect your data when using public Wi-Fi. Imagine sitting in Colombo’s bus stand Wi-Fi; if you download apps without encryption, hackers could intercept your personal info. VPN encrypts your internet traffic to keep you safe online."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, a VPN doesn’t help you download apps faster or more. Its real use is securing your data on public networks. Colombo students using café Wi-Fi could be at risk if they don’t encrypt their traffic. VPN keeps your online activities private and safe."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, VPNs are not for downloading apps. Their main function is to protect your connection from hackers. Colombo users on public Wi-Fi may expose banking or login info if not using a VPN. Always use a VPN to encrypt traffic and protect sensitive data."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a higher education level, a VPN’s purpose is not app downloading. Colombo professionals using public networks should use VPNs to encrypt traffic, preventing eavesdropping and protecting sensitive information such as emails, banking, or work files."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, VPNs are not for downloading more apps. The real benefit is safety on public Wi-Fi. Colombo girls using café Wi-Fi should encrypt their internet to prevent hackers from stealing personal data."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, VPNs do not give you extra apps. Their main use is to secure your data when browsing public networks. Colombo students should use a VPN to keep passwords and personal info safe from hackers."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, VPNs are not meant for downloading more apps. Colombo university users should use VPNs to encrypt their internet traffic on public networks to prevent hackers from stealing private information."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, VPNs don’t help with more app downloads. Their main purpose is to protect your connection on public Wi-Fi. Colombo professionals should always use a VPN to secure emails, banking, and work-related data from hackers."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, VPNs don’t increase app downloads. Their core function is encrypting your internet traffic. Colombo users on public networks should use VPNs to secure sensitive info like banking or social accounts."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT proficiency doesn’t change this: VPNs don’t help download apps. Their main goal is encryption. Colombo students using public Wi-Fi should secure their data with a VPN to avoid hacking or eavesdropping."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, VPNs are not for getting more apps. They encrypt your traffic to protect your credentials and private info. Colombo professionals on public networks should always use a VPN to stay secure online."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, VPNs are not for downloading apps. Colombo professionals must use VPNs on public networks to encrypt sensitive data, emails, banking info, and work documents from potential hackers."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, VPNs are not for more apps. They encrypt internet traffic on public networks. Colombo students should use VPNs to secure their passwords, emails, and personal information from hackers."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, VPNs don’t help with app downloads. Colombo students using public Wi-Fi should use VPNs to encrypt traffic and prevent hackers from accessing private info like social media or banking passwords."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, VPNs are not for getting more apps. Their main purpose is to encrypt internet traffic. Colombo university users should use VPNs on public networks to protect sensitive data from eavesdropping."
  },
  {
    "questionId": "Q8",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, VPNs don’t affect app downloads. Colombo professionals should use VPNs to encrypt sensitive communications and browsing activity on public networks, keeping personal and work information safe."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, using a VPN just to access blocked sites is not its main purpose. The main benefit is to protect your data on public Wi-Fi. Imagine using Colombo café Wi-Fi; even if you want to access a blocked site, without encryption, hackers can steal your passwords or personal info. VPN keeps your connection safe."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, a VPN can help access some blocked sites, but that’s not why you should use it. Colombo students on public networks need VPNs mainly to secure personal data like social media or banking credentials from hackers."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, VPNs are not primarily for bypassing blocked sites. Their main purpose is encryption. Colombo users on public Wi-Fi risk having their emails, passwords, or banking info intercepted if they don’t use VPNs."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even for degree-level users, VPNs are not just for accessing blocked sites. Colombo professionals on public networks should use VPNs mainly to encrypt traffic and protect sensitive information from hackers and eavesdroppers."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, using a VPN to unblock sites is not the main reason. Colombo girls using public Wi-Fi should focus on protecting passwords, emails, and personal info from hackers by encrypting their internet traffic."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, accessing blocked sites is not the main purpose of a VPN. Colombo students should use VPNs to secure their personal data when browsing on public networks."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, VPNs are mainly for protecting internet traffic, not for accessing blocked sites. Colombo university users should use VPNs to prevent hackers from stealing sensitive information while using public Wi-Fi."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, while a VPN can unblock sites, its main purpose is encrypting data on public networks. Colombo professionals should use VPNs to secure emails, banking info, and work files from potential eavesdroppers."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, a VPN’s main purpose is encryption, not bypassing blocked sites. Colombo users on public Wi-Fi should prioritize securing sensitive data like banking and personal info."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT knowledge does not change the fact: VPNs are primarily for security, not for accessing blocked websites. Colombo students must use VPNs to encrypt their data and protect privacy on public networks."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, accessing blocked sites is secondary. VPNs encrypt your traffic to prevent hackers from stealing sensitive information. Colombo professionals using public networks should use VPNs mainly for security."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals should remember VPNs are not primarily for bypassing restrictions. Colombo professionals on public Wi-Fi should focus on encrypting traffic to secure work, banking, and personal information."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, VPNs are not mainly for unblocking sites. Colombo students should use VPNs to protect personal info, passwords, and online activity on public networks."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, VPNs are meant to secure your internet traffic, not just to access blocked sites. Colombo students on public Wi-Fi should focus on encrypting data to avoid hackers."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, while VPNs can help with blocked sites, their main purpose is encryption. Colombo university users should prioritize securing sensitive data when using public networks."
  },
  {
    "questionId": "Q8",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a higher education level, VPNs are primarily for protecting data. Colombo professionals should use VPNs on public Wi-Fi to encrypt emails, banking, and work-related information, not just for accessing blocked sites."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, VPNs do not make browsing faster; in fact, sometimes they can slow it down. The main purpose is to secure your connection, especially on public Wi-Fi. Imagine using Colombo café Wi-Fi; without a VPN, hackers could intercept your personal info. Using a VPN encrypts your traffic and keeps you safe online."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, VPNs won’t speed up your browsing. Their real function is to protect your personal data when using public networks. Colombo students using Wi-Fi in libraries or cafés should use a VPN to prevent hackers from stealing login credentials or private messages."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, VPNs are not for faster browsing; they are for security. Colombo users on public Wi-Fi may risk exposing banking info or social accounts if they don’t use VPNs. Always encrypt traffic to stay safe."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a degree level, VPNs do not make your connection faster. Colombo professionals on public Wi-Fi should use VPNs to encrypt sensitive data like emails, banking info, and work files, keeping hackers away."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, VPNs don’t make browsing faster; their main use is safety. Colombo girls using café Wi-Fi should encrypt their internet connection to protect passwords, messages, and personal info from hackers."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, VPNs do not increase browsing speed. Colombo students using public Wi-Fi should use VPNs to encrypt traffic and prevent hackers from accessing personal information or social media accounts."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, VPNs are not designed to make browsing faster. Colombo university users should use VPNs to protect sensitive info and avoid exposing private data on public networks."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, VPNs won’t speed up your connection. Colombo professionals should use VPNs to encrypt traffic on public networks, keeping emails, banking info, and work documents safe from hackers."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, VPNs do not improve browsing speed; sometimes they slow it down. Their primary purpose is to encrypt traffic, ensuring sensitive data like passwords or banking info on public networks is secure."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with high IT knowledge, VPNs are for security, not speed. Colombo students using public Wi-Fi should use VPNs to protect login credentials and personal data from hackers."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, VPNs are not for faster browsing. Their main function is to encrypt internet traffic. Colombo professionals on public networks should use VPNs to prevent sensitive information like work documents and banking details from being intercepted."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, VPNs don’t make connections faster. Colombo professionals must prioritize encrypting sensitive communications and browsing data on public networks to stay safe from hackers."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, VPNs don’t increase browsing speed. Colombo students should focus on securing their internet traffic on public networks to protect personal info like passwords, emails, and social media accounts."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, VPNs are not for faster browsing. Colombo students should use VPNs to encrypt their online activity on public Wi-Fi, keeping private information safe from hackers."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, VPNs do not make browsing faster. Colombo university users should focus on encrypting sensitive data with VPNs to prevent unauthorized access on public networks."
  },
  {
    "questionId": "Q8",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals should understand that VPNs are not for speed. Colombo professionals must use VPNs to encrypt emails, banking, and work-related data on public networks to avoid hackers and eavesdropping."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, a zero-day vulnerability is not a theme update. It’s a serious security flaw in a browser that hackers can exploit before developers fix it. Imagine using a Colombo school computer; if a hacker knows this flaw, they could steal your passwords or personal info. Themes may change appearance, but they don’t create security risks like zero-day vulnerabilities."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, zero-day vulnerabilities are not about themes or looks. They are security flaws unknown to developers. In Colombo, a student using public Wi-Fi could have their data stolen if hackers exploit a zero-day in the browser. Always update browsers regularly to reduce this risk."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, thinking a zero-day is a theme update is wrong. These vulnerabilities are security gaps that hackers can exploit before a patch is released. Colombo office workers should update browsers and enable automatic security updates to prevent breaches."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a degree level, zero-day vulnerabilities are not themes. They are critical security flaws unknown to developers. Professionals in Colombo must patch browsers immediately and avoid visiting unsafe sites to mitigate exploitation risks."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, zero-day vulnerabilities are not about changing themes. They are hidden security flaws that hackers can use to steal passwords or personal info. Colombo girls using public networks must update browsers to stay safe."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, a zero-day is not a new theme. It’s a serious browser security flaw unknown to developers. Colombo students should keep browsers updated to prevent hackers from exploiting such vulnerabilities."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, zero-day vulnerabilities are not themes. They are security gaps hackers exploit before patches exist. Colombo university users should update browsers and avoid suspicious links to protect sensitive information."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, even at higher education, zero-day vulnerabilities are not themes. They are undiscovered security flaws that hackers exploit. Professionals in Colombo should apply patches immediately and follow safe browsing habits."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, zero-day vulnerabilities are not new themes. They are security flaws unknown to developers that can be exploited by hackers. Colombo users should keep browsers updated and avoid unsafe sites to prevent breaches."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with high IT knowledge, zero-day vulnerabilities are not themes. They are serious security flaws unknown to developers, and hackers can exploit them before patches. Colombo students must update browsers regularly."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, zero-day vulnerabilities are not about browser appearance. They are security gaps hackers exploit before developers fix them. Colombo professionals should update browsers and avoid unsafe sites to protect data."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At professional level, zero-day vulnerabilities are not themes. They are undiscovered security flaws that hackers exploit before patches. Colombo professionals must prioritize browser updates and safe browsing practices."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, zero-day vulnerabilities are not about themes. They are hidden security flaws hackers can exploit. Colombo students should update browsers to protect personal info and passwords."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, zero-day vulnerabilities are serious security flaws, not themes. Colombo students should always update browsers and avoid unsafe links to prevent hacker attacks."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, zero-day vulnerabilities are not themes. They are critical security gaps hackers exploit before patches exist. Colombo university users should keep browsers updated and avoid suspicious websites."
  },
  {
    "questionId": "Q9",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals should know zero-day vulnerabilities are not themes. They are undiscovered security flaws that hackers exploit before patches. Colombo professionals should update browsers and follow safe browsing habits to secure sensitive data."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, zero-day vulnerabilities are not about incognito mode. Incognito just hides your browsing history locally but does not protect against unknown security flaws in the browser. Imagine surfing Colombo café Wi-Fi; a hacker can still exploit a zero-day to steal passwords or personal info. VPNs and browser updates are key protections."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, incognito mode only prevents storing history or cookies locally; it doesn’t prevent zero-day attacks. Colombo students using public Wi-Fi should update browsers and avoid unsafe sites to protect against hackers exploiting security flaws."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, zero-day vulnerabilities are not features of incognito mode. They are security flaws unknown to developers that hackers can exploit. Colombo office workers should always update browsers and use safe browsing practices."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a degree level, zero-day vulnerabilities are not linked to incognito mode. Professionals in Colombo must regularly patch browsers and use secure networks to prevent hackers from exploiting these hidden flaws."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, incognito mode is not the same as a zero-day vulnerability. It just hides history on your device. Hackers can still exploit unpatched browser flaws. Colombo girls should update browsers and be careful on public networks."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, zero-day vulnerabilities are serious security flaws, not features of incognito mode. Colombo students using public Wi-Fi should keep browsers updated to prevent hackers from exploiting unknown security gaps."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, zero-day vulnerabilities are not linked to incognito mode. They are security gaps hackers exploit before patches exist. Colombo university users should update browsers and follow safe browsing practices."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, incognito mode doesn’t prevent zero-day attacks. Professionals in Colombo must patch browsers immediately and avoid unsafe sites to protect sensitive data from hackers exploiting unknown vulnerabilities."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, zero-day vulnerabilities are not incognito features. They are hidden security flaws hackers exploit before developers patch them. Colombo users must update browsers and use safe networks to protect data."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with high IT knowledge, zero-day vulnerabilities are not incognito features. They are critical security gaps hackers can exploit. Colombo students should update browsers and practice safe browsing."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, zero-day vulnerabilities are not features in incognito mode. They are undiscovered security flaws. Colombo professionals should always patch browsers and avoid unsafe websites to protect sensitive info."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, zero-day vulnerabilities are not linked to incognito mode. Colombo professionals must prioritize browser updates and safe browsing habits to prevent hackers from exploiting unknown flaws."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, zero-day vulnerabilities are serious browser flaws, not incognito features. Colombo students must update browsers and use safe networks to avoid hackers stealing personal data."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, zero-day vulnerabilities are security flaws unknown to developers, not incognito features. Colombo students should patch browsers and be careful on public networks."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, zero-day vulnerabilities are hidden security flaws, not part of incognito mode. Colombo university users should update browsers and avoid suspicious websites to stay safe."
  },
  {
    "questionId": "Q9",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals should know zero-day vulnerabilities are not incognito features. Colombo professionals must update browsers and follow safe browsing practices to secure emails, banking info, and work data."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, zero-day vulnerabilities are not changes in cookies. Cookies store website data to remember preferences, but zero-day vulnerabilities are hidden security flaws hackers can exploit before developers fix them. Imagine Colombo café Wi-Fi; even if cookies change, hackers can still steal your login info if the browser is vulnerable."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, cookies only save data like site preferences or login info. Zero-day vulnerabilities are entirely different—they are security flaws unknown to developers that hackers can exploit. Colombo students should always update browsers and avoid suspicious sites."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, thinking zero-day vulnerabilities are about cookies is wrong. These are critical browser flaws hackers exploit before patches exist. Colombo office users should update browsers and follow safe browsing habits to protect personal and work data."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a degree level, zero-day vulnerabilities are not cookie changes. Professionals in Colombo must patch browsers immediately and follow safe browsing practices to avoid hackers exploiting hidden flaws."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, cookies store website data, but zero-day vulnerabilities are hidden browser flaws hackers can exploit. Colombo girls using public networks should update browsers and use safe browsing to protect passwords and personal info."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, changing cookies is not a zero-day vulnerability. These vulnerabilities are security gaps unknown to developers. Colombo students must keep browsers updated to prevent hackers exploiting these flaws."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, zero-day vulnerabilities are not cookie changes. They are security flaws hackers exploit before patches exist. Colombo university users should update browsers and avoid suspicious websites to stay safe."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, zero-day vulnerabilities are critical security flaws, not cookie changes. Professionals in Colombo must update browsers and follow safe browsing habits to secure sensitive data from hackers."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, zero-day vulnerabilities are not related to cookie changes. They are hidden security flaws hackers can exploit. Colombo users should update browsers and use secure networks to protect sensitive information."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with high IT knowledge, zero-day vulnerabilities are not cookie-related. They are critical flaws unknown to developers that hackers exploit. Colombo students should keep browsers updated and practice safe browsing."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, zero-day vulnerabilities are not about cookies. They are undiscovered security flaws that hackers can exploit. Colombo professionals should update browsers and avoid unsafe websites to protect sensitive info."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, zero-day vulnerabilities are not related to cookies. Colombo professionals must prioritize browser updates and safe browsing to prevent hackers from exploiting unknown flaws."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, zero-day vulnerabilities are serious browser flaws, not cookie changes. Colombo students must update browsers and use secure networks to avoid hackers stealing personal data."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, zero-day vulnerabilities are critical security flaws unknown to developers, not cookie changes. Colombo students should patch browsers and avoid unsafe links to prevent hacker attacks."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, zero-day vulnerabilities are hidden browser flaws, not cookie changes. Colombo university users should update browsers and follow safe browsing practices to protect sensitive data."
  },
  {
    "questionId": "Q9",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals should know zero-day vulnerabilities are not cookie changes. Colombo professionals must update browsers and follow safe browsing habits to secure emails, banking info, and work data."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, bookmarking every site you visit doesn’t make browsing safer. While it helps you find pages quickly, it doesn’t protect against hackers, phishing, or malware. Imagine surfing Colombo library Wi-Fi and bookmarking unknown sites; a hacker could still trick you with malicious pages. Safe habits like updating browsers and avoiding suspicious links are much better for security."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, just bookmarking sites is not a security measure. Colombo students might bookmark fun pages, but if those sites have malware or phishing scams, your data could be stolen. Always keep browsers updated and avoid suspicious links instead of relying on bookmarks for safety."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, bookmarking every site doesn’t protect you from online threats. Colombo office users might think bookmarks are safe references, but malicious sites can still steal data. Focus on browser updates and cautious clicking to stay secure."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a degree level, bookmarking sites isn’t a security strategy. Colombo professionals must regularly update browsers and avoid suspicious links to protect sensitive work and personal data, rather than relying on bookmarks for safety."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, bookmarks are just shortcuts to websites; they don’t make browsing safer. Colombo girls using public Wi-Fi could still be at risk if the sites are malicious. Updating browsers and avoiding suspicious links are key safety steps."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, bookmarking sites is not a safe browsing habit. Colombo students might save favorite sites, but unsafe pages can still harm your computer. Always update browsers and stay away from suspicious links to be secure online."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, bookmarking every site won’t protect you from hackers. Colombo university users should focus on safe browsing, like updating browsers and avoiding risky links, rather than just saving sites for later."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, even at a professional level, bookmarks are not security tools. Colombo professionals must regularly update browsers and avoid suspicious links to keep work and personal data safe."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, bookmarking sites doesn’t make you safer online. Even if you organize pages, hackers can still exploit vulnerabilities. Colombo users should update browsers and be cautious with links for real safety."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "High IT knowledge doesn’t make bookmarks a security tool. Colombo students should update browsers and avoid suspicious links; relying on bookmarks will not prevent hacking or malware attacks."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, bookmarking is convenient but not a safety measure. Colombo professionals must update browsers and carefully click links to avoid hackers and data theft."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, bookmarks don’t protect against online threats. Colombo professionals should prioritize browser updates and avoiding suspicious links to maintain cybersecurity."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, bookmarks are only shortcuts and don’t protect from hackers. Colombo students must update browsers and avoid risky links to keep personal info safe online."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, bookmarking websites is convenient but not a safe habit. Colombo students should focus on updating browsers and avoiding suspicious links to protect themselves online."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, bookmarks do not enhance security. Colombo university users should update browsers regularly and avoid clicking suspicious links to ensure safe browsing."
  },
  {
    "questionId": "Q10",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals must remember that bookmarks do not provide cybersecurity. Colombo professionals should prioritize browser updates and avoiding suspicious links to protect sensitive data."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, browsing only at night doesn’t make you safer online. Hackers can attack anytime, day or night. Imagine using Colombo library Wi-Fi at night thinking it’s safe—your personal data can still be stolen. Real safety comes from updating browsers, using secure networks, and avoiding suspicious links."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, the time you browse doesn’t protect you. Hackers in Colombo can operate 24/7, so surfing only at night won’t help. The important thing is to keep your browser updated and avoid unsafe websites."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, browsing at night isn’t a security measure. Colombo office users must update browsers and avoid suspicious links to stay safe, because hackers can attack anytime regardless of the hour."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a degree level, the time of browsing does not improve security. Professionals in Colombo should focus on keeping browsers updated and avoiding malicious links instead of relying on night-time browsing."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, browsing only at night doesn’t protect you. Hackers can attack anytime. Colombo girls should update browsers, use secure Wi-Fi, and avoid suspicious links for real safety online."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, the time you browse doesn’t make you safe. Colombo students should focus on updating browsers and avoiding risky links instead of thinking night-time browsing is secure."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, night-time browsing does not enhance security. Colombo university users must regularly update browsers and avoid suspicious websites to protect personal and academic data."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, even professionals should know that browsing at night does not protect against hackers. Colombo professionals must update browsers and avoid malicious links for proper cybersecurity."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, hackers can attack at any time, so browsing only at night doesn’t help. Colombo users should focus on safe browsing, updating browsers, and avoiding suspicious links."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with high IT knowledge, night-time browsing is not a security measure. Colombo students should keep browsers updated and avoid unsafe websites instead."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, browsing at night does not prevent attacks. Colombo professionals should update browsers and use safe networks to avoid data breaches."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, the timing of browsing does not improve security. Colombo professionals should prioritize updates and safe browsing over night-time browsing habits."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, night browsing doesn’t make you safer. Colombo students should update browsers, use secure networks, and avoid suspicious links to protect personal information."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, browsing at night is not a safety measure. Colombo students should focus on safe habits like browser updates and avoiding risky links."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, night-time browsing doesn’t protect against hackers. Colombo university users should update browsers and avoid suspicious websites for safe browsing."
  },
  {
    "questionId": "Q10",
    "option": "B",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals must know that the time of browsing doesn’t prevent attacks. Colombo professionals should update browsers and avoid malicious links to keep sensitive data secure."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Bro, using only one tab doesn’t make browsing safer. You can open many tabs safely if you avoid suspicious sites and keep your browser updated. Imagine Colombo school students browsing multiple tuition websites; the number of tabs doesn’t matter, security comes from staying alert and avoiding unsafe links."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Putha, limiting yourself to one tab won’t protect you online. Colombo students might think it’s safer, but hackers can exploit vulnerabilities on any tab. Real safety comes from updated browsers and avoiding risky websites."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Bro, using only one tab is not a security measure. Colombo office users can safely browse multiple tabs if browsers are updated and they avoid malicious links. The key is cautious browsing, not the number of tabs."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Even at a degree level, using one tab does not improve safety. Professionals in Colombo must focus on keeping browsers updated and avoiding suspicious links rather than limiting the number of open tabs."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Duwa, using only one tab doesn’t make browsing safe. Colombo girls can open multiple tabs as long as they avoid unsafe websites and update their browsers. Focus on safe habits rather than limiting tabs."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Sis, one tab only is not a safety measure. Colombo students can safely browse multiple sites if they update browsers and avoid suspicious links."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Akka, using one tab doesn’t protect from hackers. Colombo university users should focus on updating browsers and avoiding risky websites instead of limiting tabs."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Girl, using only one tab is not a security practice. Professionals in Colombo should prioritize browser updates and avoiding suspicious links to ensure safe browsing across multiple tabs."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Malli, the number of tabs doesn’t determine safety. Colombo users can open multiple tabs safely as long as they avoid malicious sites and keep browsers updated."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Even with high IT knowledge, using only one tab is not a security measure. Colombo students should update browsers and avoid unsafe websites to protect data."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Brother, limiting to one tab won’t prevent attacks. Colombo professionals must update browsers and follow safe browsing practices to stay secure online."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "At a professional level, using only one tab doesn’t improve security. Colombo professionals should focus on browser updates and safe browsing instead of limiting the number of open tabs."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "O/L"
    },
    "explanation": "Duwa, the number of tabs doesn’t affect safety. Colombo students can open multiple tabs safely if they avoid unsafe links and keep browsers updated."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "A/L"
    },
    "explanation": "Sis, limiting yourself to one tab is not a cybersecurity measure. Colombo students should update browsers and avoid suspicious sites to browse safely."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "HND"
    },
    "explanation": "Akka, using one tab doesn’t prevent online threats. Colombo university users should focus on updating browsers and avoiding risky links for secure browsing."
  },
  {
    "questionId": "Q10",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High",
      "education": "Degree"
    },
    "explanation": "Professionals must understand that limiting tabs is not a security practice. Colombo professionals should prioritize safe browsing and regular updates to stay protected online."
  }
]
