[
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Antivirus is good, but the first lock is your screen PIN. Like having a strong gate before security guard. If someone steals phone with no lock, they access everything instantly."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Antivirus helps, but screen lock is the primary defense. Think of it as your hostel room lock - without it, antivirus is useless if someone has physical access to your device."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "While antivirus software is important for malware protection, a strong screen lock is the first line of defense. It prevents unauthorized physical access, which is often the easiest attack vector."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Antivirus is reactive defense, but screen lock is preventive security. In security layers, physical access control comes first. Strong authentication prevents the most direct attack path - unauthorized physical access."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "You know tech well - antivirus protects from malware, but screen lock stops physical access. It's like firewall vs door lock. Both needed, but door lock is first priority."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "With your technical knowledge, you understand antivirus handles software threats, but screen lock prevents physical compromise. Defense-in-depth starts with physical security controls."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Antivirus addresses malware signatures and behavior, but screen lock prevents the most common attack - physical access when device is unattended. It's the foundation of mobile security architecture."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "As a graduate, you know security models prioritize access control. Antivirus is detective/preventive for malware, but strong authentication (screen lock) is the first security boundary in mobile threat modeling."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Antivirus is helpful, but your screen lock is most important. Like locking your room door before leaving - it stops anyone from getting in and seeing your private things."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Antivirus protects from viruses, but screen lock protects everything. Think of it as locking your diary - without it, anyone can read all your secrets even if you have good antivirus."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Antivirus software is important, but screen lock is your primary security. It's the difference between having alarm system but leaving door unlocked - physical access trumps software protection."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "While antivirus is valuable, screen lock is foundational security. In security hierarchy, physical access control precedes software protection. Without it, all other measures become ineffective."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "You're tech-savvy, so you know antivirus handles software threats, but screen lock handles physical security. Both needed, but preventing physical access is priority one."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "With your skills, you understand antivirus is for malware, but screen lock prevents unauthorized physical access - the most direct threat vector. Security starts with access control."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Antivirus scans for malicious code, but screen lock is authentication barrier. In mobile security framework, strong authentication is the first critical control point before other protections."
  },
  {
    "questionId": "Q01",
    "option": "C",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "As graduate, you recognize antivirus is one layer, but authentication (screen lock) is the initial trust boundary. In security architecture, access control precedes all other protective measures."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Phone case protects from drops, but screen lock protects your data. Imagine having strong box but no lock - anyone can open. Screen lock is the key to your digital life."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Case protects hardware, but screen lock protects information. It's like having bulletproof vest but no password on laptop - physical protection without data security is incomplete."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Phone case prevents physical damage, but screen lock prevents data theft. Hardware protection means nothing if someone can access all your personal information, accounts, and data."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Case protects physical integrity, but screen lock protects data confidentiality and privacy. In security CIA triad, protecting information is more critical than protecting hardware."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "You know tech - case saves from cracks, screen lock saves from hackers. Hardware damage costs money, data breach costs identity. Priority clear."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "Case is physical protection, screen lock is security control. Data value exceeds device value. You can replace broken phone, but can't replace stolen identity or compromised accounts."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Phone case protects hardware asset, screen lock protects information asset. In risk assessment, data exposure risk severity far exceeds physical damage risk."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "Case addresses physical durability, screen lock addresses authentication and access control. Modern security focuses on protecting data integrity and confidentiality, not just device hardware."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Phone case keeps it safe from breaking, but screen lock keeps your photos, messages, and accounts safe from strangers. Data privacy matters more than scratches."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Case protects phone body, screen lock protects your privacy. A broken phone can be fixed, but leaked personal information can cause serious problems in life."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Phone case prevents hardware damage, but screen lock prevents privacy invasion and identity theft. Information security is more critical than physical device protection."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Case protects device, screen lock protects identity. In security context, data confidentiality and access control take precedence over physical durability concerns."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "You understand tech - case saves phone from drops, lock saves data from theft. Hardware is replaceable, compromised data isn't. Security over physical protection."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "Case protects physical asset, lock protects digital identity. With your knowledge, you know stolen data (photos, messages, accounts) causes more harm than broken screen."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Phone case addresses hardware protection, screen lock addresses authentication. Risk analysis shows data breach impact severity exceeds physical damage impact."
  },
  {
    "questionId": "Q01",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "Case protects hardware integrity, screen lock protects information security. Modern threat landscape prioritizes data protection over physical device protection in security architecture."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Updates might make phone bit faster, but real reason is security. Like fixing holes in fence - keeps bad people out. Always update to stay safe from new hacking tricks."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Speed improvement is nice, but updates mainly patch security holes. Think of it as fixing broken locks on doors - hackers constantly find new ways in, updates close those doors."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Performance gains are secondary benefit. Primary purpose is security patching. Updates fix vulnerabilities that attackers exploit. Delaying updates leaves known security gaps open."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Updates may improve performance, but critical function is vulnerability management. Zero-day exploits and CVEs require timely patching. Update delay increases exposure window to known threats."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "You know updates - speed is bonus, security is must. Each update patches discovered vulnerabilities. Without updates, hackers use known exploits to break in."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "Performance optimization is secondary. Updates patch CVEs and security vulnerabilities discovered by researchers or exploited in wild. Timely updates critical for threat mitigation."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Updates deliver security patches for discovered vulnerabilities. Attackers actively exploit known CVEs. Regular updates reduce attack surface and prevent exploitation of documented vulnerabilities."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "Speed improvements are optimization, security patches are necessity. Updates address CVEs, zero-days, and APT techniques. Patch management is critical security control in vulnerability lifecycle."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Faster phone is nice, but updates mainly protect you from hackers. Like updating locks when burglars learn new tricks. Keep updating to stay secure."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Speed is a benefit, but security is the main goal. Updates fix security problems that criminals could use to steal your information. Regular updates keep you protected."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Performance boost is secondary. Updates primarily patch security flaws. Each update closes vulnerabilities that could be exploited to compromise your device and data."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "While speed optimization occurs, core purpose is security vulnerability remediation. Updates patch CVEs and prevent exploitation of documented security flaws."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "You know tech - speed improvement is nice, security patches are essential. Each update fixes vulnerabilities hackers could exploit. Stay updated to stay safe."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "Performance gains are bonus. Primary function is patching security vulnerabilities. Updates address discovered CVEs and exploits, reducing your attack surface."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Updates may optimize performance, but critical purpose is vulnerability management. They patch security flaws attackers exploit. Regular updates essential for security posture."
  },
  {
    "questionId": "Q02",
    "option": "A",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "Speed is optimization; security is mandate. Updates patch CVEs, zero-day exploits, and threat vectors. Timely patch management is foundational security control."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Battery saving is nice, but security is critical. Updates close security holes hackers use. Not updating is like leaving door unlocked because closing it takes effort."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Battery life might improve, but main reason is security patches. Updates fix vulnerabilities discovered by security researchers. Without them, your device has known weaknesses."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Battery optimization is minor benefit. Updates primarily address security vulnerabilities and exploits. Skipping updates leaves device exposed to documented attack vectors."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Battery life is user experience concern, security is critical system concern. Updates patch CVEs and vulnerabilities. Delayed patching increases compromise risk exponentially."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "Battery improvement possible, but security fixes are priority. Updates patch vulnerabilities before attackers exploit them. Always choose security over convenience."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "Power management is optimization, vulnerability patching is necessity. Updates address security flaws and CVEs. Unpatched systems are primary targets for exploitation."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Battery efficiency is performance metric, security patches are risk mitigation. Updates close vulnerability windows. Patch lag creates exploitable attack surface."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Male",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "Battery optimization is UX improvement, security patching is critical control. Updates deliver CVE patches and threat mitigations. Patch management is key vulnerability lifecycle stage."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "O/L"
    },
    "explanation": "Battery life is important, but security protection is more important. Updates fix security problems that could let hackers steal your information."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "A/L"
    },
    "explanation": "Battery improvements are nice, but security patches are essential. Updates close security holes that attackers could use against you. Security first, battery second."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "HND"
    },
    "explanation": "Battery life optimization is benefit, but security vulnerability patching is primary purpose. Updates prevent exploitation of known security flaws."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "School",
      "education": "Degree"
    },
    "explanation": "Battery efficiency is secondary. Core purpose is security patch delivery. Updates address CVEs and exploits, reducing risk exposure and vulnerability window."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "O/L"
    },
    "explanation": "Battery saving is bonus, security patches are must-have. Updates fix vulnerabilities discovered by researchers. Unpatched devices are easy targets."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "A/L"
    },
    "explanation": "Power optimization is nice, vulnerability patching is critical. Updates close security gaps actively exploited by attackers. Regular updates maintain security posture."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "HND"
    },
    "explanation": "Battery life is UX concern, security patches are risk management. Updates deliver CVE fixes and vulnerability remediations. Patch timeliness affects security effectiveness."
  },
  {
    "questionId": "Q02",
    "option": "D",
    "profile": {
      "gender": "Female",
      "proficiency": "High Education",
      "education": "Degree"
    },
    "explanation": "Battery optimization is performance enhancement, security patching is mandatory control. Updates address CVEs and zero-days. Effective patch management reduces threat exposure."
  }
]
